[NoCoverage] ObjectLiteral
src/app/router.tsx:17:7
     path: '/',
     element: <Layout />,
     children: [
-      {
-        index: true,
-        element: (
-          <Tile title="GPP Admin" collapsible={false}>
-            <p>Select a view from the rail. Views arrive one story at a time as they land.</p>
-          </Tile>
-        ),
-      },
+      {},
       { path: 'programs', element: <ProgramsPage /> },
       { path: 'proposals', element: <ProposalsPage /> },

[NoCoverage] BooleanLiteral
src/app/router.tsx:18:16
     element: <Layout />,
     children: [
       {
-        index: true,
+        index: false,
         element: (
           <Tile title="GPP Admin" collapsible={false}>

[NoCoverage] BooleanLiteral
src/app/router.tsx:20:48
       {
         index: true,
         element: (
-          <Tile title="GPP Admin" collapsible={false}>
+          <Tile title="GPP Admin" collapsible={true}>
             <p>Select a view from the rail. Views arrive one story at a time as they land.</p>
           </Tile>

[NoCoverage] ObjectLiteral
src/app/router.tsx:25:7
           </Tile>
         ),
       },
-      { path: 'programs', element: <ProgramsPage /> },
+      {},
       { path: 'proposals', element: <ProposalsPage /> },
       { path: 'change-requests', element: <ChangeRequestsPage /> },

[NoCoverage] StringLiteral
src/app/router.tsx:27:15
       },
       { path: 'programs', element: <ProgramsPage /> },
       { path: 'proposals', element: <ProposalsPage /> },
-      { path: 'change-requests', element: <ChangeRequestsPage /> },
+      { path: "", element: <ChangeRequestsPage /> },
       { path: 'users', element: <UsersPage /> },
       { path: 'cfp', element: <CfpPage /> },

[NoCoverage] StringLiteral
src/app/router.tsx:28:15
       { path: 'programs', element: <ProgramsPage /> },
       { path: 'proposals', element: <ProposalsPage /> },
       { path: 'change-requests', element: <ChangeRequestsPage /> },
-      { path: 'users', element: <UsersPage /> },
+      { path: "", element: <UsersPage /> },
       { path: 'cfp', element: <CfpPage /> },
     ],

[NoCoverage] ObjectLiteral
src/app/router.tsx:29:7
       { path: 'proposals', element: <ProposalsPage /> },
       { path: 'change-requests', element: <ChangeRequestsPage /> },
       { path: 'users', element: <UsersPage /> },
-      { path: 'cfp', element: <CfpPage /> },
+      {},
     ],
   },
