[Survived] BlockStatement
src/app/useTheme.ts:13:19
 export function useTheme(initial: Theme = 'dark'): readonly [Theme, () => void] {
   const [theme, setTheme] = useState<Theme>(initial);
 
-  useEffect(() => {
-    document.body.className = theme;
-  }, [theme]);
+  useEffect(() => {}, [theme]);
 
   const toggle = useCallback(() => {

[Survived] ArrayDeclaration
src/app/useTheme.ts:15:6
 
   useEffect(() => {
     document.body.className = theme;
-  }, [theme]);
+  }, []);
 
   const toggle = useCallback(() => {

[NoCoverage] BlockStatement
src/app/useTheme.ts:17:36
     document.body.className = theme;
   }, [theme]);
 
-  const toggle = useCallback(() => {
-    setTheme((t) => (t === 'dark' ? 'light' : 'dark'));
-  }, []);
+  const toggle = useCallback(() => {}, []);
 
   return [theme, toggle];

[NoCoverage] EqualityOperator
src/app/useTheme.ts:18:22
   }, [theme]);
 
   const toggle = useCallback(() => {
-    setTheme((t) => (t === 'dark' ? 'light' : 'dark'));
+    setTheme((t) => (t !== 'dark' ? 'light' : 'dark'));
   }, []);
 

[NoCoverage] ConditionalExpression
src/app/useTheme.ts:18:22
   }, [theme]);
 
   const toggle = useCallback(() => {
-    setTheme((t) => (t === 'dark' ? 'light' : 'dark'));
+    setTheme((t) => (true ? 'light' : 'dark'));
   }, []);
 
