[NoCoverage] BlockStatement
src/auth/AuthGate.tsx:27:46
 
   // Drop the local token first — that alone signs the app out — then end the
   // SSO session. If that call fails the cookie just expires on its own.
-  const signOut = async (): Promise<void> => {
-    setToken(null);
-    try {
-      await sso.logout();
-    } catch {
-      // Nothing actionable from the gate; the local sign-out already happened.
-    }
-  };
+  const signOut = async (): Promise<void> => {};
 
   if (!isLoggedIn) {

[NoCoverage] BlockStatement
src/auth/AuthGate.tsx:29:9
   // SSO session. If that call fails the cookie just expires on its own.
   const signOut = async (): Promise<void> => {
     setToken(null);
-    try {
-      await sso.logout();
-    } catch {
+    try {} catch {
       // Nothing actionable from the gate; the local sign-out already happened.
     }

[Killed] BooleanLiteral
src/auth/AuthGate.tsx:36:7
     }
   };
 
-  if (!isLoggedIn) {
+  if (isLoggedIn) {
     return (
       <GateScreen icon={<SignIn className="gate-icon" />} title="GPP Admin">
killedBy: AuthGate blocks when not signed in, and does not show admin content
statusReason: Cannot find element with locator: page.getByRole('button', { name: /sign in with orcid/i })

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/auth/AuthGate.tsx:36:7
     }
   };
 
-  if (!isLoggedIn) {
+  if (false) {
     return (
       <GateScreen icon={<SignIn className="gate-icon" />} title="GPP Admin">
killedBy: AuthGate blocks when not signed in, and does not show admin content
statusReason: Cannot find element with locator: page.getByRole('button', { name: /sign in with orcid/i })

<body>
  
  


  <div>

[Survived] ArrowFunction
src/auth/AuthGate.tsx:47:22
           <Button
             label="Sign in with ORCID"
             icon={<SignIn />}
-            onClick={() => (window.location.href = sso.signInUrl())}
+            onClick={() => undefined}
           />
         </div>

[Killed] ConditionalExpression
src/auth/AuthGate.tsx:54:7
     );
   }
 
-  if (!canAccessAdmin) {
+  if (false) {
     return (
       <GateScreen icon={<Lock className="gate-icon" />} title="Access denied">
killedBy: AuthGate denies a signed-in PI, showing their actual role
statusReason: Cannot find element with locator: page.getByText('Access denied')

<body>
  
  


  <div>

[Killed] BlockStatement
src/auth/AuthGate.tsx:54:24
     );
   }
 
-  if (!canAccessAdmin) {
-    return (
-      <GateScreen icon={<Lock className="gate-icon" />} title="Access denied">
-        <p>
-          The Admin interface is restricted to <strong>staff</strong> and <strong>admin</strong> users; you are signed
-          in as <strong>{currentAccess(user).toUpperCase()}</strong>. An admin can grant a staff role from the Users
-          view.
-        </p>
-        <div className="gate-actions">
-          <Button label="Sign out" icon={<SignOut />} outlined onClick={() => void signOut()} />
-        </div>
-      </GateScreen>
-    );
-  }
+  if (!canAccessAdmin) {}
 
   return <>{children}</>;
killedBy: AuthGate denies a signed-in PI, showing their actual role
statusReason: Cannot find element with locator: page.getByText('Access denied')

<body>
  
  


  <div>

[Survived] MethodExpression
src/auth/AuthGate.tsx:59:26
       <GateScreen icon={<Lock className="gate-icon" />} title="Access denied">
         <p>
           The Admin interface is restricted to <strong>staff</strong> and <strong>admin</strong> users; you are signed
-          in as <strong>{currentAccess(user).toUpperCase()}</strong>. An admin can grant a staff role from the Users
+          in as <strong>{currentAccess(user).toLowerCase()}</strong>. An admin can grant a staff role from the Users
           view.
         </p>

[Survived] ArrowFunction
src/auth/AuthGate.tsx:63:73
           view.
         </p>
         <div className="gate-actions">
-          <Button label="Sign out" icon={<SignOut />} outlined onClick={() => void signOut()} />
+          <Button label="Sign out" icon={<SignOut />} outlined onClick={() => undefined} />
         </div>
       </GateScreen>
