[NoCoverage] EqualityOperator
src/auth/AuthSession.tsx:29:22
   const switchedFor = useRef<string | null>(null);
 
   // Silent bootstrap: with no live session, try the refresh-token cookie once.
-  const isLoggedIn = user !== null && exp !== null && exp > new Date();
+  const isLoggedIn = user === null && exp !== null && exp > new Date();
   useEffect(() => {
     if (isLoggedIn) return;

[NoCoverage] ConditionalExpression
src/auth/AuthSession.tsx:29:55
   const switchedFor = useRef<string | null>(null);
 
   // Silent bootstrap: with no live session, try the refresh-token cookie once.
-  const isLoggedIn = user !== null && exp !== null && exp > new Date();
+  const isLoggedIn = user !== null && exp !== null && true;
   useEffect(() => {
     if (isLoggedIn) return;

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:30:19
 
   // Silent bootstrap: with no live session, try the refresh-token cookie once.
   const isLoggedIn = user !== null && exp !== null && exp > new Date();
-  useEffect(() => {
-    if (isLoggedIn) return;
-    const controller = new AbortController();
-    void sso.refreshToken(controller.signal).then((fresh) => {
-      if (fresh && !controller.signal.aborted) setToken(fresh);
-    });
-    return () => {
-      controller.abort();
-    };
-  }, [isLoggedIn, setToken]);
+  useEffect(() => {}, [isLoggedIn, setToken]);
 
   // Proactive refresh: check every second; refresh shortly before expiry.

[NoCoverage] ConditionalExpression
src/auth/AuthSession.tsx:31:9
   // Silent bootstrap: with no live session, try the refresh-token cookie once.
   const isLoggedIn = user !== null && exp !== null && exp > new Date();
   useEffect(() => {
-    if (isLoggedIn) return;
+    if (false) return;
     const controller = new AbortController();
     void sso.refreshToken(controller.signal).then((fresh) => {

[NoCoverage] ConditionalExpression
src/auth/AuthSession.tsx:31:9
   // Silent bootstrap: with no live session, try the refresh-token cookie once.
   const isLoggedIn = user !== null && exp !== null && exp > new Date();
   useEffect(() => {
-    if (isLoggedIn) return;
+    if (true) return;
     const controller = new AbortController();
     void sso.refreshToken(controller.signal).then((fresh) => {

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:33:62
   useEffect(() => {
     if (isLoggedIn) return;
     const controller = new AbortController();
-    void sso.refreshToken(controller.signal).then((fresh) => {
-      if (fresh && !controller.signal.aborted) setToken(fresh);
-    });
+    void sso.refreshToken(controller.signal).then((fresh) => {});
     return () => {
       controller.abort();

[NoCoverage] LogicalOperator
src/auth/AuthSession.tsx:34:11
     if (isLoggedIn) return;
     const controller = new AbortController();
     void sso.refreshToken(controller.signal).then((fresh) => {
-      if (fresh && !controller.signal.aborted) setToken(fresh);
+      if (fresh || !controller.signal.aborted) setToken(fresh);
     });
     return () => {

[NoCoverage] BooleanLiteral
src/auth/AuthSession.tsx:34:20
     if (isLoggedIn) return;
     const controller = new AbortController();
     void sso.refreshToken(controller.signal).then((fresh) => {
-      if (fresh && !controller.signal.aborted) setToken(fresh);
+      if (fresh && controller.signal.aborted) setToken(fresh);
     });
     return () => {

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:36:18
     void sso.refreshToken(controller.signal).then((fresh) => {
       if (fresh && !controller.signal.aborted) setToken(fresh);
     });
-    return () => {
-      controller.abort();
-    };
+    return () => {};
   }, [isLoggedIn, setToken]);
 

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:45:19
   // Guard against overlapping attempts and back off after a failure so a
   // refresh that cannot succeed doesn't retry once per second.
   const expMs = exp?.getTime();
-  useEffect(() => {
-    if (expMs === undefined) return;
-    const controller = new AbortController();
-    let inFlight = false;
-    let nextAttempt = 0;
-    const id = window.setInterval(() => {
-      const now = Date.now();
-      if (inFlight || now < nextAttempt) return;
-      if (expMs - EXPIRATION_ANTICIPATION_SECONDS * 1000 >= now) return;
-      inFlight = true;
-      void sso
-        .refreshToken(controller.signal)
-        .then((fresh) => {
-          if (fresh && !controller.signal.aborted) setToken(fresh);
-          else nextAttempt = Date.now() + 30_000;
-        })
-        .finally(() => {
-          inFlight = false;
-        });
-    }, 1000);
-    return () => {
-      window.clearInterval(id);
-      controller.abort();
-    };
-  }, [expMs, setToken]);
+  useEffect(() => {}, [expMs, setToken]);
 
   // Auto-switch to a staff/admin role when the active role is lower.

[NoCoverage] BooleanLiteral
src/auth/AuthSession.tsx:48:20
   useEffect(() => {
     if (expMs === undefined) return;
     const controller = new AbortController();
-    let inFlight = false;
+    let inFlight = true;
     let nextAttempt = 0;
     const id = window.setInterval(() => {

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:50:41
     const controller = new AbortController();
     let inFlight = false;
     let nextAttempt = 0;
-    const id = window.setInterval(() => {
-      const now = Date.now();
-      if (inFlight || now < nextAttempt) return;
-      if (expMs - EXPIRATION_ANTICIPATION_SECONDS * 1000 >= now) return;
-      inFlight = true;
-      void sso
-        .refreshToken(controller.signal)
-        .then((fresh) => {
-          if (fresh && !controller.signal.aborted) setToken(fresh);
-          else nextAttempt = Date.now() + 30_000;
-        })
-        .finally(() => {
-          inFlight = false;
-        });
-    }, 1000);
+    const id = window.setInterval(() => {}, 1000);
     return () => {
       window.clearInterval(id);

[NoCoverage] LogicalOperator
src/auth/AuthSession.tsx:52:11
     let nextAttempt = 0;
     const id = window.setInterval(() => {
       const now = Date.now();
-      if (inFlight || now < nextAttempt) return;
+      if (inFlight && now < nextAttempt) return;
       if (expMs - EXPIRATION_ANTICIPATION_SECONDS * 1000 >= now) return;
       inFlight = true;

[NoCoverage] ConditionalExpression
src/auth/AuthSession.tsx:52:23
     let nextAttempt = 0;
     const id = window.setInterval(() => {
       const now = Date.now();
-      if (inFlight || now < nextAttempt) return;
+      if (inFlight || false) return;
       if (expMs - EXPIRATION_ANTICIPATION_SECONDS * 1000 >= now) return;
       inFlight = true;

[NoCoverage] ConditionalExpression
src/auth/AuthSession.tsx:53:11
     const id = window.setInterval(() => {
       const now = Date.now();
       if (inFlight || now < nextAttempt) return;
-      if (expMs - EXPIRATION_ANTICIPATION_SECONDS * 1000 >= now) return;
+      if (true) return;
       inFlight = true;
       void sso

[NoCoverage] EqualityOperator
src/auth/AuthSession.tsx:53:11
     const id = window.setInterval(() => {
       const now = Date.now();
       if (inFlight || now < nextAttempt) return;
-      if (expMs - EXPIRATION_ANTICIPATION_SECONDS * 1000 >= now) return;
+      if (expMs - EXPIRATION_ANTICIPATION_SECONDS * 1000 < now) return;
       inFlight = true;
       void sso

[NoCoverage] BooleanLiteral
src/auth/AuthSession.tsx:54:18
       const now = Date.now();
       if (inFlight || now < nextAttempt) return;
       if (expMs - EXPIRATION_ANTICIPATION_SECONDS * 1000 >= now) return;
-      inFlight = true;
+      inFlight = false;
       void sso
         .refreshToken(controller.signal)

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:57:26
       inFlight = true;
       void sso
         .refreshToken(controller.signal)
-        .then((fresh) => {
-          if (fresh && !controller.signal.aborted) setToken(fresh);
-          else nextAttempt = Date.now() + 30_000;
-        })
+        .then((fresh) => {})
         .finally(() => {
           inFlight = false;

[NoCoverage] ConditionalExpression
src/auth/AuthSession.tsx:58:15
       void sso
         .refreshToken(controller.signal)
         .then((fresh) => {
-          if (fresh && !controller.signal.aborted) setToken(fresh);
+          if (true) setToken(fresh);
           else nextAttempt = Date.now() + 30_000;
         })

[NoCoverage] BooleanLiteral
src/auth/AuthSession.tsx:58:24
       void sso
         .refreshToken(controller.signal)
         .then((fresh) => {
-          if (fresh && !controller.signal.aborted) setToken(fresh);
+          if (fresh && controller.signal.aborted) setToken(fresh);
           else nextAttempt = Date.now() + 30_000;
         })

[NoCoverage] ArithmeticOperator
src/auth/AuthSession.tsx:59:30
         .refreshToken(controller.signal)
         .then((fresh) => {
           if (fresh && !controller.signal.aborted) setToken(fresh);
-          else nextAttempt = Date.now() + 30_000;
+          else nextAttempt = Date.now() - 30_000;
         })
         .finally(() => {

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:61:24
           if (fresh && !controller.signal.aborted) setToken(fresh);
           else nextAttempt = Date.now() + 30_000;
         })
-        .finally(() => {
-          inFlight = false;
-        });
+        .finally(() => {});
     }, 1000);
     return () => {

[NoCoverage] BooleanLiteral
src/auth/AuthSession.tsx:62:22
           else nextAttempt = Date.now() + 30_000;
         })
         .finally(() => {
-          inFlight = false;
+          inFlight = true;
         });
     }, 1000);

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:65:18
           inFlight = false;
         });
     }, 1000);
-    return () => {
-      window.clearInterval(id);
-      controller.abort();
-    };
+    return () => {};
   }, [expMs, setToken]);
 

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:72:19
   }, [expMs, setToken]);
 
   // Auto-switch to a staff/admin role when the active role is lower.
-  useEffect(() => {
-    if (!token || user?.type !== 'standard') return;
-    if (switchedFor.current === token) return;
-    if (user.role.type === 'staff' || user.role.type === 'admin') return;
-    const staffRole = user.otherRoles.find((r) => r.type === 'staff' || r.type === 'admin');
-    if (staffRole) {
-      switchedFor.current = token;
-      sso
-        .setRole(staffRole.id)
-        .then(setToken)
-        .catch((err: unknown) => {
-          toast.error('Role switch failed', err instanceof Error ? err.message : String(err));
-        });
-    }
-  }, [token, user, setToken, toast]);
+  useEffect(() => {}, [token, user, setToken, toast]);
 
   return null;

[NoCoverage] BooleanLiteral
src/auth/AuthSession.tsx:73:9
 
   // Auto-switch to a staff/admin role when the active role is lower.
   useEffect(() => {
-    if (!token || user?.type !== 'standard') return;
+    if (token || user?.type !== 'standard') return;
     if (switchedFor.current === token) return;
     if (user.role.type === 'staff' || user.role.type === 'admin') return;

[NoCoverage] EqualityOperator
src/auth/AuthSession.tsx:74:9
   // Auto-switch to a staff/admin role when the active role is lower.
   useEffect(() => {
     if (!token || user?.type !== 'standard') return;
-    if (switchedFor.current === token) return;
+    if (switchedFor.current !== token) return;
     if (user.role.type === 'staff' || user.role.type === 'admin') return;
     const staffRole = user.otherRoles.find((r) => r.type === 'staff' || r.type === 'admin');

[NoCoverage] ConditionalExpression
src/auth/AuthSession.tsx:74:9
   // Auto-switch to a staff/admin role when the active role is lower.
   useEffect(() => {
     if (!token || user?.type !== 'standard') return;
-    if (switchedFor.current === token) return;
+    if (false) return;
     if (user.role.type === 'staff' || user.role.type === 'admin') return;
     const staffRole = user.otherRoles.find((r) => r.type === 'staff' || r.type === 'admin');

[NoCoverage] EqualityOperator
src/auth/AuthSession.tsx:75:39
   useEffect(() => {
     if (!token || user?.type !== 'standard') return;
     if (switchedFor.current === token) return;
-    if (user.role.type === 'staff' || user.role.type === 'admin') return;
+    if (user.role.type === 'staff' || user.role.type !== 'admin') return;
     const staffRole = user.otherRoles.find((r) => r.type === 'staff' || r.type === 'admin');
     if (staffRole) {

[NoCoverage] ConditionalExpression
src/auth/AuthSession.tsx:75:9
   useEffect(() => {
     if (!token || user?.type !== 'standard') return;
     if (switchedFor.current === token) return;
-    if (user.role.type === 'staff' || user.role.type === 'admin') return;
+    if (false) return;
     const staffRole = user.otherRoles.find((r) => r.type === 'staff' || r.type === 'admin');
     if (staffRole) {

[NoCoverage] EqualityOperator
src/auth/AuthSession.tsx:76:73
     if (!token || user?.type !== 'standard') return;
     if (switchedFor.current === token) return;
     if (user.role.type === 'staff' || user.role.type === 'admin') return;
-    const staffRole = user.otherRoles.find((r) => r.type === 'staff' || r.type === 'admin');
+    const staffRole = user.otherRoles.find((r) => r.type === 'staff' || r.type !== 'admin');
     if (staffRole) {
       switchedFor.current = token;

[NoCoverage] ConditionalExpression
src/auth/AuthSession.tsx:76:51
     if (!token || user?.type !== 'standard') return;
     if (switchedFor.current === token) return;
     if (user.role.type === 'staff' || user.role.type === 'admin') return;
-    const staffRole = user.otherRoles.find((r) => r.type === 'staff' || r.type === 'admin');
+    const staffRole = user.otherRoles.find((r) => true);
     if (staffRole) {
       switchedFor.current = token;

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:77:20
     if (switchedFor.current === token) return;
     if (user.role.type === 'staff' || user.role.type === 'admin') return;
     const staffRole = user.otherRoles.find((r) => r.type === 'staff' || r.type === 'admin');
-    if (staffRole) {
-      switchedFor.current = token;
-      sso
-        .setRole(staffRole.id)
-        .then(setToken)
-        .catch((err: unknown) => {
-          toast.error('Role switch failed', err instanceof Error ? err.message : String(err));
-        });
-    }
+    if (staffRole) {}
   }, [token, user, setToken, toast]);
 

[NoCoverage] BlockStatement
src/auth/AuthSession.tsx:82:34
       sso
         .setRole(staffRole.id)
         .then(setToken)
-        .catch((err: unknown) => {
-          toast.error('Role switch failed', err instanceof Error ? err.message : String(err));
-        });
+        .catch((err: unknown) => {});
     }
   }, [token, user, setToken, toast]);

[NoCoverage] StringLiteral
src/auth/AuthSession.tsx:83:23
         .setRole(staffRole.id)
         .then(setToken)
         .catch((err: unknown) => {
-          toast.error('Role switch failed', err instanceof Error ? err.message : String(err));
+          toast.error("", err instanceof Error ? err.message : String(err));
         });
     }

[NoCoverage] ArrayDeclaration
src/auth/AuthSession.tsx:86:6
           toast.error('Role switch failed', err instanceof Error ? err.message : String(err));
         });
     }
-  }, [token, user, setToken, toast]);
+  }, []);
 
   return null;
