[Survived] StringLiteral
src/auth/environments.ts:23:11
 
 const DEV: Environment = {
   name: 'development',
-  ssoUri: 'https://sso-dev.gpp.lucuma.xyz',
+  ssoUri: "",
   odbUri: 'https://lucuma-postgres-odb-dev.herokuapp.com/odb',
   ssoGraphqlUri: 'https://sso-dev.gpp.lucuma.xyz/graphql',

[Survived] StringLiteral
src/auth/environments.ts:25:18
   name: 'development',
   ssoUri: 'https://sso-dev.gpp.lucuma.xyz',
   odbUri: 'https://lucuma-postgres-odb-dev.herokuapp.com/odb',
-  ssoGraphqlUri: 'https://sso-dev.gpp.lucuma.xyz/graphql',
+  ssoGraphqlUri: "",
 };
 

[Survived] StringLiteral
src/auth/environments.ts:30:11
 
 const STAGING: Environment = {
   name: 'staging',
-  ssoUri: 'https://sso-test.gpp.gemini.edu',
+  ssoUri: "",
   odbUri: 'https://lucuma-postgres-odb-staging.herokuapp.com/odb',
   ssoGraphqlUri: 'https://sso-test.gpp.gemini.edu/graphql',

[Survived] StringLiteral
src/auth/environments.ts:32:18
   name: 'staging',
   ssoUri: 'https://sso-test.gpp.gemini.edu',
   odbUri: 'https://lucuma-postgres-odb-staging.herokuapp.com/odb',
-  ssoGraphqlUri: 'https://sso-test.gpp.gemini.edu/graphql',
+  ssoGraphqlUri: "",
 };
 

[Survived] StringLiteral
src/auth/environments.ts:38:11
 const PRODUCTION: Environment = {
   name: 'production',
   ssoUri: 'https://sso.gpp.gemini.edu',
-  odbUri: 'https://lucuma-postgres-odb-production.herokuapp.com/odb',
+  odbUri: "",
   ssoGraphqlUri: 'https://sso.gpp.gemini.edu/graphql',
 };

[Survived] ObjectLiteral
src/auth/environments.ts:50:22
   ssoGraphqlUri: '/sso-graphql',
 };
 
-const environments = {
-  'admin-dev.lucuma.xyz': DEV,
-  'admin-staging.lucuma.xyz': STAGING,
-  'admin.gemini.edu': PRODUCTION,
-  localhost: LOCAL_DEV,
-} satisfies Record<string, Environment>;
+const environments = {} satisfies Record<string, Environment>;
 
 /** The environment a hostname resolves to; unknown hosts (dev-server

[Killed] LogicalOperator
src/auth/environments.ts:60:10
 /** The environment a hostname resolves to; unknown hosts (dev-server
  *  aliases, previews) fall through to the proxied local-dev entry. */
 export function environmentFor(hostname: string): Environment {
-  return environments[hostname as keyof typeof environments] ?? LOCAL_DEV;
+  return environments[hostname as keyof typeof environments] && LOCAL_DEV;
 }
 
killedBy: environmentFor resolves each deployed admin host to its own services
statusReason: expected '/odb' to be 'https://lucuma-postgres-odb-dev.herok…' // Object.is equality
