[NoCoverage] StringLiteral
src/auth/ssoClient.ts:26:15
 export async function refreshToken(signal?: AbortSignal): Promise<string | null> {
   try {
     const res = await fetch(new URL('/api/v1/refresh-token', CURRENT_ENV.ssoUri), {
-      method: 'POST',
+      method: "",
       credentials: 'include',
       signal: signal ?? null,

[NoCoverage] LogicalOperator
src/auth/ssoClient.ts:28:15
     const res = await fetch(new URL('/api/v1/refresh-token', CURRENT_ENV.ssoUri), {
       method: 'POST',
       credentials: 'include',
-      signal: signal ?? null,
+      signal: signal && null,
     });
     if (!res.ok) return null;

[NoCoverage] BooleanLiteral
src/auth/ssoClient.ts:30:9
       credentials: 'include',
       signal: signal ?? null,
     });
-    if (!res.ok) return null;
+    if (res.ok) return null;
     const token = (await res.text()).trim();
     return token || null;

[NoCoverage] ConditionalExpression
src/auth/ssoClient.ts:30:9
       credentials: 'include',
       signal: signal ?? null,
     });
-    if (!res.ok) return null;
+    if (true) return null;
     const token = (await res.text()).trim();
     return token || null;

[NoCoverage] MethodExpression
src/auth/ssoClient.ts:31:19
       signal: signal ?? null,
     });
     if (!res.ok) return null;
-    const token = (await res.text()).trim();
+    const token = await res.text();
     return token || null;
   } catch {

[NoCoverage] LogicalOperator
src/auth/ssoClient.ts:32:12
     });
     if (!res.ok) return null;
     const token = (await res.text()).trim();
-    return token || null;
+    return token && null;
   } catch {
     return null;

[NoCoverage] StringLiteral
src/auth/ssoClient.ts:42:37
  *  so the gate can demonstrate the denial honestly rather than erroring. */
 export async function guestLogin(): Promise<string | null> {
   try {
-    const res = await fetch(new URL('/api/v1/auth-as-guest', CURRENT_ENV.ssoUri), {
+    const res = await fetch(new URL("", CURRENT_ENV.ssoUri), {
       method: 'POST',
       credentials: 'include',

[NoCoverage] ObjectLiteral
src/auth/ssoClient.ts:42:83
  *  so the gate can demonstrate the denial honestly rather than erroring. */
 export async function guestLogin(): Promise<string | null> {
   try {
-    const res = await fetch(new URL('/api/v1/auth-as-guest', CURRENT_ENV.ssoUri), {
-      method: 'POST',
-      credentials: 'include',
-    });
+    const res = await fetch(new URL('/api/v1/auth-as-guest', CURRENT_ENV.ssoUri), {});
     if (!res.ok) return null;
     const token = (await res.text()).trim();

[NoCoverage] StringLiteral
src/auth/ssoClient.ts:43:15
 export async function guestLogin(): Promise<string | null> {
   try {
     const res = await fetch(new URL('/api/v1/auth-as-guest', CURRENT_ENV.ssoUri), {
-      method: 'POST',
+      method: "",
       credentials: 'include',
     });

[NoCoverage] ConditionalExpression
src/auth/ssoClient.ts:46:9
       method: 'POST',
       credentials: 'include',
     });
-    if (!res.ok) return null;
+    if (false) return null;
     const token = (await res.text()).trim();
     return token || null;

[NoCoverage] StringLiteral
src/auth/ssoClient.ts:57:23
 /** The ORCID sign-in URL; navigating here begins the login redirect. `state`
  *  is where SSO returns the browser after the round-trip. */
 export function signInUrl(returnTo: string = window.location.href): string {
-  const url = new URL('/auth/v1/stage1', CURRENT_ENV.ssoUri);
+  const url = new URL("", CURRENT_ENV.ssoUri);
   url.searchParams.set('state', returnTo);
   return url.toString();

[NoCoverage] StringLiteral
src/auth/ssoClient.ts:58:24
  *  is where SSO returns the browser after the round-trip. */
 export function signInUrl(returnTo: string = window.location.href): string {
   const url = new URL('/auth/v1/stage1', CURRENT_ENV.ssoUri);
-  url.searchParams.set('state', returnTo);
+  url.searchParams.set("", returnTo);
   return url.toString();
 }

[NoCoverage] StringLiteral
src/auth/ssoClient.ts:66:24
  *  Throws when SSO rejects the switch or is unreachable. */
 export async function setRole(roleId: string): Promise<string> {
   const url = new URL('/auth/v1/set-role', CURRENT_ENV.ssoUri);
-  url.searchParams.set('role', roleId);
+  url.searchParams.set("", roleId);
   const res = await fetch(url, { method: 'GET', credentials: 'include' });
   if (!res.ok) throw new Error(`SSO rejected the role switch (${String(res.status)}).`);

[NoCoverage] ObjectLiteral
src/auth/ssoClient.ts:67:32
 export async function setRole(roleId: string): Promise<string> {
   const url = new URL('/auth/v1/set-role', CURRENT_ENV.ssoUri);
   url.searchParams.set('role', roleId);
-  const res = await fetch(url, { method: 'GET', credentials: 'include' });
+  const res = await fetch(url, {});
   if (!res.ok) throw new Error(`SSO rejected the role switch (${String(res.status)}).`);
   const fresh = await refreshToken();

[NoCoverage] ConditionalExpression
src/auth/ssoClient.ts:68:7
   const url = new URL('/auth/v1/set-role', CURRENT_ENV.ssoUri);
   url.searchParams.set('role', roleId);
   const res = await fetch(url, { method: 'GET', credentials: 'include' });
-  if (!res.ok) throw new Error(`SSO rejected the role switch (${String(res.status)}).`);
+  if (false) throw new Error(`SSO rejected the role switch (${String(res.status)}).`);
   const fresh = await refreshToken();
   if (!fresh) throw new Error('SSO accepted the role switch but returned no fresh token.');

[NoCoverage] BooleanLiteral
src/auth/ssoClient.ts:68:7
   const url = new URL('/auth/v1/set-role', CURRENT_ENV.ssoUri);
   url.searchParams.set('role', roleId);
   const res = await fetch(url, { method: 'GET', credentials: 'include' });
-  if (!res.ok) throw new Error(`SSO rejected the role switch (${String(res.status)}).`);
+  if (res.ok) throw new Error(`SSO rejected the role switch (${String(res.status)}).`);
   const fresh = await refreshToken();
   if (!fresh) throw new Error('SSO accepted the role switch but returned no fresh token.');

[NoCoverage] BlockStatement
src/auth/ssoClient.ts:77:47
 /** End the SSO session. Throws when SSO rejects the call or is unreachable —
  *  callers should clear the local token first, then report the failure (the
  *  session cookie survives until it expires on its own). */
-export async function logout(): Promise<void> {
-  const res = await fetch(new URL('/api/v1/logout', CURRENT_ENV.ssoUri), { method: 'POST', credentials: 'include' });
-  if (!res.ok) throw new Error(`SSO logout failed (${String(res.status)}).`);
-}
+export async function logout(): Promise<void> {}
 

[NoCoverage] ConditionalExpression
src/auth/ssoClient.ts:79:7
  *  session cookie survives until it expires on its own). */
 export async function logout(): Promise<void> {
   const res = await fetch(new URL('/api/v1/logout', CURRENT_ENV.ssoUri), { method: 'POST', credentials: 'include' });
-  if (!res.ok) throw new Error(`SSO logout failed (${String(res.status)}).`);
+  if (false) throw new Error(`SSO logout failed (${String(res.status)}).`);
 }
 

[NoCoverage] ConditionalExpression
src/auth/ssoClient.ts:79:7
  *  session cookie survives until it expires on its own). */
 export async function logout(): Promise<void> {
   const res = await fetch(new URL('/api/v1/logout', CURRENT_ENV.ssoUri), { method: 'POST', credentials: 'include' });
-  if (!res.ok) throw new Error(`SSO logout failed (${String(res.status)}).`);
+  if (true) throw new Error(`SSO logout failed (${String(res.status)}).`);
 }
 
