[Killed] ConditionalExpression
src/auth/user.ts:64:5
 export function currentAccess(user: User | null): RoleAccess {
   if (!user) return 'guest';
   switch (user.type) {
-    case 'standard':
-      return user.role.type;
+    case 'standard':
     case 'service':
       return 'service';
killedBy: AuthGate denies a signed-in PI, showing their actual role; currentAccess reads the active standard role
statusReason: Cannot find element with locator: page.getByText('Access denied')

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/auth/user.ts:66:5
   switch (user.type) {
     case 'standard':
       return user.role.type;
-    case 'service':
-      return 'service';
+    case 'service':
     case 'guest':
       return 'guest';
killedBy: currentAccess maps guest/service/null
statusReason: expected 'guest' to be 'service' // Object.is equality

[Killed] EqualityOperator
src/auth/user.ts:74:10
 }
 
 export function accessAtLeast(user: User | null, min: RoleAccess): boolean {
-  return ACCESS_ORDER[currentAccess(user)] >= ACCESS_ORDER[min];
+  return ACCESS_ORDER[currentAccess(user)] < ACCESS_ORDER[min];
 }
 
killedBy: AuthGate denies a signed-in PI, showing their actual role; accessAtLeast (hierarchy guest<pi<ngo<staff<admin<service) staff meets the staff bar; pi does not
statusReason: Cannot find element with locator: page.getByText('Access denied')

<body>
  
  


  <div>

[Killed] EqualityOperator
src/auth/user.ts:74:10
 }
 
 export function accessAtLeast(user: User | null, min: RoleAccess): boolean {
-  return ACCESS_ORDER[currentAccess(user)] >= ACCESS_ORDER[min];
+  return ACCESS_ORDER[currentAccess(user)] > ACCESS_ORDER[min];
 }
 
killedBy: AuthGate renders the app for staff; accessAtLeast (hierarchy guest<pi<ngo<staff<admin<service) staff meets the staff bar; pi does not
statusReason: Cannot find element with locator: page.getByText('ADMIN CONTENT')

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/auth/user.ts:87:7
   if (user.type === 'service') return `Service User (${user.name})`;
   const p = user.profile.profile;
   if (p.creditName) return p.creditName;
-  if (p.givenName && p.familyName) return `${p.givenName} ${p.familyName}`;
+  if (false) return `${p.givenName} ${p.familyName}`;
   if (p.familyName) return p.familyName;
   if (p.givenName) return p.givenName;
killedBy: Layout shows the wordmark, environment pill, and signed-in user; displayName prefers given + family name
statusReason: Cannot find element with locator: page.getByText('Ada Lovelace')

<body
  class="dark"
>

[Survived] LogicalOperator
src/auth/user.ts:87:7
   if (user.type === 'service') return `Service User (${user.name})`;
   const p = user.profile.profile;
   if (p.creditName) return p.creditName;
-  if (p.givenName && p.familyName) return `${p.givenName} ${p.familyName}`;
+  if (p.givenName || p.familyName) return `${p.givenName} ${p.familyName}`;
   if (p.familyName) return p.familyName;
   if (p.givenName) return p.givenName;
