[Timeout] ArrowFunction
src/components/ConflictsTable.tsx:28:24
   readonly sources: readonly ConflictSource[];
 }): JSX.Element {
   const { candidates, loading, error } = useConflictCandidates(sources);
-  const rows = useMemo(() => matchConflicts(sources, candidates), [sources, candidates]);
+  const rows = useMemo(() => undefined, [sources, candidates]);
 
   return (

[Timeout] ConditionalExpression
src/components/ConflictsTable.tsx:37:10
       >
         {title}
-        {loading && <Spinner spin className="check-spinner" />}
+        {false}
       </h3>
       {error && (

[Survived] ConditionalExpression
src/components/ConflictsTable.tsx:37:10
       >
         {title}
-        {loading && <Spinner spin className="check-spinner" />}
+        {true}
       </h3>
       {error && (

[Timeout] ConditionalExpression
src/components/ConflictsTable.tsx:39:8
         {title}
         {loading && <Spinner spin className="check-spinner" />}
       </h3>
-      {error && (
-        <p className="check-error">
-          <TriangleExclamation /> Conflict check failed: {friendlyError(error)}
-        </p>
-      )}
+      {true}
       <DataTable
         value={rows}

[Survived] ConditionalExpression
src/components/ConflictsTable.tsx:39:8
         {title}
         {loading && <Spinner spin className="check-spinner" />}
       </h3>
-      {error && (
-        <p className="check-error">
-          <TriangleExclamation /> Conflict check failed: {friendlyError(error)}
-        </p>
-      )}
+      {false}
       <DataTable
         value={rows}

[Timeout] StringLiteral
src/components/ConflictsTable.tsx:48:63
         value={rows}
         dataKey="key"
         className="pl-striped-table"
-        emptyMessage={loading ? 'Checking active programs…' : 'No conflicting plans found in other active programs.'}
+        emptyMessage={loading ? 'Checking active programs…' : ""}
       >
         <Column

[Survived] ObjectLiteral
src/components/ConflictsTable.tsx:53:18
         <Column
           field="sourceId"
           header="ID"
-          style={{ width: '6rem' }}
+          style={{}}
           headerTooltip="The selected request/observation this conflict applies to."
         />

[Timeout] StringLiteral
src/components/ConflictsTable.tsx:53:27
         <Column
           field="sourceId"
           header="ID"
-          style={{ width: '6rem' }}
+          style={{ width: "" }}
           headerTooltip="The selected request/observation this conflict applies to."
         />

[Timeout] StringLiteral
src/components/ConflictsTable.tsx:59:27
         <Column
           field="label"
           header="ObsId"
-          style={{ width: '14rem' }}
+          style={{ width: "" }}
           headerTooltip="The conflicting plan: a configuration request (program reference + request id) or a ToO program's observation reference."
         />

[Timeout] ObjectLiteral
src/components/ConflictsTable.tsx:59:18
         <Column
           field="label"
           header="ObsId"
-          style={{ width: '14rem' }}
+          style={{}}
           headerTooltip="The conflicting plan: a configuration request (program reference + request id) or a ToO program's observation reference."
         />

[Timeout] ArrowFunction
src/components/ConflictsTable.tsx:76:17
         <Column
           header="RA"
           style={{ width: '7rem' }}
-          body={(r: ConflictRow) => r.raDeg?.toFixed(5) ?? '—'}
+          body={() => undefined}
           headerTooltip="Right ascension of the conflicting plan, degrees."
         />

[NoCoverage] LogicalOperator
src/components/ConflictsTable.tsx:76:37
         <Column
           header="RA"
           style={{ width: '7rem' }}
-          body={(r: ConflictRow) => r.raDeg?.toFixed(5) ?? '—'}
+          body={(r: ConflictRow) => r.raDeg?.toFixed(5) && '—'}
           headerTooltip="Right ascension of the conflicting plan, degrees."
         />

[Timeout] StringLiteral
src/components/ConflictsTable.tsx:81:27
         />
         <Column
           header="Dec"
-          style={{ width: '7rem' }}
+          style={{ width: "" }}
           body={(r: ConflictRow) => r.decDeg?.toFixed(5) ?? '—'}
           headerTooltip="Declination of the conflicting plan, degrees."

[Timeout] ObjectLiteral
src/components/ConflictsTable.tsx:81:18
         />
         <Column
           header="Dec"
-          style={{ width: '7rem' }}
+          style={{}}
           body={(r: ConflictRow) => r.decDeg?.toFixed(5) ?? '—'}
           headerTooltip="Declination of the conflicting plan, degrees."

[NoCoverage] LogicalOperator
src/components/ConflictsTable.tsx:82:37
         <Column
           header="Dec"
           style={{ width: '7rem' }}
-          body={(r: ConflictRow) => r.decDeg?.toFixed(5) ?? '—'}
+          body={(r: ConflictRow) => r.decDeg?.toFixed(5) && '—'}
           headerTooltip="Declination of the conflicting plan, degrees."
         />

[Timeout] ArrowFunction
src/components/ConflictsTable.tsx:82:17
         <Column
           header="Dec"
           style={{ width: '7rem' }}
-          body={(r: ConflictRow) => r.decDeg?.toFixed(5) ?? '—'}
+          body={() => undefined}
           headerTooltip="Declination of the conflicting plan, degrees."
         />

[Survived] ObjectLiteral
src/components/ConflictsTable.tsx:87:18
         />
         <Column
           header="Sep"
-          style={{ width: '5rem' }}
+          style={{}}
           headerTooltip="Angular separation from the requested coordinates."
           body={(r: ConflictRow) => `${r.sepArcsec.toFixed(1)}″`}

[Survived] ArrowFunction
src/components/ConflictsTable.tsx:89:17
           header="Sep"
           style={{ width: '5rem' }}
           headerTooltip="Angular separation from the requested coordinates."
-          body={(r: ConflictRow) => `${r.sepArcsec.toFixed(1)}″`}
+          body={() => undefined}
         />
         <Column header="Config" style={{ width: '10rem' }} body={(r: ConflictRow) => formatModeType(r.modeType)} />

[Survived] ArrowFunction
src/components/ConflictsTable.tsx:91:66
           headerTooltip="Angular separation from the requested coordinates."
           body={(r: ConflictRow) => `${r.sepArcsec.toFixed(1)}″`}
         />
-        <Column header="Config" style={{ width: '10rem' }} body={(r: ConflictRow) => formatModeType(r.modeType)} />
+        <Column header="Config" style={{ width: '10rem' }} body={() => undefined} />
       </DataTable>
     </section>

[Survived] ObjectLiteral
src/components/ConflictsTable.tsx:91:40
           headerTooltip="Angular separation from the requested coordinates."
           body={(r: ConflictRow) => `${r.sepArcsec.toFixed(1)}″`}
         />
-        <Column header="Config" style={{ width: '10rem' }} body={(r: ConflictRow) => formatModeType(r.modeType)} />
+        <Column header="Config" style={{}} body={(r: ConflictRow) => formatModeType(r.modeType)} />
       </DataTable>
     </section>
