[Timeout] ConditionalExpression
src/components/DataSourceBadge.tsx:20:7
   /** True when the query succeeded but returned nothing for this token. */
   empty?: boolean;
 }): JSX.Element {
-  if (loading) {
+  if (true) {
     return (
       <span className="ds-badge ds-loading" title="Querying…">

[Survived] ConditionalExpression
src/components/DataSourceBadge.tsx:20:7
   /** True when the query succeeded but returned nothing for this token. */
   empty?: boolean;
 }): JSX.Element {
-  if (loading) {
+  if (false) {
     return (
       <span className="ds-badge ds-loading" title="Querying…">

[Timeout] EqualityOperator
src/components/DataSourceBadge.tsx:27:7
       </span>
     );
   }
-  if (error !== undefined) {
+  if (error === undefined) {
     return (
       <span className="ds-badge ds-warn" title={error}>

[NoCoverage] BlockStatement
src/components/DataSourceBadge.tsx:27:28
       </span>
     );
   }
-  if (error !== undefined) {
-    return (
-      <span className="ds-badge ds-warn" title={error}>
-        <TriangleExclamation /> {error}
-      </span>
-    );
-  }
+  if (error !== undefined) {}
   if (empty) {
     return (

[Timeout] ConditionalExpression
src/components/DataSourceBadge.tsx:34:7
       </span>
     );
   }
-  if (empty) {
+  if (false) {
     return (
       <span className="ds-badge ds-empty" title="The query returned no rows your role can see.">

[NoCoverage] BlockStatement
src/components/DataSourceBadge.tsx:34:14
       </span>
     );
   }
-  if (empty) {
-    return (
-      <span className="ds-badge ds-empty" title="The query returned no rows your role can see.">
-        <Circle /> No records for your role
-      </span>
-    );
-  }
+  if (empty) {}
   return (
     <span className="ds-badge ds-live" title="Live data.">
