[Timeout] BlockStatement
src/components/DuplicatesTable.tsx:36:19
 function useDuplicates(sources: readonly DuplicateSource[]): DuplicatesState {
   const [fetched, setFetched] = useState<FetchedDuplicates>(NOTHING_FETCHED);
   const sourcesRef = useRef(sources);
-  useEffect(() => {
-    sourcesRef.current = sources;
-  });
+  useEffect(() => {});
   const key = sources.length === 0 ? '' : JSON.stringify(sources.map((s) => [s.id, s.raDeg, s.decDeg, s.modeType]));
   useEffect(() => {

[Survived] ConditionalExpression
src/components/DuplicatesTable.tsx:39:15
   useEffect(() => {
     sourcesRef.current = sources;
   });
-  const key = sources.length === 0 ? '' : JSON.stringify(sources.map((s) => [s.id, s.raDeg, s.decDeg, s.modeType]));
+  const key = true ? '' : JSON.stringify(sources.map((s) => [s.id, s.raDeg, s.decDeg, s.modeType]));
   useEffect(() => {
     if (key === '') return;

[Survived] ConditionalExpression
src/components/DuplicatesTable.tsx:39:15
   useEffect(() => {
     sourcesRef.current = sources;
   });
-  const key = sources.length === 0 ? '' : JSON.stringify(sources.map((s) => [s.id, s.raDeg, s.decDeg, s.modeType]));
+  const key = false ? '' : JSON.stringify(sources.map((s) => [s.id, s.raDeg, s.decDeg, s.modeType]));
   useEffect(() => {
     if (key === '') return;

[Timeout] BlockStatement
src/components/DuplicatesTable.tsx:40:19
     sourcesRef.current = sources;
   });
   const key = sources.length === 0 ? '' : JSON.stringify(sources.map((s) => [s.id, s.raDeg, s.decDeg, s.modeType]));
-  useEffect(() => {
-    if (key === '') return;
-    const controller = new AbortController();
-    findDuplicates(sourcesRef.current, controller.signal)
-      .then((rows) => setFetched({ forKey: key, rows, error: null }))
-      .catch((err: unknown) => {
-        if (controller.signal.aborted) return;
-        setFetched({ forKey: key, rows: [], error: err instanceof Error ? err.message : String(err) });
-      });
-    return () => controller.abort();
-  }, [key]);
+  useEffect(() => {}, [key]);
   if (key === '') return { rows: [], loading: false, error: null };
   const current = fetched.forKey === key;

[Timeout] EqualityOperator
src/components/DuplicatesTable.tsx:41:9
   });
   const key = sources.length === 0 ? '' : JSON.stringify(sources.map((s) => [s.id, s.raDeg, s.decDeg, s.modeType]));
   useEffect(() => {
-    if (key === '') return;
+    if (key !== '') return;
     const controller = new AbortController();
     findDuplicates(sourcesRef.current, controller.signal)

[Survived] ConditionalExpression
src/components/DuplicatesTable.tsx:41:9
   });
   const key = sources.length === 0 ? '' : JSON.stringify(sources.map((s) => [s.id, s.raDeg, s.decDeg, s.modeType]));
   useEffect(() => {
-    if (key === '') return;
+    if (false) return;
     const controller = new AbortController();
     findDuplicates(sourcesRef.current, controller.signal)

[NoCoverage] ArrowFunction
src/components/DuplicatesTable.tsx:44:13
     if (key === '') return;
     const controller = new AbortController();
     findDuplicates(sourcesRef.current, controller.signal)
-      .then((rows) => setFetched({ forKey: key, rows, error: null }))
+      .then(() => undefined)
       .catch((err: unknown) => {
         if (controller.signal.aborted) return;

[NoCoverage] BlockStatement
src/components/DuplicatesTable.tsx:45:32
     const controller = new AbortController();
     findDuplicates(sourcesRef.current, controller.signal)
       .then((rows) => setFetched({ forKey: key, rows, error: null }))
-      .catch((err: unknown) => {
-        if (controller.signal.aborted) return;
-        setFetched({ forKey: key, rows: [], error: err instanceof Error ? err.message : String(err) });
-      });
+      .catch((err: unknown) => {});
     return () => controller.abort();
   }, [key]);

[NoCoverage] ConditionalExpression
src/components/DuplicatesTable.tsx:46:13
     findDuplicates(sourcesRef.current, controller.signal)
       .then((rows) => setFetched({ forKey: key, rows, error: null }))
       .catch((err: unknown) => {
-        if (controller.signal.aborted) return;
+        if (false) return;
         setFetched({ forKey: key, rows: [], error: err instanceof Error ? err.message : String(err) });
       });

[Timeout] ConditionalExpression
src/components/DuplicatesTable.tsx:51:7
       });
     return () => controller.abort();
   }, [key]);
-  if (key === '') return { rows: [], loading: false, error: null };
+  if (false) return { rows: [], loading: false, error: null };
   const current = fetched.forKey === key;
   return {

[Timeout] ConditionalExpression
src/components/DuplicatesTable.tsx:51:7
       });
     return () => controller.abort();
   }, [key]);
-  if (key === '') return { rows: [], loading: false, error: null };
+  if (true) return { rows: [], loading: false, error: null };
   const current = fetched.forKey === key;
   return {

[NoCoverage] ConditionalExpression
src/components/DuplicatesTable.tsx:52:19
     return () => controller.abort();
   }, [key]);
   if (key === '') return { rows: [], loading: false, error: null };
-  const current = fetched.forKey === key;
+  const current = true;
   return {
     rows: current ? fetched.rows : [],

[NoCoverage] EqualityOperator
src/components/DuplicatesTable.tsx:52:19
     return () => controller.abort();
   }, [key]);
   if (key === '') return { rows: [], loading: false, error: null };
-  const current = fetched.forKey === key;
+  const current = fetched.forKey !== key;
   return {
     rows: current ? fetched.rows : [],

[NoCoverage] BooleanLiteral
src/components/DuplicatesTable.tsx:55:14
   const current = fetched.forKey === key;
   return {
     rows: current ? fetched.rows : [],
-    loading: !current,
+    loading: current,
     error: current ? fetched.error : null,
   };

[NoCoverage] EqualityOperator
src/components/DuplicatesTable.tsx:75:66
 }): JSX.Element {
   const { rows, loading, error } = useDuplicates(sources);
 
-  const unsearchable = sources.filter((s) => s.raDeg === null || s.decDeg === null).length;
+  const unsearchable = sources.filter((s) => s.raDeg === null || s.decDeg !== null).length;
 
   return (

[Timeout] MethodExpression
src/components/DuplicatesTable.tsx:75:24
 }): JSX.Element {
   const { rows, loading, error } = useDuplicates(sources);
 
-  const unsearchable = sources.filter((s) => s.raDeg === null || s.decDeg === null).length;
+  const unsearchable = sources.length;
 
   return (

[Survived] LogicalOperator
src/components/DuplicatesTable.tsx:84:10
       >
         {title}
-        {loading && <Spinner spin className="check-spinner" />}
+        {loading || <Spinner spin className="check-spinner" />}
       </h3>
       {error && (

[Survived] ConditionalExpression
src/components/DuplicatesTable.tsx:86:8
         {title}
         {loading && <Spinner spin className="check-spinner" />}
       </h3>
-      {error && (
-        <p className="check-error">
-          <TriangleExclamation /> Archive query failed: {error}
-        </p>
-      )}
+      {false}
       {unsearchable > 0 && !loading && (
         <p className="check-note">

[Survived] LogicalOperator
src/components/DuplicatesTable.tsx:86:8
         {title}
         {loading && <Spinner spin className="check-spinner" />}
       </h3>
-      {error && (
-        <p className="check-error">
-          <TriangleExclamation /> Archive query failed: {error}
-        </p>
-      )}
+      {error || <p className="check-error">
+          <TriangleExclamation /> Archive query failed: {error}
+        </p>}
       {unsearchable > 0 && !loading && (
         <p className="check-note">

[Survived] LogicalOperator
src/components/DuplicatesTable.tsx:91:8
           <TriangleExclamation /> Archive query failed: {error}
         </p>
       )}
-      {unsearchable > 0 && !loading && (
-        <p className="check-note">
-          {unsearchable} of {sources.length} selected can’t be checked — no fixed coordinates (e.g. a Target of
-          Opportunity configuration).
-        </p>
-      )}
+      {unsearchable > 0 && !loading || <p className="check-note">
+          {unsearchable} of {sources.length} selected can’t be checked — no fixed coordinates (e.g. a Target of
+          Opportunity configuration).
+        </p>}
       <DataTable
         value={rows as DuplicateRow[]}

[Survived] EqualityOperator
src/components/DuplicatesTable.tsx:91:8
           <TriangleExclamation /> Archive query failed: {error}
         </p>
       )}
-      {unsearchable > 0 && !loading && (
+      {unsearchable <= 0 && !loading && (
         <p className="check-note">
           {unsearchable} of {sources.length} selected can’t be checked — no fixed coordinates (e.g. a Target of

[Survived] StringLiteral
src/components/DuplicatesTable.tsx:101:60
         value={rows as DuplicateRow[]}
         dataKey="key"
         className="pl-striped-table"
-        emptyMessage={loading ? 'Searching the archive…' : 'No potential duplicates found in the archive.'}
+        emptyMessage={loading ? 'Searching the archive…' : ""}
       >
         <Column

[Survived] ArrowFunction
src/components/DuplicatesTable.tsx:113:17
           header="ObsId"
           style={{ width: '13rem' }}
           headerTooltip="The archive observation containing the matching data. Opens the archive search for that observation."
-          body={(r: DuplicateRow) => (
-            <a href={`https://archive.gemini.edu/searchform/${r.observationId}`} target="_blank" rel="noreferrer">
-              {r.observationId}
-            </a>
-          )}
+          body={() => undefined}
         />
         <Column

[Survived] StringLiteral
src/components/DuplicatesTable.tsx:121:27
         />
         <Column
           header="P / #"
-          style={{ width: '5rem' }}
+          style={{ width: "" }}
           headerTooltip="Files with QA = Pass / total files in this observation. Visitor instruments may not set QA."
           body={(r: DuplicateRow) => `${r.passCount} / ${r.fileCount}`}

[Survived] ArrowFunction
src/components/DuplicatesTable.tsx:123:17
           header="P / #"
           style={{ width: '5rem' }}
           headerTooltip="Files with QA = Pass / total files in this observation. Visitor instruments may not set QA."
-          body={(r: DuplicateRow) => `${r.passCount} / ${r.fileCount}`}
+          body={() => undefined}
         />
         <Column field="target" header="Target" headerTooltip="The archive dataset's object name." />

[NoCoverage] StringLiteral
src/components/DuplicatesTable.tsx:123:38
           header="P / #"
           style={{ width: '5rem' }}
           headerTooltip="Files with QA = Pass / total files in this observation. Visitor instruments may not set QA."
-          body={(r: DuplicateRow) => `${r.passCount} / ${r.fileCount}`}
+          body={(r: DuplicateRow) => ``}
         />
         <Column field="target" header="Target" headerTooltip="The archive dataset's object name." />

[Survived] StringLiteral
src/components/DuplicatesTable.tsx:128:27
         <Column field="target" header="Target" headerTooltip="The archive dataset's object name." />
         <Column
           header="RA"
-          style={{ width: '7rem' }}
+          style={{ width: "" }}
           body={(r: DuplicateRow) => r.raDeg?.toFixed(5) ?? '—'}
           headerTooltip="Right ascension of the archive data, degrees."

[Survived] ArrowFunction
src/components/DuplicatesTable.tsx:129:17
         <Column
           header="RA"
           style={{ width: '7rem' }}
-          body={(r: DuplicateRow) => r.raDeg?.toFixed(5) ?? '—'}
+          body={() => undefined}
           headerTooltip="Right ascension of the archive data, degrees."
         />

[NoCoverage] LogicalOperator
src/components/DuplicatesTable.tsx:129:38
         <Column
           header="RA"
           style={{ width: '7rem' }}
-          body={(r: DuplicateRow) => r.raDeg?.toFixed(5) ?? '—'}
+          body={(r: DuplicateRow) => r.raDeg?.toFixed(5) && '—'}
           headerTooltip="Right ascension of the archive data, degrees."
         />

[NoCoverage] LogicalOperator
src/components/DuplicatesTable.tsx:135:38
         <Column
           header="Dec"
           style={{ width: '7rem' }}
-          body={(r: DuplicateRow) => r.decDeg?.toFixed(5) ?? '—'}
+          body={(r: DuplicateRow) => r.decDeg?.toFixed(5) && '—'}
           headerTooltip="Declination of the archive data, degrees."
         />

[Survived] ArrowFunction
src/components/DuplicatesTable.tsx:135:17
         <Column
           header="Dec"
           style={{ width: '7rem' }}
-          body={(r: DuplicateRow) => r.decDeg?.toFixed(5) ?? '—'}
+          body={() => undefined}
           headerTooltip="Declination of the archive data, degrees."
         />

[Survived] ArrowFunction
src/components/DuplicatesTable.tsx:142:17
           header="Sep"
           style={{ width: '5rem' }}
           headerTooltip="Angular separation between the archive data and the requested coordinates."
-          body={(r: DuplicateRow) => (r.sepArcsec === null ? '—' : `${r.sepArcsec.toFixed(1)}″`)}
+          body={() => undefined}
         />
         <Column field="instrument" header="Instrument" style={{ width: '7rem' }} />

[Survived] ObjectLiteral
src/components/DuplicatesTable.tsx:144:63
           headerTooltip="Angular separation between the archive data and the requested coordinates."
           body={(r: DuplicateRow) => (r.sepArcsec === null ? '—' : `${r.sepArcsec.toFixed(1)}″`)}
         />
-        <Column field="instrument" header="Instrument" style={{ width: '7rem' }} />
+        <Column field="instrument" header="Instrument" style={{}} />
         <Column field="fpu" header="FPU" style={{ width: '7rem' }} headerTooltip="Focal plane unit (slit / mask)." />
         <Column field="disperser" header="Disperser" style={{ width: '6rem' }} />

[Timeout] StringLiteral
src/components/DuplicatesTable.tsx:145:58
           body={(r: DuplicateRow) => (r.sepArcsec === null ? '—' : `${r.sepArcsec.toFixed(1)}″`)}
         />
         <Column field="instrument" header="Instrument" style={{ width: '7rem' }} />
-        <Column field="fpu" header="FPU" style={{ width: '7rem' }} headerTooltip="Focal plane unit (slit / mask)." />
+        <Column field="fpu" header="FPU" style={{ width: "" }} headerTooltip="Focal plane unit (slit / mask)." />
         <Column field="disperser" header="Disperser" style={{ width: '6rem' }} />
         <Column

[Survived] ObjectLiteral
src/components/DuplicatesTable.tsx:146:61
         />
         <Column field="instrument" header="Instrument" style={{ width: '7rem' }} />
         <Column field="fpu" header="FPU" style={{ width: '7rem' }} headerTooltip="Focal plane unit (slit / mask)." />
-        <Column field="disperser" header="Disperser" style={{ width: '6rem' }} />
+        <Column field="disperser" header="Disperser" style={{}} />
         <Column
           header="λ"

[Survived] ObjectLiteral
src/components/DuplicatesTable.tsx:149:18
         <Column field="disperser" header="Disperser" style={{ width: '6rem' }} />
         <Column
           header="λ"
-          style={{ width: '4.5rem' }}
+          style={{}}
           headerTooltip="Central wavelength, µm."
           body={(r: DuplicateRow) => r.wavelengthUm?.toFixed(2) ?? '—'}

[Survived] StringLiteral
src/components/DuplicatesTable.tsx:149:27
         <Column field="disperser" header="Disperser" style={{ width: '6rem' }} />
         <Column
           header="λ"
-          style={{ width: '4.5rem' }}
+          style={{ width: "" }}
           headerTooltip="Central wavelength, µm."
           body={(r: DuplicateRow) => r.wavelengthUm?.toFixed(2) ?? '—'}

[Survived] ArrowFunction
src/components/DuplicatesTable.tsx:151:17
           header="λ"
           style={{ width: '4.5rem' }}
           headerTooltip="Central wavelength, µm."
-          body={(r: DuplicateRow) => r.wavelengthUm?.toFixed(2) ?? '—'}
+          body={() => undefined}
         />
         <Column field="filter" header="Filter" style={{ width: '6rem' }} />

[NoCoverage] LogicalOperator
src/components/DuplicatesTable.tsx:151:38
           header="λ"
           style={{ width: '4.5rem' }}
           headerTooltip="Central wavelength, µm."
-          body={(r: DuplicateRow) => r.wavelengthUm?.toFixed(2) ?? '—'}
+          body={(r: DuplicateRow) => r.wavelengthUm?.toFixed(2) && '—'}
         />
         <Column field="filter" header="Filter" style={{ width: '6rem' }} />
