[Survived] MethodExpression
src/components/Icons.tsx:32:20
 const kebabToPascalCase = (str: string) =>
   str
     .split('-')
-    .map((part) => part.charAt(0).toUpperCase() + part.slice(1))
+    .map((part) => part.toUpperCase() + part.slice(1))
     .join('');
 

[Survived] ArrowFunction
src/components/Icons.tsx:32:10
 const kebabToPascalCase = (str: string) =>
   str
     .split('-')
-    .map((part) => part.charAt(0).toUpperCase() + part.slice(1))
+    .map(() => undefined)
     .join('');
 

[Survived] StringLiteral
src/components/Icons.tsx:33:11
   str
     .split('-')
     .map((part) => part.charAt(0).toUpperCase() + part.slice(1))
-    .join('');
+    .join("Stryker was here!");
 
 const iconFactory = (icon: IconDefinition) =>

[Survived] ObjectLiteral
src/components/Icons.tsx:41:5
       'use memo';
       return <FontAwesomeIcon {...props} icon={icon} />;
     },
-    { displayName: kebabToPascalCase(icon.iconName) + 'Icon' },
+    {},
   );
 

[Survived] StringLiteral
src/components/Icons.tsx:41:55
       'use memo';
       return <FontAwesomeIcon {...props} icon={icon} />;
     },
-    { displayName: kebabToPascalCase(icon.iconName) + 'Icon' },
+    { displayName: kebabToPascalCase(icon.iconName) + "" },
   );
 
