[Survived] BooleanLiteral
src/components/Tile.tsx:13:11
   title,
   controls,
   children,
-  flush = false,
+  flush = true,
   collapsible = true,
 }: {

[Timeout] BooleanLiteral
src/components/Tile.tsx:14:17
   controls,
   children,
   flush = false,
-  collapsible = true,
+  collapsible = false,
 }: {
   title: string;

[Killed] BooleanLiteral
src/components/Tile.tsx:23:46
   flush?: boolean;
   collapsible?: boolean;
 }): JSX.Element {
-  const [collapsed, setCollapsed] = useState(false);
+  const [collapsed, setCollapsed] = useState(true);
 
   return (
killedBy: UsersPage renders the role-assignment grid with a column per partner + Staff/Adm; ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByText('Last')

<body>
  
  


  <div>

[Timeout] ConditionalExpression
src/components/Tile.tsx:31:12
         <span className="xp-tile-title-text">{title}</span>
         <div className="xp-tile-controls">
           {controls}
-          {collapsible && (
-            <button
-              type="button"
-              className="xp-icon-btn"
-              title={collapsed ? 'Expand this panel' : 'Collapse this panel'}
-              onClick={() => setCollapsed((c) => !c)}
-            >
-              <i className={cn('pi', collapsed ? 'pi-chevron-down' : 'pi-chevron-up')} />
-            </button>
-          )}
+          {true}
         </div>
       </div>

[Survived] ConditionalExpression
src/components/Tile.tsx:31:12
         <span className="xp-tile-title-text">{title}</span>
         <div className="xp-tile-controls">
           {controls}
-          {collapsible && (
-            <button
-              type="button"
-              className="xp-icon-btn"
-              title={collapsed ? 'Expand this panel' : 'Collapse this panel'}
-              onClick={() => setCollapsed((c) => !c)}
-            >
-              <i className={cn('pi', collapsed ? 'pi-chevron-down' : 'pi-chevron-up')} />
-            </button>
-          )}
+          {false}
         </div>
       </div>

[NoCoverage] StringLiteral
src/components/Tile.tsx:35:34
             <button
               type="button"
               className="xp-icon-btn"
-              title={collapsed ? 'Expand this panel' : 'Collapse this panel'}
+              title={collapsed ? "" : 'Collapse this panel'}
               onClick={() => setCollapsed((c) => !c)}
             >

[NoCoverage] BooleanLiteral
src/components/Tile.tsx:36:50
               type="button"
               className="xp-icon-btn"
               title={collapsed ? 'Expand this panel' : 'Collapse this panel'}
-              onClick={() => setCollapsed((c) => !c)}
+              onClick={() => setCollapsed((c) => c)}
             >
               <i className={cn('pi', collapsed ? 'pi-chevron-down' : 'pi-chevron-up')} />

[Survived] ArrowFunction
src/components/Tile.tsx:36:24
               type="button"
               className="xp-icon-btn"
               title={collapsed ? 'Expand this panel' : 'Collapse this panel'}
-              onClick={() => setCollapsed((c) => !c)}
+              onClick={() => undefined}
             >
               <i className={cn('pi', collapsed ? 'pi-chevron-down' : 'pi-chevron-up')} />

[Survived] StringLiteral
src/components/Tile.tsx:38:70
               title={collapsed ? 'Expand this panel' : 'Collapse this panel'}
               onClick={() => setCollapsed((c) => !c)}
             >
-              <i className={cn('pi', collapsed ? 'pi-chevron-down' : 'pi-chevron-up')} />
+              <i className={cn('pi', collapsed ? 'pi-chevron-down' : "")} />
             </button>
           )}

[Timeout] ConditionalExpression
src/components/Tile.tsx:43:8
           )}
         </div>
       </div>
-      {!collapsed && <div className={cn('xp-tile-body', flush && 'is-flush')}>{children}</div>}
+      {true}
     </section>
   );

[Timeout] BooleanLiteral
src/components/Tile.tsx:43:8
           )}
         </div>
       </div>
-      {!collapsed && <div className={cn('xp-tile-body', flush && 'is-flush')}>{children}</div>}
+      {collapsed && <div className={cn('xp-tile-body', flush && 'is-flush')}>{children}</div>}
     </section>
   );
