[Survived] MethodExpression
src/components/TimeAwardsGrid.tsx:25:29
  */
 export function TimeAwardsGrid({ allocations, onChange }: TimeAwardsGridProps): JSX.Element {
   const partnerRows = useMemo(() => [...new Set(allocations.map((a) => a.category))], [allocations]);
-  const availablePartners = PARTNERS.filter((p) => !partnerRows.includes(p));
+  const availablePartners = PARTNERS;
   const [partnerToAdd, setPartnerToAdd] = useState<Partner | null>(null);
 

[Survived] BooleanLiteral
src/components/TimeAwardsGrid.tsx:25:52
  */
 export function TimeAwardsGrid({ allocations, onChange }: TimeAwardsGridProps): JSX.Element {
   const partnerRows = useMemo(() => [...new Set(allocations.map((a) => a.category))], [allocations]);
-  const availablePartners = PARTNERS.filter((p) => !partnerRows.includes(p));
+  const availablePartners = PARTNERS.filter((p) => partnerRows.includes(p));
   const [partnerToAdd, setPartnerToAdd] = useState<Partner | null>(null);
 

[Survived] ArrowFunction
src/components/TimeAwardsGrid.tsx:29:29
   const [partnerToAdd, setPartnerToAdd] = useState<Partner | null>(null);
 
   function hoursFor(category: Partner, band: ScienceBand): number {
-    return allocations.find((a) => a.category === category && a.scienceBand === band)?.hours ?? 0;
+    return allocations.find(() => undefined)?.hours ?? 0;
   }
   function setHours(category: Partner, band: ScienceBand, hours: number): void {

[Survived] EqualityOperator
src/components/TimeAwardsGrid.tsx:29:36
   const [partnerToAdd, setPartnerToAdd] = useState<Partner | null>(null);
 
   function hoursFor(category: Partner, band: ScienceBand): number {
-    return allocations.find((a) => a.category === category && a.scienceBand === band)?.hours ?? 0;
+    return allocations.find((a) => a.category !== category && a.scienceBand === band)?.hours ?? 0;
   }
   function setHours(category: Partner, band: ScienceBand, hours: number): void {

[Survived] BlockStatement
src/components/TimeAwardsGrid.tsx:31:80
   function hoursFor(category: Partner, band: ScienceBand): number {
     return allocations.find((a) => a.category === category && a.scienceBand === band)?.hours ?? 0;
   }
-  function setHours(category: Partner, band: ScienceBand, hours: number): void {
-    // Keep zero-hour cells: dropping them would remove the partner's row when
-    // its last non-zero cell is cleared. allocationsInput filters zeros out
-    // of the mutation instead.
-    const rest = allocations.filter((a) => !(a.category === category && a.scienceBand === band));
-    onChange([...rest, { category, scienceBand: band, hours }]);
-  }
+  function setHours(category: Partner, band: ScienceBand, hours: number): void {}
   function addPartner(category: Partner): void {
     // Seed a zero Band-1 cell so the row appears; user fills the rest.

[Survived] ConditionalExpression
src/components/TimeAwardsGrid.tsx:35:46
     // Keep zero-hour cells: dropping them would remove the partner's row when
     // its last non-zero cell is cleared. allocationsInput filters zeros out
     // of the mutation instead.
-    const rest = allocations.filter((a) => !(a.category === category && a.scienceBand === band));
+    const rest = allocations.filter((a) => !(true));
     onChange([...rest, { category, scienceBand: band, hours }]);
   }

[Survived] ConditionalExpression
src/components/TimeAwardsGrid.tsx:35:46
     // Keep zero-hour cells: dropping them would remove the partner's row when
     // its last non-zero cell is cleared. allocationsInput filters zeros out
     // of the mutation instead.
-    const rest = allocations.filter((a) => !(a.category === category && a.scienceBand === band));
+    const rest = allocations.filter((a) => !(true && a.scienceBand === band));
     onChange([...rest, { category, scienceBand: band, hours }]);
   }

[Killed] ArrayDeclaration
src/components/TimeAwardsGrid.tsx:36:14
     // its last non-zero cell is cleared. allocationsInput filters zeros out
     // of the mutation instead.
     const rest = allocations.filter((a) => !(a.category === category && a.scienceBand === band));
-    onChange([...rest, { category, scienceBand: band, hours }]);
+    onChange([]);
   }
   function addPartner(category: Partner): void {
killedBy: TimeAwardsGrid keeps a partner row visible when its only allocation is zeroed
statusReason: Cannot find element with locator: page.getByText('United States')

<body>
  
  


  <div>

[NoCoverage] BlockStatement
src/components/TimeAwardsGrid.tsx:38:48
     const rest = allocations.filter((a) => !(a.category === category && a.scienceBand === band));
     onChange([...rest, { category, scienceBand: band, hours }]);
   }
-  function addPartner(category: Partner): void {
-    // Seed a zero Band-1 cell so the row appears; user fills the rest.
-    onChange([...allocations, { category, scienceBand: 'BAND1', hours: 0 }]);
-  }
+  function addPartner(category: Partner): void {}
   function removePartner(category: Partner): void {
     onChange(allocations.filter((a) => a.category !== category));

[NoCoverage] ArrayDeclaration
src/components/TimeAwardsGrid.tsx:40:14
   }
   function addPartner(category: Partner): void {
     // Seed a zero Band-1 cell so the row appears; user fills the rest.
-    onChange([...allocations, { category, scienceBand: 'BAND1', hours: 0 }]);
+    onChange([]);
   }
   function removePartner(category: Partner): void {

[NoCoverage] BlockStatement
src/components/TimeAwardsGrid.tsx:42:51
     // Seed a zero Band-1 cell so the row appears; user fills the rest.
     onChange([...allocations, { category, scienceBand: 'BAND1', hours: 0 }]);
   }
-  function removePartner(category: Partner): void {
-    onChange(allocations.filter((a) => a.category !== category));
-  }
+  function removePartner(category: Partner): void {}
 
   const bandTotal = (band: ScienceBand): number => partnerRows.reduce((sum, p) => sum + hoursFor(p, band), 0);

[NoCoverage] ArrowFunction
src/components/TimeAwardsGrid.tsx:43:33
     onChange([...allocations, { category, scienceBand: 'BAND1', hours: 0 }]);
   }
   function removePartner(category: Partner): void {
-    onChange(allocations.filter((a) => a.category !== category));
+    onChange(allocations.filter(() => undefined));
   }
 

[NoCoverage] ConditionalExpression
src/components/TimeAwardsGrid.tsx:43:40
     onChange([...allocations, { category, scienceBand: 'BAND1', hours: 0 }]);
   }
   function removePartner(category: Partner): void {
-    onChange(allocations.filter((a) => a.category !== category));
+    onChange(allocations.filter((a) => false));
   }
 

[Survived] ArithmeticOperator
src/components/TimeAwardsGrid.tsx:46:83
     onChange(allocations.filter((a) => a.category !== category));
   }
 
-  const bandTotal = (band: ScienceBand): number => partnerRows.reduce((sum, p) => sum + hoursFor(p, band), 0);
+  const bandTotal = (band: ScienceBand): number => partnerRows.reduce((sum, p) => sum - hoursFor(p, band), 0);
   const grandTotal = BANDS.reduce((sum, b) => sum + bandTotal(b), 0);
 

[Survived] ArithmeticOperator
src/components/TimeAwardsGrid.tsx:47:47
   }
 
   const bandTotal = (band: ScienceBand): number => partnerRows.reduce((sum, p) => sum + hoursFor(p, band), 0);
-  const grandTotal = BANDS.reduce((sum, b) => sum + bandTotal(b), 0);
+  const grandTotal = BANDS.reduce((sum, b) => sum - bandTotal(b), 0);
 
   return (

[Survived] ArrowFunction
src/components/TimeAwardsGrid.tsx:55:22
         <tr>
           <th />
           <th className="awards-partner-h">Partner</th>
-          {BANDS.map((b) => (
-            <th key={b}>{BAND_LABEL[b]}</th>
-          ))}
+          {BANDS.map(() => undefined)}
           <th>Total</th>
         </tr>

[Survived] ArithmeticOperator
src/components/TimeAwardsGrid.tsx:63:53
       </thead>
       <tbody>
         {partnerRows.map((partner) => {
-          const rowTotal = BANDS.reduce((sum, b) => sum + hoursFor(partner, b), 0);
+          const rowTotal = BANDS.reduce((sum, b) => sum - hoursFor(partner, b), 0);
           return (
             <tr key={partner}>

[Survived] ArrowFunction
src/components/TimeAwardsGrid.tsx:70:28
                 <button
                   type="button"
                   title={`Remove ${PARTNER_NAME[partner]} (${partner}) and all its band allocations`}
-                  onClick={() => removePartner(partner)}
+                  onClick={() => undefined}
                 >
                   <CircleXMark />

[Timeout] ArrowFunction
src/components/TimeAwardsGrid.tsx:78:26
               <td className="awards-partner">
                 <strong>{partner}</strong> {PARTNER_NAME[partner]}
               </td>
-              {BANDS.map((b) => (
-                <td key={b}>
-                  <InputNumber
-                    value={hoursFor(partner, b)}
-                    min={0}
-                    minFractionDigits={1}
-                    maxFractionDigits={1}
-                    onValueChange={(e) => setHours(partner, b, e.value ?? 0)}
-                    inputClassName="awards-cell-input"
-                  />
-                </td>
-              ))}
+              {BANDS.map(() => undefined)}
               <td className="awards-total">{rowTotal.toFixed(1)}</td>
             </tr>

[Survived] ArrowFunction
src/components/TimeAwardsGrid.tsx:85:36
                     min={0}
                     minFractionDigits={1}
                     maxFractionDigits={1}
-                    onValueChange={(e) => setHours(partner, b, e.value ?? 0)}
+                    onValueChange={() => undefined}
                     inputClassName="awards-cell-input"
                   />

[Survived] ArithmeticOperator
src/components/TimeAwardsGrid.tsx:98:24
           <td className="awards-del">
             <CirclePlus />
           </td>
-          <td colSpan={BANDS.length + 2}>
+          <td colSpan={BANDS.length - 2}>
             <div className="awards-add">
               <Dropdown

[Killed] ArrowFunction
src/components/TimeAwardsGrid.tsx:102:48
             <div className="awards-add">
               <Dropdown
                 value={partnerToAdd}
-                options={availablePartners.map((p) => ({ label: `${p} — ${PARTNER_NAME[p]}`, value: p }))}
+                options={availablePartners.map(() => undefined)}
                 onChange={(e) => setPartnerToAdd(e.value as Partner)}
                 placeholder="Add partner"
killedBy: TimeAwardsGrid keeps a partner row visible when its only allocation is zeroed
statusReason: Cannot read properties of undefined (reading 'style')

[Survived] ArrowFunction
src/components/TimeAwardsGrid.tsx:103:27
               <Dropdown
                 value={partnerToAdd}
                 options={availablePartners.map((p) => ({ label: `${p} — ${PARTNER_NAME[p]}`, value: p }))}
-                onChange={(e) => setPartnerToAdd(e.value as Partner)}
+                onChange={() => undefined}
                 placeholder="Add partner"
                 disabled={availablePartners.length === 0}

[Survived] ConditionalExpression
src/components/TimeAwardsGrid.tsx:105:27
                 options={availablePartners.map((p) => ({ label: `${p} — ${PARTNER_NAME[p]}`, value: p }))}
                 onChange={(e) => setPartnerToAdd(e.value as Partner)}
                 placeholder="Add partner"
-                disabled={availablePartners.length === 0}
+                disabled={true}
                 tooltip="Add a time-accounting partner row to the grid (only partners not already listed appear here)."
                 tooltipOptions={{ position: 'top' }}

[Survived] ConditionalExpression
src/components/TimeAwardsGrid.tsx:105:27
                 options={availablePartners.map((p) => ({ label: `${p} — ${PARTNER_NAME[p]}`, value: p }))}
                 onChange={(e) => setPartnerToAdd(e.value as Partner)}
                 placeholder="Add partner"
-                disabled={availablePartners.length === 0}
+                disabled={false}
                 tooltip="Add a time-accounting partner row to the grid (only partners not already listed appear here)."
                 tooltipOptions={{ position: 'top' }}

[Survived] ObjectLiteral
src/components/TimeAwardsGrid.tsx:107:33
                 placeholder="Add partner"
                 disabled={availablePartners.length === 0}
                 tooltip="Add a time-accounting partner row to the grid (only partners not already listed appear here)."
-                tooltipOptions={{ position: 'top' }}
+                tooltipOptions={{}}
               />
               <Button

[Survived] ObjectLiteral
src/components/TimeAwardsGrid.tsx:115:33
                 icon={<Plus />}
                 disabled={!partnerToAdd}
                 tooltip="Add the selected partner as a new row, ready for you to enter its band hours."
-                tooltipOptions={{ position: 'top' }}
+                tooltipOptions={{}}
                 onClick={() => {
                   if (partnerToAdd) {

[NoCoverage] BlockStatement
src/components/TimeAwardsGrid.tsx:116:32
                 disabled={!partnerToAdd}
                 tooltip="Add the selected partner as a new row, ready for you to enter its band hours."
                 tooltipOptions={{ position: 'top' }}
-                onClick={() => {
-                  if (partnerToAdd) {
-                    addPartner(partnerToAdd);
-                    setPartnerToAdd(null);
-                  }
-                }}
+                onClick={() => {}}
               />
             </div>

[NoCoverage] BlockStatement
src/components/TimeAwardsGrid.tsx:117:37
                 tooltip="Add the selected partner as a new row, ready for you to enter its band hours."
                 tooltipOptions={{ position: 'top' }}
                 onClick={() => {
-                  if (partnerToAdd) {
-                    addPartner(partnerToAdd);
-                    setPartnerToAdd(null);
-                  }
+                  if (partnerToAdd) {}
                 }}
               />

[Survived] ArrowFunction
src/components/TimeAwardsGrid.tsx:133:22
           <td className="awards-partner">
             <strong>Total</strong>
           </td>
-          {BANDS.map((b) => (
-            <td key={b} className="awards-total">
-              {bandTotal(b).toFixed(1)}
-            </td>
-          ))}
+          {BANDS.map(() => undefined)}
           <td className="awards-total">{grandTotal.toFixed(1)}</td>
         </tr>
