[Survived] BooleanLiteral
src/components/atoms/auth.ts:19:16
   lucumaRefreshTokenKey,
   null,
   createJSONStorage(() => window.sessionStorage),
-  { getOnInit: true },
+  { getOnInit: false },
 );
 

[Survived] ArrowFunction
src/components/atoms/auth.ts:22:31
   { getOnInit: true },
 );
 
-export const useSetOdbToken = () => useSetAtom(odbTokenAtom);
+export const useSetOdbToken = () => undefined;
 export const useOdbTokenValue = () => useAtomValue(odbTokenAtom);
 

[Survived] ArrowFunction
src/components/atoms/auth.ts:23:33
 );
 
 export const useSetOdbToken = () => useSetAtom(odbTokenAtom);
-export const useOdbTokenValue = () => useAtomValue(odbTokenAtom);
+export const useOdbTokenValue = () => undefined;
 
 export interface OdbTokenPayload {

[Killed] ArithmeticOperator
src/components/atoms/auth.ts:49:25
 
 export const tokenExpAtom = atom((get) => {
   const exp = get(decodedTokenPayloadAtom)?.exp;
-  return exp ? new Date(exp * 1000) : null;
+  return exp ? new Date(exp / 1000) : null;
 });
 export const useTokenExp = () => useAtomValue(tokenExpAtom);
killedBy: AuthGate denies a signed-in PI, showing their actual role
statusReason: Cannot find element with locator: page.getByText('Access denied')

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/components/atoms/auth.ts:57:34
   const user = get(userAtom);
   const exp = get(tokenExpAtom);
   // There is a user and the token is not expired
-  return user !== null && (exp ? exp > new Date() : false);
+  return user !== null && (exp ? false : false);
 });
 export const useIsLoggedIn = () => useAtomValue(isLoggedInAtom);
killedBy: AuthGate denies a signed-in PI, showing their actual role
statusReason: Cannot find element with locator: page.getByText('Access denied')

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/components/atoms/auth.ts:57:34
   const user = get(userAtom);
   const exp = get(tokenExpAtom);
   // There is a user and the token is not expired
-  return user !== null && (exp ? exp > new Date() : false);
+  return user !== null && (exp ? true : false);
 });
 export const useIsLoggedIn = () => useAtomValue(isLoggedInAtom);
killedBy: AuthGate treats an expired staff token as signed out
statusReason: Cannot find element with locator: page.getByRole('button', { name: /sign in with orcid/i })

<body>
  
  


  <div>

[Killed] ArrowFunction
src/components/atoms/auth.ts:59:30
   // There is a user and the token is not expired
   return user !== null && (exp ? exp > new Date() : false);
 });
-export const useIsLoggedIn = () => useAtomValue(isLoggedInAtom);
+export const useIsLoggedIn = () => undefined;
 
 /** Staff or better — whether the Admin app renders at all (the ODB and SSO
killedBy: AuthGate denies a signed-in PI, showing their actual role
statusReason: Cannot find element with locator: page.getByText('Access denied')

<body>
  
  


  <div>

[Killed] LogicalOperator
src/components/atoms/auth.ts:63:49
 
 /** Staff or better — whether the Admin app renders at all (the ODB and SSO
  *  enforce the same bar on every admin operation server-side). */
-export const canAccessAdminAtom = atom((get) => get(isLoggedInAtom) && canAccessAdmin(get(userAtom)));
+export const canAccessAdminAtom = atom((get) => get(isLoggedInAtom) || canAccessAdmin(get(userAtom)));
 export const useCanAccessAdmin = () => useAtomValue(canAccessAdminAtom);
 
killedBy: AuthGate denies a signed-in PI, showing their actual role
statusReason: Cannot find element with locator: page.getByText('Access denied')

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/components/atoms/auth.ts:63:49
 
 /** Staff or better — whether the Admin app renders at all (the ODB and SSO
  *  enforce the same bar on every admin operation server-side). */
-export const canAccessAdminAtom = atom((get) => get(isLoggedInAtom) && canAccessAdmin(get(userAtom)));
+export const canAccessAdminAtom = atom((get) => true);
 export const useCanAccessAdmin = () => useAtomValue(canAccessAdminAtom);
 
killedBy: AuthGate denies a signed-in PI, showing their actual role
statusReason: Cannot find element with locator: page.getByText('Access denied')

<body>
  
  


  <div>

[Killed] ArrowFunction
src/components/atoms/auth.ts:64:34
 /** Staff or better — whether the Admin app renders at all (the ODB and SSO
  *  enforce the same bar on every admin operation server-side). */
 export const canAccessAdminAtom = atom((get) => get(isLoggedInAtom) && canAccessAdmin(get(userAtom)));
-export const useCanAccessAdmin = () => useAtomValue(canAccessAdminAtom);
+export const useCanAccessAdmin = () => undefined;
 
killedBy: AuthGate renders the app for staff
statusReason: Cannot find element with locator: page.getByText('ADMIN CONTENT')

<body>
  
  


  <div>
