[Survived] StringLiteral
src/components/layout/Layout.tsx:28:12
 const NAV_ITEMS: readonly NavItem[] = [
   {
     to: '/programs',
-    label: 'Programs',
+    label: "",
     tip: 'Edit administrative parameters of an awarded program: class, ToO status, contact scientists, active period, and time awards.',
   },

[Survived] StringLiteral
src/components/layout/Layout.tsx:33:12
   },
   {
     to: '/proposals',
-    label: 'Proposals',
+    label: "",
     tip: 'Review & respond to special proposals — Director\u2019s Time and Poor Weather.',
   },

[Survived] StringLiteral
src/components/layout/Layout.tsx:38:12
   },
   {
     to: '/change-requests',
-    label: 'Change Requests',
+    label: "",
     tip: 'Review & respond to configuration-change requests from PIs.',
   },

[Survived] StringLiteral
src/components/layout/Layout.tsx:44:10
   {
     to: '/users',
     label: 'Users',
-    tip: 'Assign staff & NGO roles to users (changes require the admin role).',
+    tip: "",
   },
   {

[Survived] ArrayDeclaration
src/components/layout/Layout.tsx:69:73
   const setToken = useSetAtom(odbTokenAtom);
   const role = user?.type === 'standard' ? user.role.type : (user?.type ?? 'guest');
   // Every role on the account (active + others), for the header role menu.
-  const allRoles: readonly StandardRole[] = user?.type === 'standard' ? [user.role, ...user.otherRoles] : [];
+  const allRoles: readonly StandardRole[] = user?.type === 'standard' ? [] : [];
   const roleLabel = (r: StandardRole): string =>
     r.type === 'ngo' && r.partner ? `NGO · ${r.partner.toUpperCase()}` : r.type.toUpperCase();

[NoCoverage] ConditionalExpression
src/components/layout/Layout.tsx:71:5
   // Every role on the account (active + others), for the header role menu.
   const allRoles: readonly StandardRole[] = user?.type === 'standard' ? [user.role, ...user.otherRoles] : [];
   const roleLabel = (r: StandardRole): string =>
-    r.type === 'ngo' && r.partner ? `NGO · ${r.partner.toUpperCase()}` : r.type.toUpperCase();
+    true && r.partner ? `NGO · ${r.partner.toUpperCase()}` : r.type.toUpperCase();
 
   const switchRole = async (next: StandardRole): Promise<void> => {

[NoCoverage] EqualityOperator
src/components/layout/Layout.tsx:71:5
   // Every role on the account (active + others), for the header role menu.
   const allRoles: readonly StandardRole[] = user?.type === 'standard' ? [user.role, ...user.otherRoles] : [];
   const roleLabel = (r: StandardRole): string =>
-    r.type === 'ngo' && r.partner ? `NGO · ${r.partner.toUpperCase()}` : r.type.toUpperCase();
+    r.type !== 'ngo' && r.partner ? `NGO · ${r.partner.toUpperCase()}` : r.type.toUpperCase();
 
   const switchRole = async (next: StandardRole): Promise<void> => {

[NoCoverage] BlockStatement
src/components/layout/Layout.tsx:73:67
   const roleLabel = (r: StandardRole): string =>
     r.type === 'ngo' && r.partner ? `NGO · ${r.partner.toUpperCase()}` : r.type.toUpperCase();
 
-  const switchRole = async (next: StandardRole): Promise<void> => {
-    try {
-      setToken(await sso.setRole(next.id));
-    } catch (err) {
-      toast.error('Role switch failed', err instanceof Error ? err.message : String(err));
-    }
-  };
+  const switchRole = async (next: StandardRole): Promise<void> => {};
 
   // Drop the local token first — that alone signs the app out — then end the

[NoCoverage] BlockStatement
src/components/layout/Layout.tsx:74:9
     r.type === 'ngo' && r.partner ? `NGO · ${r.partner.toUpperCase()}` : r.type.toUpperCase();
 
   const switchRole = async (next: StandardRole): Promise<void> => {
-    try {
-      setToken(await sso.setRole(next.id));
-    } catch (err) {
+    try {} catch (err) {
       toast.error('Role switch failed', err instanceof Error ? err.message : String(err));
     }

[NoCoverage] BlockStatement
src/components/layout/Layout.tsx:76:19
   const switchRole = async (next: StandardRole): Promise<void> => {
     try {
       setToken(await sso.setRole(next.id));
-    } catch (err) {
-      toast.error('Role switch failed', err instanceof Error ? err.message : String(err));
-    }
+    } catch (err) {}
   };
 

[NoCoverage] BlockStatement
src/components/layout/Layout.tsx:83:46
 
   // Drop the local token first — that alone signs the app out — then end the
   // SSO session, reporting a failure (the cookie expires on its own).
-  const signOut = async (): Promise<void> => {
-    setToken(null);
-    try {
-      await sso.logout();
-    } catch (err) {
-      toast.error('Sign-out incomplete', err instanceof Error ? err.message : String(err));
-    }
-  };
+  const signOut = async (): Promise<void> => {};
 
   return (

[NoCoverage] BlockStatement
src/components/layout/Layout.tsx:85:9
   // SSO session, reporting a failure (the cookie expires on its own).
   const signOut = async (): Promise<void> => {
     setToken(null);
-    try {
-      await sso.logout();
-    } catch (err) {
+    try {} catch (err) {
       toast.error('Sign-out incomplete', err instanceof Error ? err.message : String(err));
     }

[NoCoverage] BlockStatement
src/components/layout/Layout.tsx:87:19
     setToken(null);
     try {
       await sso.logout();
-    } catch (err) {
-      toast.error('Sign-out incomplete', err instanceof Error ? err.message : String(err));
-    }
+    } catch (err) {}
   };
 

[Killed] EqualityOperator
src/components/layout/Layout.tsx:111:14
         <div className="xp-masthead-right">
           <span className="xp-user" title="The signed-in user, decoded from the SSO JWT (identity + active role).">
             {displayName(user)}
-            {allRoles.length > 1 && user?.type === 'standard' ? (
+            {allRoles.length <= 1 && user?.type === 'standard' ? (
               <Dropdown
                 className="xp-role-select"
killedBy: Layout shows the wordmark, environment pill, and signed-in user
statusReason: strict mode violation: page.getByText('STAFF') resolved to 2 elements:
    1) <option selected value="r-1" data-pc-section="option">STAFF</option> aka getByRole('option', { name: 'STAFF' })
    2) <span tabindex="-1" data-pc-section="input" class="p-dropdown-label p-inputtext">STAFF</span> aka getByTitle('The signed-in user, decoded').locator('span')

[Killed] ConditionalExpression
src/components/layout/Layout.tsx:111:14
         <div className="xp-masthead-right">
           <span className="xp-user" title="The signed-in user, decoded from the SSO JWT (identity + active role).">
             {displayName(user)}
-            {allRoles.length > 1 && user?.type === 'standard' ? (
+            {true && user?.type === 'standard' ? (
               <Dropdown
                 className="xp-role-select"
killedBy: Layout shows the wordmark, environment pill, and signed-in user
statusReason: strict mode violation: page.getByText('STAFF') resolved to 2 elements:
    1) <option selected value="r-1" data-pc-section="option">STAFF</option> aka getByRole('option', { name: 'STAFF' })
    2) <span tabindex="-1" data-pc-section="input" class="p-dropdown-label p-inputtext">STAFF</span> aka getByTitle('The signed-in user, decoded').locator('span')

[NoCoverage] ArrowFunction
src/components/layout/Layout.tsx:115:39
               <Dropdown
                 className="xp-role-select"
                 value={user.role.id}
-                options={allRoles.map((r) => ({ label: roleLabel(r), value: r.id }))}
+                options={allRoles.map(() => undefined)}
                 onChange={(e) => {
                   const next = allRoles.find((r) => r.id === e.value);

[NoCoverage] BlockStatement
src/components/layout/Layout.tsx:116:34
                 className="xp-role-select"
                 value={user.role.id}
                 options={allRoles.map((r) => ({ label: roleLabel(r), value: r.id }))}
-                onChange={(e) => {
-                  const next = allRoles.find((r) => r.id === e.value);
-                  if (next && next.id !== user.role.id) void switchRole(next);
-                }}
+                onChange={(e) => {}}
                 tooltip="Your active SSO role — pick any of your account's roles to act as. Switching fetches a fresh token from SSO."
                 tooltipOptions={{ position: 'bottom' }}

[NoCoverage] ConditionalExpression
src/components/layout/Layout.tsx:117:53
                 value={user.role.id}
                 options={allRoles.map((r) => ({ label: roleLabel(r), value: r.id }))}
                 onChange={(e) => {
-                  const next = allRoles.find((r) => r.id === e.value);
+                  const next = allRoles.find((r) => true);
                   if (next && next.id !== user.role.id) void switchRole(next);
                 }}

[NoCoverage] ConditionalExpression
src/components/layout/Layout.tsx:117:53
                 value={user.role.id}
                 options={allRoles.map((r) => ({ label: roleLabel(r), value: r.id }))}
                 onChange={(e) => {
-                  const next = allRoles.find((r) => r.id === e.value);
+                  const next = allRoles.find((r) => false);
                   if (next && next.id !== user.role.id) void switchRole(next);
                 }}

[NoCoverage] ConditionalExpression
src/components/layout/Layout.tsx:118:31
                 options={allRoles.map((r) => ({ label: roleLabel(r), value: r.id }))}
                 onChange={(e) => {
                   const next = allRoles.find((r) => r.id === e.value);
-                  if (next && next.id !== user.role.id) void switchRole(next);
+                  if (next && true) void switchRole(next);
                 }}
                 tooltip="Your active SSO role — pick any of your account's roles to act as. Switching fetches a fresh token from SSO."

[NoCoverage] EqualityOperator
src/components/layout/Layout.tsx:118:31
                 options={allRoles.map((r) => ({ label: roleLabel(r), value: r.id }))}
                 onChange={(e) => {
                   const next = allRoles.find((r) => r.id === e.value);
-                  if (next && next.id !== user.role.id) void switchRole(next);
+                  if (next && next.id === user.role.id) void switchRole(next);
                 }}
                 tooltip="Your active SSO role — pick any of your account's roles to act as. Switching fetches a fresh token from SSO."

[Survived] MethodExpression
src/components/layout/Layout.tsx:128:18
                 className="xp-role"
                 title="Your current SSO role. The Admin app requires staff or admin; lower roles are gated out."
               >
-                {role.toUpperCase()}
+                {role.toLowerCase()}
               </span>
             )}

[Survived] ConditionalExpression
src/components/layout/Layout.tsx:132:12
               </span>
             )}
           </span>
-          {isLoggedIn && (
-            <button
-              type="button"
-              className="xp-icon-btn"
-              title="Sign out — clears your token and ends the SSO session"
-              onClick={() => void signOut()}
-            >
-              <SignOut />
-            </button>
-          )}
+          {false}
         </div>
       </header>

[Survived] LogicalOperator
src/components/layout/Layout.tsx:132:12
               </span>
             )}
           </span>
-          {isLoggedIn && (
-            <button
-              type="button"
-              className="xp-icon-btn"
-              title="Sign out — clears your token and ends the SSO session"
-              onClick={() => void signOut()}
-            >
-              <SignOut />
-            </button>
-          )}
+          {isLoggedIn || <button type="button" className="xp-icon-btn" title="Sign out — clears your token and ends the SSO session" onClick={() => void signOut()}>
+              <SignOut />
+            </button>}
         </div>
       </header>

[Survived] ArrowFunction
src/components/layout/Layout.tsx:137:24
               type="button"
               className="xp-icon-btn"
               title="Sign out — clears your token and ends the SSO session"
-              onClick={() => void signOut()}
+              onClick={() => undefined}
             >
               <SignOut />

[Survived] ArrowFunction
src/components/layout/Layout.tsx:147:26
 
       <div className="xp-body">
         <nav className="xp-rail">
-          {NAV_ITEMS.map((item) => (
-            <NavLink
-              key={item.to}
-              to={item.to}
-              title={item.tip}
-              className={({ isActive }) => cn('xp-rail-tab', isActive && 'is-active')}
-            >
-              <span>{item.label}</span>
-            </NavLink>
-          ))}
+          {NAV_ITEMS.map(() => undefined)}
         </nav>
 

[Survived] ConditionalExpression
src/components/layout/Layout.tsx:152:62
               key={item.to}
               to={item.to}
               title={item.tip}
-              className={({ isActive }) => cn('xp-rail-tab', isActive && 'is-active')}
+              className={({ isActive }) => cn('xp-rail-tab', false)}
             >
               <span>{item.label}</span>

[Survived] ArrowFunction
src/components/layout/Layout.tsx:152:26
               key={item.to}
               to={item.to}
               title={item.tip}
-              className={({ isActive }) => cn('xp-rail-tab', isActive && 'is-active')}
+              className={() => undefined}
             >
               <span>{item.label}</span>
