[Survived] ArrowFunction
src/components/toast.tsx:13:16
 
   const api = useMemo<ToastApi>(
     () => ({
-      success: (summary, detail) => ref.current?.show({ severity: 'success', summary, detail, life: 3000 }),
+      success: () => undefined,
       info: (summary, detail) => ref.current?.show({ severity: 'info', summary, detail, life: 3000 }),
       error: (summary, detail) => ref.current?.show({ severity: 'error', summary, detail, life: 5000 }),

[NoCoverage] ObjectLiteral
src/components/toast.tsx:13:55
 
   const api = useMemo<ToastApi>(
     () => ({
-      success: (summary, detail) => ref.current?.show({ severity: 'success', summary, detail, life: 3000 }),
+      success: (summary, detail) => ref.current?.show({}),
       info: (summary, detail) => ref.current?.show({ severity: 'info', summary, detail, life: 3000 }),
       error: (summary, detail) => ref.current?.show({ severity: 'error', summary, detail, life: 5000 }),

[Timeout] ArrowFunction
src/components/toast.tsx:14:13
   const api = useMemo<ToastApi>(
     () => ({
       success: (summary, detail) => ref.current?.show({ severity: 'success', summary, detail, life: 3000 }),
-      info: (summary, detail) => ref.current?.show({ severity: 'info', summary, detail, life: 3000 }),
+      info: () => undefined,
       error: (summary, detail) => ref.current?.show({ severity: 'error', summary, detail, life: 5000 }),
     }),

[Survived] ArrowFunction
src/components/toast.tsx:15:14
     () => ({
       success: (summary, detail) => ref.current?.show({ severity: 'success', summary, detail, life: 3000 }),
       info: (summary, detail) => ref.current?.show({ severity: 'info', summary, detail, life: 3000 }),
-      error: (summary, detail) => ref.current?.show({ severity: 'error', summary, detail, life: 5000 }),
+      error: () => undefined,
     }),
     [],

[Survived] ArrayDeclaration
src/components/toast.tsx:17:5
       info: (summary, detail) => ref.current?.show({ severity: 'info', summary, detail, life: 3000 }),
       error: (summary, detail) => ref.current?.show({ severity: 'error', summary, detail, life: 5000 }),
     }),
-    [],
+    ["Stryker was here"],
   );
 
