[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:61:18
   const cfps = useMemo(() => (data ? mapCfps(data) : EMPTY_CFPS), [data]);
   const [updateCfp, { loading: updating }] = useUpdateCfp();
   const [createCfp, { loading: creating }] = useCreateCfp();
-  const saving = updating || creating;
+  const saving = false;
 
   const [typeFilter, setTypeFilter] = useState<CfpType | 'all'>('all');

[NoCoverage] LogicalOperator
src/features/cfp/CfpPage.tsx:61:18
   const cfps = useMemo(() => (data ? mapCfps(data) : EMPTY_CFPS), [data]);
   const [updateCfp, { loading: updating }] = useUpdateCfp();
   const [createCfp, { loading: creating }] = useCreateCfp();
-  const saving = updating || creating;
+  const saving = updating && creating;
 
   const [typeFilter, setTypeFilter] = useState<CfpType | 'all'>('all');

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:66:5
   const [typeFilter, setTypeFilter] = useState<CfpType | 'all'>('all');
   const [openFilter, setOpenFilter] = useState<OpenFilter>('all');
   const visibleCfps = useMemo(
-    () =>
-      cfps.filter(
-        (c) =>
-          (typeFilter === 'all' || c.type === typeFilter) &&
-          (openFilter === 'all' || c.active === (openFilter === 'open')),
-      ),
+    () => undefined,
     [cfps, typeFilter, openFilter],
   );

[NoCoverage] MethodExpression
src/features/cfp/CfpPage.tsx:67:7
   const [openFilter, setOpenFilter] = useState<OpenFilter>('all');
   const visibleCfps = useMemo(
     () =>
-      cfps.filter(
-        (c) =>
-          (typeFilter === 'all' || c.type === typeFilter) &&
-          (openFilter === 'all' || c.active === (openFilter === 'open')),
-      ),
+      cfps,
     [cfps, typeFilter, openFilter],
   );

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:68:9
   const visibleCfps = useMemo(
     () =>
       cfps.filter(
-        (c) =>
-          (typeFilter === 'all' || c.type === typeFilter) &&
-          (openFilter === 'all' || c.active === (openFilter === 'open')),
+        () => undefined,
       ),
     [cfps, typeFilter, openFilter],

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:69:11
     () =>
       cfps.filter(
         (c) =>
-          (typeFilter === 'all' || c.type === typeFilter) &&
-          (openFilter === 'all' || c.active === (openFilter === 'open')),
+          false,
       ),
     [cfps, typeFilter, openFilter],

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:69:11
     () =>
       cfps.filter(
         (c) =>
-          (typeFilter === 'all' || c.type === typeFilter) &&
-          (openFilter === 'all' || c.active === (openFilter === 'open')),
+          true,
       ),
     [cfps, typeFilter, openFilter],

[NoCoverage] EqualityOperator
src/features/cfp/CfpPage.tsx:70:36
       cfps.filter(
         (c) =>
           (typeFilter === 'all' || c.type === typeFilter) &&
-          (openFilter === 'all' || c.active === (openFilter === 'open')),
+          (openFilter === 'all' || c.active !== (openFilter === 'open')),
       ),
     [cfps, typeFilter, openFilter],

[NoCoverage] EqualityOperator
src/features/cfp/CfpPage.tsx:70:50
       cfps.filter(
         (c) =>
           (typeFilter === 'all' || c.type === typeFilter) &&
-          (openFilter === 'all' || c.active === (openFilter === 'open')),
+          (openFilter === 'all' || c.active === (openFilter !== 'open')),
       ),
     [cfps, typeFilter, openFilter],

[NoCoverage] ArrayDeclaration
src/features/cfp/CfpPage.tsx:72:5
           (typeFilter === 'all' || c.type === typeFilter) &&
           (openFilter === 'all' || c.active === (openFilter === 'open')),
       ),
-    [cfps, typeFilter, openFilter],
+    [],
   );
 

[NoCoverage] LogicalOperator
src/features/cfp/CfpPage.tsx:76:20
   );
 
   const [selectedId, setSelectedId] = useState<string | null>(null);
-  const activeId = selectedId ?? cfps[0]?.id ?? '';
+  const activeId = (selectedId ?? cfps[0]?.id) && '';
   const original = useMemo(() => cfps.find((c) => c.id === activeId) ?? cfps[0], [cfps, activeId]);
 

[NoCoverage] StringLiteral
src/features/cfp/CfpPage.tsx:76:49
   );
 
   const [selectedId, setSelectedId] = useState<string | null>(null);
-  const activeId = selectedId ?? cfps[0]?.id ?? '';
+  const activeId = selectedId ?? cfps[0]?.id ?? "Stryker was here!";
   const original = useMemo(() => cfps.find((c) => c.id === activeId) ?? cfps[0], [cfps, activeId]);
 

[NoCoverage] EqualityOperator
src/features/cfp/CfpPage.tsx:77:51
 
   const [selectedId, setSelectedId] = useState<string | null>(null);
   const activeId = selectedId ?? cfps[0]?.id ?? '';
-  const original = useMemo(() => cfps.find((c) => c.id === activeId) ?? cfps[0], [cfps, activeId]);
+  const original = useMemo(() => cfps.find((c) => c.id !== activeId) ?? cfps[0], [cfps, activeId]);
 
   async function save(draft: CallForProposals): Promise<void> {

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:77:51
 
   const [selectedId, setSelectedId] = useState<string | null>(null);
   const activeId = selectedId ?? cfps[0]?.id ?? '';
-  const original = useMemo(() => cfps.find((c) => c.id === activeId) ?? cfps[0], [cfps, activeId]);
+  const original = useMemo(() => cfps.find((c) => false) ?? cfps[0], [cfps, activeId]);
 
   async function save(draft: CallForProposals): Promise<void> {

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:79:63
   const activeId = selectedId ?? cfps[0]?.id ?? '';
   const original = useMemo(() => cfps.find((c) => c.id === activeId) ?? cfps[0], [cfps, activeId]);
 
-  async function save(draft: CallForProposals): Promise<void> {
-    try {
-      await updateCfp({ variables: { id: draft.id, SET: cfpPropertiesInput(draft) } });
-      toast.success('Call saved', draft.title || draft.id);
-    } catch (err) {
-      toast.error('Save failed', friendlyError(err));
-    }
-  }
+  async function save(draft: CallForProposals): Promise<void> {}
 
   /** Create a call and select it. `SET` is a fresh minimal call for New, or the

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:80:9
   const original = useMemo(() => cfps.find((c) => c.id === activeId) ?? cfps[0], [cfps, activeId]);
 
   async function save(draft: CallForProposals): Promise<void> {
-    try {
-      await updateCfp({ variables: { id: draft.id, SET: cfpPropertiesInput(draft) } });
-      toast.success('Call saved', draft.title || draft.id);
-    } catch (err) {
+    try {} catch (err) {
       toast.error('Save failed', friendlyError(err));
     }

[NoCoverage] LogicalOperator
src/features/cfp/CfpPage.tsx:82:35
   async function save(draft: CallForProposals): Promise<void> {
     try {
       await updateCfp({ variables: { id: draft.id, SET: cfpPropertiesInput(draft) } });
-      toast.success('Call saved', draft.title || draft.id);
+      toast.success('Call saved', draft.title && draft.id);
     } catch (err) {
       toast.error('Save failed', friendlyError(err));

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:83:19
     try {
       await updateCfp({ variables: { id: draft.id, SET: cfpPropertiesInput(draft) } });
       toast.success('Call saved', draft.title || draft.id);
-    } catch (err) {
-      toast.error('Save failed', friendlyError(err));
-    }
+    } catch (err) {}
   }
 

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:90:92
 
   /** Create a call and select it. `SET` is a fresh minimal call for New, or the
    *  selected call's full properties for Copy. */
-  async function create(SET: CallForProposalsPropertiesInput, verb: string): Promise<void> {
-    try {
-      const res = await createCfp({ variables: { SET } });
-      const newId = res.data?.createCallForProposals.callForProposals?.id;
-      if (newId) setSelectedId(newId);
-      toast.success(`Call ${verb}`, newId ?? '');
-    } catch (err) {
-      toast.error(`${verb === 'created' ? 'Create' : 'Copy'} failed`, friendlyError(err));
-    }
-  }
+  async function create(SET: CallForProposalsPropertiesInput, verb: string): Promise<void> {}
 
   return (

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:91:9
   /** Create a call and select it. `SET` is a fresh minimal call for New, or the
    *  selected call's full properties for Copy. */
   async function create(SET: CallForProposalsPropertiesInput, verb: string): Promise<void> {
-    try {
-      const res = await createCfp({ variables: { SET } });
-      const newId = res.data?.createCallForProposals.callForProposals?.id;
-      if (newId) setSelectedId(newId);
-      toast.success(`Call ${verb}`, newId ?? '');
-    } catch (err) {
+    try {} catch (err) {
       toast.error(`${verb === 'created' ? 'Create' : 'Copy'} failed`, friendlyError(err));
     }

[NoCoverage] OptionalChaining
src/features/cfp/CfpPage.tsx:93:21
   async function create(SET: CallForProposalsPropertiesInput, verb: string): Promise<void> {
     try {
       const res = await createCfp({ variables: { SET } });
-      const newId = res.data?.createCallForProposals.callForProposals?.id;
+      const newId = res.data?.createCallForProposals.callForProposals.id;
       if (newId) setSelectedId(newId);
       toast.success(`Call ${verb}`, newId ?? '');

[NoCoverage] LogicalOperator
src/features/cfp/CfpPage.tsx:95:37
       const res = await createCfp({ variables: { SET } });
       const newId = res.data?.createCallForProposals.callForProposals?.id;
       if (newId) setSelectedId(newId);
-      toast.success(`Call ${verb}`, newId ?? '');
+      toast.success(`Call ${verb}`, newId && '');
     } catch (err) {
       toast.error(`${verb === 'created' ? 'Create' : 'Copy'} failed`, friendlyError(err));

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:96:19
       const newId = res.data?.createCallForProposals.callForProposals?.id;
       if (newId) setSelectedId(newId);
       toast.success(`Call ${verb}`, newId ?? '');
-    } catch (err) {
-      toast.error(`${verb === 'created' ? 'Create' : 'Copy'} failed`, friendlyError(err));
-    }
+    } catch (err) {}
   }
 

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:97:22
       if (newId) setSelectedId(newId);
       toast.success(`Call ${verb}`, newId ?? '');
     } catch (err) {
-      toast.error(`${verb === 'created' ? 'Create' : 'Copy'} failed`, friendlyError(err));
+      toast.error(`${false ? 'Create' : 'Copy'} failed`, friendlyError(err));
     }
   }

[NoCoverage] EqualityOperator
src/features/cfp/CfpPage.tsx:97:22
       if (newId) setSelectedId(newId);
       toast.success(`Call ${verb}`, newId ?? '');
     } catch (err) {
-      toast.error(`${verb === 'created' ? 'Create' : 'Copy'} failed`, friendlyError(err));
+      toast.error(`${verb !== 'created' ? 'Create' : 'Copy'} failed`, friendlyError(err));
     }
   }

[NoCoverage] EqualityOperator
src/features/cfp/CfpPage.tsx:108:93
         flush
         controls={
           <>
-            <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={cfps.length === 0} />
+            <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={cfps.length !== 0} />
             <Dropdown
               value={openFilter}

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:108:93
         flush
         controls={
           <>
-            <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={cfps.length === 0} />
+            <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={false} />
             <Dropdown
               value={openFilter}

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:112:25
             <Dropdown
               value={openFilter}
               options={[...OPEN_FILTER_OPTIONS]}
-              onChange={(e) => setOpenFilter(e.value as OpenFilter)}
+              onChange={() => undefined}
               tooltip="Show only open calls, only closed calls, or all."
               tooltipOptions={{ position: 'bottom' }}

[NoCoverage] ObjectLiteral
src/features/cfp/CfpPage.tsx:120:17
             <Dropdown
               value={typeFilter}
               options={[
-                { label: 'All types', value: 'all' },
+                {},
                 ...CFP_TYPES.map((t) => ({ label: CFP_TYPE_LABEL[t], value: t })),
               ]}

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:121:34
               value={typeFilter}
               options={[
                 { label: 'All types', value: 'all' },
-                ...CFP_TYPES.map((t) => ({ label: CFP_TYPE_LABEL[t], value: t })),
+                ...CFP_TYPES.map(() => undefined),
               ]}
               onChange={(e) => setTypeFilter(e.value as CfpType | 'all')}

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:123:25
                 { label: 'All types', value: 'all' },
                 ...CFP_TYPES.map((t) => ({ label: CFP_TYPE_LABEL[t], value: t })),
               ]}
-              onChange={(e) => setTypeFilter(e.value as CfpType | 'all')}
+              onChange={() => undefined}
               tooltip="Show only calls of one type, or all."
               tooltipOptions={{ position: 'bottom' }}

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:132:25
               text
               label="Copy"
               icon={<Copy />}
-              disabled={!original || saving}
+              disabled={true}
               tooltip="Duplicate the selected call as a starting point for a new one (everything but the id is copied)."
               tooltipOptions={{ position: 'bottom' }}

[NoCoverage] LogicalOperator
src/features/cfp/CfpPage.tsx:132:25
               text
               label="Copy"
               icon={<Copy />}
-              disabled={!original || saving}
+              disabled={!original && saving}
               tooltip="Duplicate the selected call as a starting point for a new one (everything but the id is copied)."
               tooltipOptions={{ position: 'bottom' }}

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:135:30
               disabled={!original || saving}
               tooltip="Duplicate the selected call as a starting point for a new one (everything but the id is copied)."
               tooltipOptions={{ position: 'bottom' }}
-              onClick={() => {
-                if (!original) return;
-                void create({ ...cfpPropertiesInput(original), title: `${original.title} (copy)` }, 'copied');
-              }}
+              onClick={() => {}}
             />
             <Button

[NoCoverage] StringLiteral
src/features/cfp/CfpPage.tsx:137:71
               tooltipOptions={{ position: 'bottom' }}
               onClick={() => {
                 if (!original) return;
-                void create({ ...cfpPropertiesInput(original), title: `${original.title} (copy)` }, 'copied');
+                void create({ ...cfpPropertiesInput(original), title: `` }, 'copied');
               }}
             />

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:147:24
               disabled={saving}
               tooltip="Create a brand-new Call for Proposals from scratch (ODB createCallForProposals)."
               tooltipOptions={{ position: 'bottom' }}
-              onClick={() =>
-                void create(
-                  {
-                    semester: currentSemester(),
-                    ...semesterDates(currentSemester()),
-                    gemini: { type: 'REGULAR_SEMESTER' },
-                  },
-                  'created',
-                )
+              onClick={() => undefined
               }
             />

[NoCoverage] StringLiteral
src/features/cfp/CfpPage.tsx:154:19
                     ...semesterDates(currentSemester()),
                     gemini: { type: 'REGULAR_SEMESTER' },
                   },
-                  'created',
+                  "",
                 )
               }

[NoCoverage] LogicalOperator
src/features/cfp/CfpPage.tsx:165:22
           value={visibleCfps}
           dataKey="id"
           selectionMode="single"
-          selection={original ?? undefined}
+          selection={original && undefined}
           onSelectionChange={(e) => setSelectedId((e.value as CallForProposals | null)?.id ?? null)}
           className="cfp-calls-table"

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:166:30
           dataKey="id"
           selectionMode="single"
           selection={original ?? undefined}
-          onSelectionChange={(e) => setSelectedId((e.value as CallForProposals | null)?.id ?? null)}
+          onSelectionChange={() => undefined}
           className="cfp-calls-table"
           emptyMessage={

[NoCoverage] EqualityOperator
src/features/cfp/CfpPage.tsx:173:19
               ? 'Loading…'
               : error
                 ? friendlyError(error)
-                : cfps.length > 0
+                : cfps.length <= 0
                   ? 'No calls match the filters.'
                   : 'No calls visible to your role.'

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:173:19
               ? 'Loading…'
               : error
                 ? friendlyError(error)
-                : cfps.length > 0
+                : false
                   ? 'No calls match the filters.'
                   : 'No calls visible to your role.'

[NoCoverage] StringLiteral
src/features/cfp/CfpPage.tsx:175:21
                 ? friendlyError(error)
                 : cfps.length > 0
                   ? 'No calls match the filters.'
-                  : 'No calls visible to your role.'
+                  : ""
           }
         >

[NoCoverage] StringLiteral
src/features/cfp/CfpPage.tsx:181:29
           <Column
             header="Open"
             headerTooltip="Whether the call is currently open (green ✓) or closed (red ✗) — today's date compared against the latest submission deadline across all participating partners."
-            style={{ width: '4rem' }}
+            style={{ width: "" }}
             body={(c: CallForProposals) =>
               c.active ? (

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:182:19
             header="Open"
             headerTooltip="Whether the call is currently open (green ✓) or closed (red ✗) — today's date compared against the latest submission deadline across all participating partners."
             style={{ width: '4rem' }}
-            body={(c: CallForProposals) =>
-              c.active ? (
-                <span title="Open — today is on or before the latest partner submission deadline.">
-                  <CircleCheck className="cfp-open-yes" />
-                </span>
-              ) : (
-                <span title="Closed — every partner's submission deadline has passed.">
-                  <CircleXMark className="cfp-open-no" />
-                </span>
-              )
+            body={() => undefined
             }
           />

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:205:19
             header="Type"
             sortable
             headerTooltip="Call type — Regular Semester, Fast Turnaround, Large Program, Director's Time, or Poor Weather."
-            body={(c: CallForProposals) => CFP_TYPE_LABEL[c.type]}
+            body={() => undefined}
           />
           <Column

[NoCoverage] ObjectLiteral
src/features/cfp/CfpPage.tsx:219:20
             header="Start"
             sortable
             headerTooltip="First day the call accepts submissions."
-            style={{ width: '9rem' }}
+            style={{}}
           />
           <Column

[NoCoverage] ObjectLiteral
src/features/cfp/CfpPage.tsx:226:20
             header="End"
             sortable
             headerTooltip="Last day the call accepts submissions."
-            style={{ width: '9rem' }}
+            style={{}}
           />
           <Column

[NoCoverage] StringLiteral
src/features/cfp/CfpPage.tsx:226:29
             header="End"
             sortable
             headerTooltip="Last day the call accepts submissions."
-            style={{ width: '9rem' }}
+            style={{ width: "" }}
           />
           <Column

[NoCoverage] ObjectLiteral
src/features/cfp/CfpPage.tsx:232:20
             field="id"
             header="Id"
             headerTooltip="The call's ODB identifier (read-only)."
-            style={{ width: '6rem' }}
+            style={{}}
           />
         </DataTable>

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:237:8
         </DataTable>
       </Tile>
 
-      {original && <CfpEditor key={original.id} original={original} saving={saving} onSave={save} />}
+      {true}
     </>
   );

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:237:8
         </DataTable>
       </Tile>
 
-      {original && <CfpEditor key={original.id} original={original} saving={saving} onSave={save} />}
+      {false}
     </>
   );

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:254:17
   readonly onSave: (draft: CallForProposals) => Promise<void>;
 }): JSX.Element {
   const [draft, setDraft] = useState<CallForProposals>(original);
-  const dirty = JSON.stringify(draft) !== JSON.stringify(original);
+  const dirty = true;
 
   function set<K extends keyof CallForProposals>(key: K, value: CallForProposals[K]): void {

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:254:17
   readonly onSave: (draft: CallForProposals) => Promise<void>;
 }): JSX.Element {
   const [draft, setDraft] = useState<CallForProposals>(original);
-  const dirty = JSON.stringify(draft) !== JSON.stringify(original);
+  const dirty = false;
 
   function set<K extends keyof CallForProposals>(key: K, value: CallForProposals[K]): void {

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:256:92
   const [draft, setDraft] = useState<CallForProposals>(original);
   const dirty = JSON.stringify(draft) !== JSON.stringify(original);
 
-  function set<K extends keyof CallForProposals>(key: K, value: CallForProposals[K]): void {
-    setDraft((d) => ({ ...d, [key]: value }));
-  }
+  function set<K extends keyof CallForProposals>(key: K, value: CallForProposals[K]): void {}
   function setLimit(site: 'north' | 'south', key: keyof SiteCoordinateLimits, value: number): void {
     setDraft((d) => ({ ...d, [site]: { ...d[site], [key]: value } }));

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:259:100
   function set<K extends keyof CallForProposals>(key: K, value: CallForProposals[K]): void {
     setDraft((d) => ({ ...d, [key]: value }));
   }
-  function setLimit(site: 'north' | 'south', key: keyof SiteCoordinateLimits, value: number): void {
-    setDraft((d) => ({ ...d, [site]: { ...d[site], [key]: value } }));
-  }
+  function setLimit(site: 'north' | 'south', key: keyof SiteCoordinateLimits, value: number): void {}
   function toggleInstrument(name: string): void {
     setDraft((d) => ({

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:262:49
   function setLimit(site: 'north' | 'south', key: keyof SiteCoordinateLimits, value: number): void {
     setDraft((d) => ({ ...d, [site]: { ...d[site], [key]: value } }));
   }
-  function toggleInstrument(name: string): void {
-    setDraft((d) => ({
-      ...d,
-      instruments: d.instruments.includes(name) ? d.instruments.filter((i) => i !== name) : [...d.instruments, name],
-    }));
-  }
+  function toggleInstrument(name: string): void {}
   function partnerEnabled(p: Partner): boolean {
     return draft.partners.some((x) => x.partner === p);

[NoCoverage] EqualityOperator
src/features/cfp/CfpPage.tsx:265:79
   function toggleInstrument(name: string): void {
     setDraft((d) => ({
       ...d,
-      instruments: d.instruments.includes(name) ? d.instruments.filter((i) => i !== name) : [...d.instruments, name],
+      instruments: d.instruments.includes(name) ? d.instruments.filter((i) => i === name) : [...d.instruments, name],
     }));
   }

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:265:79
   function toggleInstrument(name: string): void {
     setDraft((d) => ({
       ...d,
-      instruments: d.instruments.includes(name) ? d.instruments.filter((i) => i !== name) : [...d.instruments, name],
+      instruments: d.instruments.includes(name) ? d.instruments.filter((i) => true) : [...d.instruments, name],
     }));
   }

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:269:39
     }));
   }
   function partnerEnabled(p: Partner): boolean {
-    return draft.partners.some((x) => x.partner === p);
+    return draft.partners.some((x) => true);
   }
   function togglePartner(p: Partner): void {

[NoCoverage] MethodExpression
src/features/cfp/CfpPage.tsx:269:12
     }));
   }
   function partnerEnabled(p: Partner): boolean {
-    return draft.partners.some((x) => x.partner === p);
+    return draft.partners.every(x => x.partner === p);
   }
   function togglePartner(p: Partner): void {

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:271:44
   function partnerEnabled(p: Partner): boolean {
     return draft.partners.some((x) => x.partner === p);
   }
-  function togglePartner(p: Partner): void {
-    setDraft((d) => ({
-      ...d,
-      partners: partnerEnabled(p) ? d.partners.filter((x) => x.partner !== p) : [...d.partners, { partner: p }],
-    }));
-  }
+  function togglePartner(p: Partner): void {}
   function setPartnerDeadline(p: Partner, value: string): void {
     setDraft((d) => ({

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:274:62
   function togglePartner(p: Partner): void {
     setDraft((d) => ({
       ...d,
-      partners: partnerEnabled(p) ? d.partners.filter((x) => x.partner !== p) : [...d.partners, { partner: p }],
+      partners: partnerEnabled(p) ? d.partners.filter((x) => true) : [...d.partners, { partner: p }],
     }));
   }

[NoCoverage] MethodExpression
src/features/cfp/CfpPage.tsx:274:37
   function togglePartner(p: Partner): void {
     setDraft((d) => ({
       ...d,
-      partners: partnerEnabled(p) ? d.partners.filter((x) => x.partner !== p) : [...d.partners, { partner: p }],
+      partners: partnerEnabled(p) ? d.partners : [...d.partners, { partner: p }],
     }));
   }

[NoCoverage] BlockStatement
src/features/cfp/CfpPage.tsx:277:64
       partners: partnerEnabled(p) ? d.partners.filter((x) => x.partner !== p) : [...d.partners, { partner: p }],
     }));
   }
-  function setPartnerDeadline(p: Partner, value: string): void {
-    setDraft((d) => ({
-      ...d,
-      partners: d.partners.map((x) => (x.partner === p ? { ...x, deadlineOverride: value } : x)),
-    }));
-  }
+  function setPartnerDeadline(p: Partner, value: string): void {}
 
   return (

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:280:40
   function setPartnerDeadline(p: Partner, value: string): void {
     setDraft((d) => ({
       ...d,
-      partners: d.partners.map((x) => (x.partner === p ? { ...x, deadlineOverride: value } : x)),
+      partners: d.partners.map((x) => (false ? { ...x, deadlineOverride: value } : x)),
     }));
   }

[NoCoverage] EqualityOperator
src/features/cfp/CfpPage.tsx:280:40
   function setPartnerDeadline(p: Partner, value: string): void {
     setDraft((d) => ({
       ...d,
-      partners: d.partners.map((x) => (x.partner === p ? { ...x, deadlineOverride: value } : x)),
+      partners: d.partners.map((x) => (x.partner !== p ? { ...x, deadlineOverride: value } : x)),
     }));
   }

[NoCoverage] StringLiteral
src/features/cfp/CfpPage.tsx:285:18
   }
 
   return (
-    <Tile title={`Selected Call · ${draft.id}`}>
+    <Tile title={``}>
       <div className="cfp-editor">
         {/* Left column — parameters + coordinate limits */}

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:296:69
             <label htmlFor="cfp-title" title="The call's display title (e.g. “2027B Regular Semester”).">
               Title
             </label>
-            <InputText id="cfp-title" value={draft.title} onChange={(e) => set('title', e.target.value)} />
+            <InputText id="cfp-title" value={draft.title} onChange={() => undefined} />
 
             <label

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:307:38
             <Dropdown
               inputId="cfp-type"
               value={draft.type}
-              options={CFP_TYPES.map((t) => ({ label: CFP_TYPE_LABEL[t], value: t }))}
+              options={CFP_TYPES.map(() => undefined)}
               onChange={(e) => set('type', e.value as CfpType)}
             />

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:308:25
               inputId="cfp-type"
               value={draft.type}
               options={CFP_TYPES.map((t) => ({ label: CFP_TYPE_LABEL[t], value: t }))}
-              onChange={(e) => set('type', e.value as CfpType)}
+              onChange={() => undefined}
             />
 

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:314:70
             <label htmlFor="cfp-sem" title="The semester this call is for (e.g. 2027B).">
               Semester
             </label>
-            <InputText id="cfp-sem" value={draft.semester} onChange={(e) => set('semester', e.target.value)} />
+            <InputText id="cfp-sem" value={draft.semester} onChange={() => undefined} />
 
             <label htmlFor="cfp-start" title="First day the call accepts submissions.">

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:323:25
               id="cfp-start"
               value={draft.activeStart}
               placeholder="YYYY-MM-DD"
-              onChange={(e) => set('activeStart', e.target.value)}
+              onChange={() => undefined}
             />
 
