[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:333:25
               id="cfp-end"
               value={draft.activeEnd}
               placeholder="YYYY-MM-DD"
-              onChange={(e) => set('activeEnd', e.target.value)}
+              onChange={() => undefined}
             />
 

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:353:32
                 value={draft.proprietaryMonths}
                 min={0}
                 max={36}
-                onValueChange={(e) => set('proprietaryMonths', e.value ?? 0)}
+                onValueChange={() => undefined}
               />
               <span className="cfp-suffix">months</span>

[NoCoverage] EqualityOperator
src/features/cfp/CfpPage.tsx:368:78
                 <tr key={site}>
                   <td
                     className="cfp-site"
-                    title={`RA (hours) and Dec (degrees) limits for Gemini ${site === 'north' ? 'North (Maunakea)' : 'South (Cerro Pachón)'}.`}
+                    title={`RA (hours) and Dec (degrees) limits for Gemini ${site !== 'north' ? 'North (Maunakea)' : 'South (Cerro Pachón)'}.`}
                   >
                     Gemini {site === 'north' ? 'North' : 'South'}

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:368:78
                 <tr key={site}>
                   <td
                     className="cfp-site"
-                    title={`RA (hours) and Dec (degrees) limits for Gemini ${site === 'north' ? 'North (Maunakea)' : 'South (Cerro Pachón)'}.`}
+                    title={`RA (hours) and Dec (degrees) limits for Gemini ${true ? 'North (Maunakea)' : 'South (Cerro Pachón)'}.`}
                   >
                     Gemini {site === 'north' ? 'North' : 'South'}

[NoCoverage] EqualityOperator
src/features/cfp/CfpPage.tsx:370:29
                     className="cfp-site"
                     title={`RA (hours) and Dec (degrees) limits for Gemini ${site === 'north' ? 'North (Maunakea)' : 'South (Cerro Pachón)'}.`}
                   >
-                    Gemini {site === 'north' ? 'North' : 'South'}
+                    Gemini {site !== 'north' ? 'North' : 'South'}
                   </td>
                   <td>

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:370:29
                     className="cfp-site"
                     title={`RA (hours) and Dec (degrees) limits for Gemini ${site === 'north' ? 'North (Maunakea)' : 'South (Cerro Pachón)'}.`}
                   >
-                    Gemini {site === 'north' ? 'North' : 'South'}
+                    Gemini {true ? 'North' : 'South'}
                   </td>
                   <td>

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:377:38
                       value={draft[site].raStart}
                       suffix=" h"
                       maxFractionDigits={1}
-                      onValueChange={(e) => setLimit(site, 'raStart', e.value ?? 0)}
+                      onValueChange={() => undefined}
                       inputClassName="cfp-coord-input"
                     />

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:387:38
                       value={draft[site].raEnd}
                       suffix=" h"
                       maxFractionDigits={1}
-                      onValueChange={(e) => setLimit(site, 'raEnd', e.value ?? 0)}
+                      onValueChange={() => undefined}
                       inputClassName="cfp-coord-input"
                     />

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:395:38
                     <InputNumber
                       value={draft[site].decStart}
                       suffix="°"
-                      onValueChange={(e) => setLimit(site, 'decStart', e.value ?? 0)}
+                      onValueChange={() => undefined}
                       inputClassName="cfp-coord-input"
                     />

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:404:38
                     <InputNumber
                       value={draft[site].decEnd}
                       suffix="°"
-                      onValueChange={(e) => setLimit(site, 'decEnd', e.value ?? 0)}
+                      onValueChange={() => undefined}
                       inputClassName="cfp-coord-input"
                     />

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:432:25
             <InputText
               value={draft.defaultDeadline}
               placeholder="YYYY-MM-DD HH:MM:SS"
-              onChange={(e) => set('defaultDeadline', e.target.value)}
+              onChange={() => undefined}
             />
           </div>

[NoCoverage] ConditionalExpression
src/features/cfp/CfpPage.tsx:446:56
             </thead>
             <tbody>
               {PARTNERS.map((p) => {
-                const row = draft.partners.find((x) => x.partner === p);
+                const row = draft.partners.find((x) => true);
                 return (
                   <tr key={p}>

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:446:49
             </thead>
             <tbody>
               {PARTNERS.map((p) => {
-                const row = draft.partners.find((x) => x.partner === p);
+                const row = draft.partners.find(() => undefined);
                 return (
                   <tr key={p}>

[NoCoverage] StringLiteral
src/features/cfp/CfpPage.tsx:449:61
                 const row = draft.partners.find((x) => x.partner === p);
                 return (
                   <tr key={p}>
-                    <td className="cfp-partner-cell" title={`Include ${PARTNER_NAME[p]} (${p}) in this call.`}>
+                    <td className="cfp-partner-cell" title={``}>
                       <Checkbox checked={partnerEnabled(p)} onChange={() => togglePartner(p)} />
                       <span>{p}</span>

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:450:71
                 return (
                   <tr key={p}>
                     <td className="cfp-partner-cell" title={`Include ${PARTNER_NAME[p]} (${p}) in this call.`}>
-                      <Checkbox checked={partnerEnabled(p)} onChange={() => togglePartner(p)} />
+                      <Checkbox checked={partnerEnabled(p)} onChange={() => undefined} />
                       <span>{p}</span>
                     </td>

[NoCoverage] LogicalOperator
src/features/cfp/CfpPage.tsx:455:32
                     </td>
                     <td>
                       <InputText
-                        value={row?.deadlineOverride ?? ''}
+                        value={row?.deadlineOverride && ''}
                         placeholder="default"
                         disabled={!partnerEnabled(p)}

[NoCoverage] BooleanLiteral
src/features/cfp/CfpPage.tsx:457:35
                       <InputText
                         value={row?.deadlineOverride ?? ''}
                         placeholder="default"
-                        disabled={!partnerEnabled(p)}
+                        disabled={partnerEnabled(p)}
                         title={`Override ${PARTNER_NAME[p]}'s deadline (blank = use the default).`}
                         onChange={(e) => setPartnerDeadline(p, e.target.value)}

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:459:35
                         placeholder="default"
                         disabled={!partnerEnabled(p)}
                         title={`Override ${PARTNER_NAME[p]}'s deadline (blank = use the default).`}
-                        onChange={(e) => setPartnerDeadline(p, e.target.value)}
+                        onChange={() => undefined}
                         className="cfp-deadline-input"
                       />

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:479:30
             Instruments
           </h3>
           <div className="cfp-instruments">
-            {INSTRUMENTS.map((name) => (
-              <label key={name} className="cfp-instrument" title={`Offer ${INSTRUMENT_LABEL[name]} in this call.`}>
-                <Checkbox checked={draft.instruments.includes(name)} onChange={() => toggleInstrument(name)} />
-                <span>{INSTRUMENT_LABEL[name]}</span>
-              </label>
-            ))}
+            {INSTRUMENTS.map(() => undefined)}
           </div>
         </div>

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:481:80
           <div className="cfp-instruments">
             {INSTRUMENTS.map((name) => (
               <label key={name} className="cfp-instrument" title={`Offer ${INSTRUMENT_LABEL[name]} in this call.`}>
-                <Checkbox checked={draft.instruments.includes(name)} onChange={() => toggleInstrument(name)} />
+                <Checkbox checked={draft.instruments.includes(name)} onChange={() => undefined} />
                 <span>{INSTRUMENT_LABEL[name]}</span>
               </label>

[NoCoverage] BooleanLiteral
src/features/cfp/CfpPage.tsx:496:66
             dirty ? 'Discard unsaved edits to this call and revert to the loaded values.' : 'No changes to discard.'
           }
         >
-          <Button text label="Cancel" icon={<XMark />} disabled={!dirty} onClick={() => setDraft(original)} />
+          <Button text label="Cancel" icon={<XMark />} disabled={dirty} onClick={() => setDraft(original)} />
         </span>
         <span

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:496:83
             dirty ? 'Discard unsaved edits to this call and revert to the loaded values.' : 'No changes to discard.'
           }
         >
-          <Button text label="Cancel" icon={<XMark />} disabled={!dirty} onClick={() => setDraft(original)} />
+          <Button text label="Cancel" icon={<XMark />} disabled={!dirty} onClick={() => undefined} />
         </span>
         <span

[NoCoverage] BooleanLiteral
src/features/cfp/CfpPage.tsx:508:23
           <Button
             label="Save"
             icon={<Upload />}
-            disabled={!dirty || saving}
+            disabled={dirty || saving}
             loading={saving}
             onClick={() => void onSave(draft)}

[NoCoverage] LogicalOperator
src/features/cfp/CfpPage.tsx:508:23
           <Button
             label="Save"
             icon={<Upload />}
-            disabled={!dirty || saving}
+            disabled={!dirty && saving}
             loading={saving}
             onClick={() => void onSave(draft)}

[NoCoverage] ArrowFunction
src/features/cfp/CfpPage.tsx:510:22
             icon={<Upload />}
             disabled={!dirty || saving}
             loading={saving}
-            onClick={() => void onSave(draft)}
+            onClick={() => undefined}
           />
         </span>
