[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:50:13
  *  null: PrimeReact's Dropdown hands back the whole option object for
  *  null-valued options, which silently matched nothing (Andy's "All shows an
  *  empty list" / "Both Sites is empty" notes). */
-const ALL = 'ALL';
+const ALL = "";
 
 /**

[NoCoverage] ArrayDeclaration
src/features/changeRequests/ChangeRequestsPage.tsx:70:74
   const { data, loading, error } = useChangeRequests();
   const requests = useMemo(() => (data ? mapChangeRequests(data) : EMPTY), [data]);
   const [updateRequests, { loading: saving }] = useUpdateConfigurationRequests();
-  const programs = useMemo(() => groupChangeRequestsByProgram(requests), [requests]);
+  const programs = useMemo(() => groupChangeRequestsByProgram(requests), []);
 
   const [semester, setSemester] = useState<string>(ALL);

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:77:43
   const [statusFilter, setStatusFilter] = useState<ProgramCrStatus | typeof ALL>(ALL);
 
   const semesters = useMemo(
-    () => Array.from(new Set(programs.map((p) => semesterOf(p.programReference)))).sort(),
+    () => Array.from(new Set(programs.map(() => undefined))).sort(),
     [programs],
   );

[NoCoverage] MethodExpression
src/features/changeRequests/ChangeRequestsPage.tsx:77:11
   const [statusFilter, setStatusFilter] = useState<ProgramCrStatus | typeof ALL>(ALL);
 
   const semesters = useMemo(
-    () => Array.from(new Set(programs.map((p) => semesterOf(p.programReference)))).sort(),
+    () => Array.from(new Set(programs.map(p => semesterOf(p.programReference)))),
     [programs],
   );

[NoCoverage] MethodExpression
src/features/changeRequests/ChangeRequestsPage.tsx:82:7
   );
   const filteredPrograms = useMemo(
     () =>
-      programs.filter(
-        (p) =>
-          (semester === ALL || semesterOf(p.programReference) === semester) &&
-          (site === ALL || p.site === site) &&
-          (statusFilter === ALL || p.status === statusFilter),
-      ),
+      programs,
     [programs, semester, site, statusFilter],
   );

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:83:9
   const filteredPrograms = useMemo(
     () =>
       programs.filter(
-        (p) =>
-          (semester === ALL || semesterOf(p.programReference) === semester) &&
-          (site === ALL || p.site === site) &&
-          (statusFilter === ALL || p.status === statusFilter),
+        () => undefined,
       ),
     [programs, semester, site, statusFilter],

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:84:32
     () =>
       programs.filter(
         (p) =>
-          (semester === ALL || semesterOf(p.programReference) === semester) &&
+          (semester === ALL || semesterOf(p.programReference) !== semester) &&
           (site === ALL || p.site === site) &&
           (statusFilter === ALL || p.status === statusFilter),

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:84:12
     () =>
       programs.filter(
         (p) =>
-          (semester === ALL || semesterOf(p.programReference) === semester) &&
+          (false || semesterOf(p.programReference) === semester) &&
           (site === ALL || p.site === site) &&
           (statusFilter === ALL || p.status === statusFilter),

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:85:28
       programs.filter(
         (p) =>
           (semester === ALL || semesterOf(p.programReference) === semester) &&
-          (site === ALL || p.site === site) &&
+          (site === ALL || p.site !== site) &&
           (statusFilter === ALL || p.status === statusFilter),
       ),

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:85:12
       programs.filter(
         (p) =>
           (semester === ALL || semesterOf(p.programReference) === semester) &&
-          (site === ALL || p.site === site) &&
+          (true) &&
           (statusFilter === ALL || p.status === statusFilter),
       ),

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:86:36
         (p) =>
           (semester === ALL || semesterOf(p.programReference) === semester) &&
           (site === ALL || p.site === site) &&
-          (statusFilter === ALL || p.status === statusFilter),
+          (statusFilter === ALL || false),
       ),
     [programs, semester, site, statusFilter],

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:86:36
         (p) =>
           (semester === ALL || semesterOf(p.programReference) === semester) &&
           (site === ALL || p.site === site) &&
-          (statusFilter === ALL || p.status === statusFilter),
+          (statusFilter === ALL || p.status !== statusFilter),
       ),
     [programs, semester, site, statusFilter],

[NoCoverage] ArrayDeclaration
src/features/changeRequests/ChangeRequestsPage.tsx:88:5
           (site === ALL || p.site === site) &&
           (statusFilter === ALL || p.status === statusFilter),
       ),
-    [programs, semester, site, statusFilter],
+    [],
   );
 

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:93:34
 
   const [selectedProgramId, setSelectedProgramId] = useState<string | null>(null);
   const selectedProgram =
-    filteredPrograms.find((p) => p.programId === selectedProgramId) ?? filteredPrograms[0] ?? null;
+    filteredPrograms.find((p) => p.programId !== selectedProgramId) ?? filteredPrograms[0] ?? null;
 
   const [crStatusFilter, setCrStatusFilter] = useState<ConfigurationRequestStatus | typeof ALL>(ALL);

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:93:27
 
   const [selectedProgramId, setSelectedProgramId] = useState<string | null>(null);
   const selectedProgram =
-    filteredPrograms.find((p) => p.programId === selectedProgramId) ?? filteredPrograms[0] ?? null;
+    filteredPrograms.find(() => undefined) ?? filteredPrograms[0] ?? null;
 
   const [crStatusFilter, setCrStatusFilter] = useState<ConfigurationRequestStatus | typeof ALL>(ALL);

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:97:59
 
   const [crStatusFilter, setCrStatusFilter] = useState<ConfigurationRequestStatus | typeof ALL>(ALL);
   const programRequests = useMemo(
-    () => (selectedProgram?.requests ?? []).filter((r) => crStatusFilter === ALL || r.status === crStatusFilter),
+    () => (selectedProgram?.requests ?? []).filter((r) => false),
     [selectedProgram, crStatusFilter],
   );

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:97:59
 
   const [crStatusFilter, setCrStatusFilter] = useState<ConfigurationRequestStatus | typeof ALL>(ALL);
   const programRequests = useMemo(
-    () => (selectedProgram?.requests ?? []).filter((r) => crStatusFilter === ALL || r.status === crStatusFilter),
+    () => (selectedProgram?.requests ?? []).filter((r) => false || r.status === crStatusFilter),
     [selectedProgram, crStatusFilter],
   );

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:119:47
         ...r,
         observations: r.observationIds
           .map((id) => observationsById.get(id))
-          .filter((o): o is ObservationRow => o !== undefined),
+          .filter((o): o is ObservationRow => false),
       })),
     [programRequests, observationsById],

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:119:47
         ...r,
         observations: r.observationIds
           .map((id) => observationsById.get(id))
-          .filter((o): o is ObservationRow => o !== undefined),
+          .filter((o): o is ObservationRow => o === undefined),
       })),
     [programRequests, observationsById],

[NoCoverage] ArrayDeclaration
src/features/changeRequests/ChangeRequestsPage.tsx:121:5
           .map((id) => observationsById.get(id))
           .filter((o): o is ObservationRow => o !== undefined),
       })),
-    [programRequests, observationsById],
+    [],
   );
 

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:127:51
   // DataTable's own checkbox-selection column (a body-template Checkbox never
   // repainted its checkmark — memoized cells; Andy's "checkmark never appears").
   const [selectedIds, setSelectedIds] = useState<ReadonlySet<string>>(new Set());
-  const selectedRequests = visibleRequests.filter((r) => selectedIds.has(r.id));
+  const selectedRequests = visibleRequests.filter(() => undefined);
 
   const [response, setResponse] = useState('');

[NoCoverage] MethodExpression
src/features/changeRequests/ChangeRequestsPage.tsx:127:28
   // DataTable's own checkbox-selection column (a body-template Checkbox never
   // repainted its checkmark — memoized cells; Andy's "checkmark never appears").
   const [selectedIds, setSelectedIds] = useState<ReadonlySet<string>>(new Set());
-  const selectedRequests = visibleRequests.filter((r) => selectedIds.has(r.id));
+  const selectedRequests = visibleRequests;
 
   const [response, setResponse] = useState('');

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:144:7
   // changes, so a drafted decision/response can never carry over to a
   // different program.
   const [reviewedProgramId, setReviewedProgramId] = useState<string | null>(null);
-  if ((selectedProgram?.programId ?? null) !== reviewedProgramId) {
+  if ((selectedProgram?.programId ?? null) === reviewedProgramId) {
     setReviewedProgramId(selectedProgram?.programId ?? null);
     setSelectedIds(new Set());

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:144:7
   // changes, so a drafted decision/response can never carry over to a
   // different program.
   const [reviewedProgramId, setReviewedProgramId] = useState<string | null>(null);
-  if ((selectedProgram?.programId ?? null) !== reviewedProgramId) {
+  if (false) {
     setReviewedProgramId(selectedProgram?.programId ?? null);
     setSelectedIds(new Set());

[NoCoverage] LogicalOperator
src/features/changeRequests/ChangeRequestsPage.tsx:152:16
   }
 
   function boilerplate(items: readonly ChangeRequest[], next: Decision): string {
-    const pi = items[0]?.pi ?? 'PI';
+    const pi = items[0]?.pi && 'PI';
     const ids = items.map((r) => r.id).join(', ');
     return next === 'APPROVED'

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:153:27
 
   function boilerplate(items: readonly ChangeRequest[], next: Decision): string {
     const pi = items[0]?.pi ?? 'PI';
-    const ids = items.map((r) => r.id).join(', ');
+    const ids = items.map(() => undefined).join(', ');
     return next === 'APPROVED'
       ? `Dear ${pi},\n\nThanks for submitting a change request. Your requested changes (${ids}) have been approved and applied to the affected observations.\n\nRegards,\nGemini Science Operations`

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:154:12
   function boilerplate(items: readonly ChangeRequest[], next: Decision): string {
     const pi = items[0]?.pi ?? 'PI';
     const ids = items.map((r) => r.id).join(', ');
-    return next === 'APPROVED'
+    return false
       ? `Dear ${pi},\n\nThanks for submitting a change request. Your requested changes (${ids}) have been approved and applied to the affected observations.\n\nRegards,\nGemini Science Operations`

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:154:12
   function boilerplate(items: readonly ChangeRequest[], next: Decision): string {
     const pi = items[0]?.pi ?? 'PI';
     const ids = items.map((r) => r.id).join(', ');
-    return next === 'APPROVED'
+    return next !== 'APPROVED'
       ? `Dear ${pi},\n\nThanks for submitting a change request. Your requested changes (${ids}) have been approved and applied to the affected observations.\n\nRegards,\nGemini Science Operations`

[NoCoverage] BlockStatement
src/features/changeRequests/ChangeRequestsPage.tsx:159:41
   }
 
-  function choose(next: Decision): void {
-    setDecision(next);
-    setResponse(boilerplate(selectedRequests, next));
-  }
+  function choose(next: Decision): void {}
 
   async function confirm(): Promise<void> {

[NoCoverage] BlockStatement
src/features/changeRequests/ChangeRequestsPage.tsx:164:43
     setResponse(boilerplate(selectedRequests, next));
   }
 
-  async function confirm(): Promise<void> {
-    if (!decision || selectedRequests.length === 0) return;
-    const ids = selectedRequests.map((r) => r.id);
-    try {
-      await updateRequests({ variables: { ids, status: decision } });
-      toast.success(
-        decision === 'APPROVED' ? 'Change requests approved' : 'Change requests denied',
-        `${ids.length} request${ids.length === 1 ? '' : 's'} in ${selectedProgram?.programReference ?? ''}`,
-      );
-      setReviewerNotes((prev) => {
-        const next = new Map(prev);
-        for (const id of ids) next.set(id, response);
-        return next;
-      });
-      setSelectedIds(new Set());
-      setDecision(null);
-      setResponse('');
-    } catch (err) {
-      toast.error('Update failed', friendlyError(err));
-    }
-  }
+  async function confirm(): Promise<void> {}
 
   const tileControls = (

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:165:22
   }
 
   async function confirm(): Promise<void> {
-    if (!decision || selectedRequests.length === 0) return;
+    if (!decision || selectedRequests.length !== 0) return;
     const ids = selectedRequests.map((r) => r.id);
     try {

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:165:22
   }
 
   async function confirm(): Promise<void> {
-    if (!decision || selectedRequests.length === 0) return;
+    if (!decision || false) return;
     const ids = selectedRequests.map((r) => r.id);
     try {

[NoCoverage] BlockStatement
src/features/changeRequests/ChangeRequestsPage.tsx:167:9
   async function confirm(): Promise<void> {
     if (!decision || selectedRequests.length === 0) return;
     const ids = selectedRequests.map((r) => r.id);
-    try {
-      await updateRequests({ variables: { ids, status: decision } });
-      toast.success(
-        decision === 'APPROVED' ? 'Change requests approved' : 'Change requests denied',
-        `${ids.length} request${ids.length === 1 ? '' : 's'} in ${selectedProgram?.programReference ?? ''}`,
-      );
-      setReviewerNotes((prev) => {
-        const next = new Map(prev);
-        for (const id of ids) next.set(id, response);
-        return next;
-      });
-      setSelectedIds(new Set());
-      setDecision(null);
-      setResponse('');
-    } catch (err) {
+    try {} catch (err) {
       toast.error('Update failed', friendlyError(err));
     }

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:170:9
     try {
       await updateRequests({ variables: { ids, status: decision } });
       toast.success(
-        decision === 'APPROVED' ? 'Change requests approved' : 'Change requests denied',
+        true ? 'Change requests approved' : 'Change requests denied',
         `${ids.length} request${ids.length === 1 ? '' : 's'} in ${selectedProgram?.programReference ?? ''}`,
       );

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:170:9
     try {
       await updateRequests({ variables: { ids, status: decision } });
       toast.success(
-        decision === 'APPROVED' ? 'Change requests approved' : 'Change requests denied',
+        false ? 'Change requests approved' : 'Change requests denied',
         `${ids.length} request${ids.length === 1 ? '' : 's'} in ${selectedProgram?.programReference ?? ''}`,
       );

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:171:33
       await updateRequests({ variables: { ids, status: decision } });
       toast.success(
         decision === 'APPROVED' ? 'Change requests approved' : 'Change requests denied',
-        `${ids.length} request${ids.length === 1 ? '' : 's'} in ${selectedProgram?.programReference ?? ''}`,
+        `${ids.length} request${false ? '' : 's'} in ${selectedProgram?.programReference ?? ''}`,
       );
       setReviewerNotes((prev) => {

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:171:33
       await updateRequests({ variables: { ids, status: decision } });
       toast.success(
         decision === 'APPROVED' ? 'Change requests approved' : 'Change requests denied',
-        `${ids.length} request${ids.length === 1 ? '' : 's'} in ${selectedProgram?.programReference ?? ''}`,
+        `${ids.length} request${ids.length !== 1 ? '' : 's'} in ${selectedProgram?.programReference ?? ''}`,
       );
       setReviewerNotes((prev) => {

[NoCoverage] BlockStatement
src/features/changeRequests/ChangeRequestsPage.tsx:181:19
       setSelectedIds(new Set());
       setDecision(null);
       setResponse('');
-    } catch (err) {
-      toast.error('Update failed', friendlyError(err));
-    }
+    } catch (err) {}
   }
 

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:190:76
     <>
       <Dropdown
         value={semester}
-        options={[{ label: 'All semesters', value: ALL }, ...semesters.map((s) => ({ label: s, value: s }))]}
+        options={[{ label: 'All semesters', value: ALL }, ...semesters.map(() => undefined)]}
         onChange={(e) => setSemester(e.value as string)}
         title="Filter programs by semester, parsed from the program reference."

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:191:19
       <Dropdown
         value={semester}
         options={[{ label: 'All semesters', value: ALL }, ...semesters.map((s) => ({ label: s, value: s }))]}
-        onChange={(e) => setSemester(e.value as string)}
+        onChange={() => undefined}
         title="Filter programs by semester, parsed from the program reference."
       />

[NoCoverage] ObjectLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:198:11
         value={site}
         options={[
           { label: 'Both sites', value: ALL },
-          { label: 'North', value: 'NORTH' },
+          {},
           { label: 'South', value: 'SOUTH' },
         ]}

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:199:20
         options={[
           { label: 'Both sites', value: ALL },
           { label: 'North', value: 'NORTH' },
-          { label: 'South', value: 'SOUTH' },
+          { label: "", value: 'SOUTH' },
         ]}
         onChange={(e) => setSite(e.value as Site | typeof ALL)}

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:201:19
           { label: 'North', value: 'NORTH' },
           { label: 'South', value: 'SOUTH' },
         ]}
-        onChange={(e) => setSite(e.value as Site | typeof ALL)}
+        onChange={() => undefined}
         title="Programs are site-agnostic, but their change requests are for individual observations tied to an instrument — filter by that instrument's site."
       />

[NoCoverage] ObjectLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:207:11
       <Dropdown
         value={statusFilter}
         options={[
-          { label: 'All statuses', value: ALL },
+          {},
           { label: 'Approved', value: 'Approved' },
           { label: 'Denied', value: 'Denied' },

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:208:39
         value={statusFilter}
         options={[
           { label: 'All statuses', value: ALL },
-          { label: 'Approved', value: 'Approved' },
+          { label: 'Approved', value: "" },
           { label: 'Denied', value: 'Denied' },
           { label: 'Open', value: 'Open' },

[NoCoverage] ObjectLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:209:11
         options={[
           { label: 'All statuses', value: ALL },
           { label: 'Approved', value: 'Approved' },
-          { label: 'Denied', value: 'Denied' },
+          {},
           { label: 'Open', value: 'Open' },
           { label: 'Mixed', value: 'Mixed' },

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:209:37
         options={[
           { label: 'All statuses', value: ALL },
           { label: 'Approved', value: 'Approved' },
-          { label: 'Denied', value: 'Denied' },
+          { label: 'Denied', value: "" },
           { label: 'Open', value: 'Open' },
           { label: 'Mixed', value: 'Mixed' },

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:210:20
           { label: 'All statuses', value: ALL },
           { label: 'Approved', value: 'Approved' },
           { label: 'Denied', value: 'Denied' },
-          { label: 'Open', value: 'Open' },
+          { label: "", value: 'Open' },
           { label: 'Mixed', value: 'Mixed' },
         ]}

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:213:19
           { label: 'Open', value: 'Open' },
           { label: 'Mixed', value: 'Mixed' },
         ]}
-        onChange={(e) => setStatusFilter(e.value as ProgramCrStatus | typeof ALL)}
+        onChange={() => undefined}
         title="Facet the programs by their synthesized change-request status."
       />

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:216:87
         onChange={(e) => setStatusFilter(e.value as ProgramCrStatus | typeof ALL)}
         title="Facet the programs by their synthesized change-request status."
       />
-      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={programs.length === 0} />
+      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={true} />
     </>
   );

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:216:87
         onChange={(e) => setStatusFilter(e.value as ProgramCrStatus | typeof ALL)}
         title="Facet the programs by their synthesized change-request status."
       />
-      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={programs.length === 0} />
+      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={false} />
     </>
   );

[NoCoverage] LogicalOperator
src/features/changeRequests/ChangeRequestsPage.tsx:231:22
           value={filteredPrograms}
           dataKey="programId"
           selectionMode="single"
-          selection={selectedProgram ?? undefined}
+          selection={selectedProgram && undefined}
           onSelectionChange={(e) => setSelectedProgramId((e.value as { programId: string } | null)?.programId ?? null)}
           emptyMessage="No programs with change requests."

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:232:30
           dataKey="programId"
           selectionMode="single"
           selection={selectedProgram ?? undefined}
-          onSelectionChange={(e) => setSelectedProgramId((e.value as { programId: string } | null)?.programId ?? null)}
+          onSelectionChange={() => undefined}
           emptyMessage="No programs with change requests."
           className="cr-table"

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:247:29
             header="Status"
             sortable
             sortField="status"
-            style={{ width: '9rem' }}
+            style={{ width: "" }}
             body={(p: (typeof filteredPrograms)[number]) => (

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:249:19
             sortField="status"
             style={{ width: '9rem' }}
-            body={(p: (typeof filteredPrograms)[number]) => (
-              <span className={cn('cr-status-pill', STATUS_COLOR[p.status])}>{p.status}</span>
-            )}
+            body={() => undefined}
           />
           <Column field="pi" header="PI" sortable style={{ width: '13rem' }} />

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:253:67
               <span className={cn('cr-status-pill', STATUS_COLOR[p.status])}>{p.status}</span>
             )}
           />
-          <Column field="pi" header="PI" sortable style={{ width: '13rem' }} />
+          <Column field="pi" header="PI" sortable style={{ width: "" }} />
           <Column field="programTitle" header="Title" sortable />
         </DataTable>

[NoCoverage] ObjectLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:253:58
               <span className={cn('cr-status-pill', STATUS_COLOR[p.status])}>{p.status}</span>
             )}
           />
-          <Column field="pi" header="PI" sortable style={{ width: '13rem' }} />
+          <Column field="pi" header="PI" sortable style={{}} />
           <Column field="programTitle" header="Title" sortable />
         </DataTable>

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:260:18
 
       {selectedProgram && (
         <Tile
-          title={`Change Requests in ${selectedProgram.programId}`}
+          title={``}
           controls={
             <Dropdown

[NoCoverage] ObjectLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:265:17
             <Dropdown
               value={crStatusFilter}
               options={[
-                { label: 'All', value: ALL },
+                {},
                 { label: 'Requested', value: 'REQUESTED' },
                 { label: 'Approved', value: 'APPROVED' },

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:267:45
               options={[
                 { label: 'All', value: ALL },
                 { label: 'Requested', value: 'REQUESTED' },
-                { label: 'Approved', value: 'APPROVED' },
+                { label: 'Approved', value: "" },
                 { label: 'Denied', value: 'DENIED' },
                 { label: 'Withdrawn', value: 'WITHDRAWN' },

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:269:46
                 { label: 'Requested', value: 'REQUESTED' },
                 { label: 'Approved', value: 'APPROVED' },
                 { label: 'Denied', value: 'DENIED' },
-                { label: 'Withdrawn', value: 'WITHDRAWN' },
+                { label: 'Withdrawn', value: "" },
               ]}
               onChange={(e) => setCrStatusFilter(e.value as ConfigurationRequestStatus | typeof ALL)}

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:271:25
                 { label: 'Denied', value: 'DENIED' },
                 { label: 'Withdrawn', value: 'WITHDRAWN' },
               ]}
-              onChange={(e) => setCrStatusFilter(e.value as ConfigurationRequestStatus | typeof ALL)}
+              onChange={() => undefined}
               title="Filter the requests below by their individual status."
             />

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:283:32
             className="cr-table"
             selectionMode="checkbox"
             selection={selectedRequests}
-            onSelectionChange={(e) => setSelectedIds(new Set(e.value.map((r) => r.id)))}
+            onSelectionChange={() => undefined}
           >
             <Column selectionMode="multiple" style={{ width: '2.5rem' }} />

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:290:21
             <Column
               header="Received"
               style={{ width: '8rem' }}
-              body={() => <span className="cr-untracked">not yet tracked</span>}
+              body={() => undefined}
               headerTooltip="The date a change request was received isn't tracked by the ODB yet — a known sc-9094 gap."
             />

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:296:21
             <Column
               header="Target"
               style={{ width: '7rem' }}
-              body={() => '—'}
+              body={() => undefined}
               headerTooltip="No target name is tracked by the ODB — only coordinates are available (see RA/Dec)."
             />

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:296:27
             <Column
               header="Target"
               style={{ width: '7rem' }}
-              body={() => '—'}
+              body={() => ""}
               headerTooltip="No target name is tracked by the ODB — only coordinates are available (see RA/Dec)."
             />

[NoCoverage] ObjectLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:301:63
             />
             <Column field="ra" header="RA" style={{ width: '9rem' }} />
             <Column field="dec" header="Dec" style={{ width: '9rem' }} />
-            <Column field="instrument" header="Config" style={{ width: '7rem' }} />
+            <Column field="instrument" header="Config" style={{}} />
             <Column field="conditions" header="Conditions" style={{ width: '9rem' }} />
             <Column

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:302:76
             <Column field="ra" header="RA" style={{ width: '9rem' }} />
             <Column field="dec" header="Dec" style={{ width: '9rem' }} />
             <Column field="instrument" header="Config" style={{ width: '7rem' }} />
-            <Column field="conditions" header="Conditions" style={{ width: '9rem' }} />
+            <Column field="conditions" header="Conditions" style={{ width: "" }} />
             <Column
               header="Observations"
