[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:305:31
             <Column field="conditions" header="Conditions" style={{ width: '9rem' }} />
             <Column
               header="Observations"
-              style={{ width: '8rem' }}
+              style={{ width: "" }}
               body={(r: ChangeRequest) => r.observationIds.join(', ') || '—'}
             />

[NoCoverage] ObjectLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:305:22
             <Column field="conditions" header="Conditions" style={{ width: '9rem' }} />
             <Column
               header="Observations"
-              style={{ width: '8rem' }}
+              style={{}}
               body={(r: ChangeRequest) => r.observationIds.join(', ') || '—'}
             />

[NoCoverage] LogicalOperator
src/features/changeRequests/ChangeRequestsPage.tsx:306:43
             <Column
               header="Observations"
               style={{ width: '8rem' }}
-              body={(r: ChangeRequest) => r.observationIds.join(', ') || '—'}
+              body={(r: ChangeRequest) => r.observationIds.join(', ') && '—'}
             />
             <Column

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:306:43
             <Column
               header="Observations"
               style={{ width: '8rem' }}
-              body={(r: ChangeRequest) => r.observationIds.join(', ') || '—'}
+              body={(r: ChangeRequest) => true}
             />
             <Column

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:310:21
             />
             <Column
               header="Justification"
-              body={(r: ChangeRequest) => truncate(r.justification, 60)}
+              body={() => undefined}
               headerTooltip="The PI's justification for the change."
             />

[NoCoverage] ObjectLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:315:22
             />
             <Column
               header="Status"
-              style={{ width: '5rem' }}
+              style={{}}
               body={(r: ChangeRequest) => {
                 const note = reviewerNotes.get(r.id);

[NoCoverage] BlockStatement
src/features/changeRequests/ChangeRequestsPage.tsx:316:43
             <Column
               header="Status"
               style={{ width: '5rem' }}
-              body={(r: ChangeRequest) => {
-                const note = reviewerNotes.get(r.id);
-                const label =
-                  r.status === 'REQUESTED'
-                    ? 'Pending'
-                    : r.status === 'APPROVED'
-                      ? 'Approved'
-                      : r.status === 'DENIED'
-                        ? 'Denied'
-                        : 'Withdrawn';
-                return (
-                  <span
-                    className={cn('cr-dot', CR_STATUS_ICON[r.status])}
-                    title={note ? `${label} — reviewer response: ${note}` : label}
-                  />
-                );
-              }}
+              body={(r: ChangeRequest) => {}}
             />

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:319:19
               body={(r: ChangeRequest) => {
                 const note = reviewerNotes.get(r.id);
                 const label =
-                  r.status === 'REQUESTED'
+                  false
                     ? 'Pending'
                     : r.status === 'APPROVED'

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:319:19
               body={(r: ChangeRequest) => {
                 const note = reviewerNotes.get(r.id);
                 const label =
-                  r.status === 'REQUESTED'
+                  true
                     ? 'Pending'
                     : r.status === 'APPROVED'

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:321:23
                 const label =
                   r.status === 'REQUESTED'
                     ? 'Pending'
-                    : r.status === 'APPROVED'
+                    : false
                       ? 'Approved'
                       : r.status === 'DENIED'

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:321:23
                 const label =
                   r.status === 'REQUESTED'
                     ? 'Pending'
-                    : r.status === 'APPROVED'
+                    : true
                       ? 'Approved'
                       : r.status === 'DENIED'

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:323:25
                     ? 'Pending'
                     : r.status === 'APPROVED'
                       ? 'Approved'
-                      : r.status === 'DENIED'
+                      : false
                         ? 'Denied'
                         : 'Withdrawn';

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:323:25
                     ? 'Pending'
                     : r.status === 'APPROVED'
                       ? 'Approved'
-                      : r.status === 'DENIED'
+                      : r.status !== 'DENIED'
                         ? 'Denied'
                         : 'Withdrawn';

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:324:27
                     : r.status === 'APPROVED'
                       ? 'Approved'
                       : r.status === 'DENIED'
-                        ? 'Denied'
+                        ? ""
                         : 'Withdrawn';
                 return (

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:325:27
                       ? 'Approved'
                       : r.status === 'DENIED'
                         ? 'Denied'
-                        : 'Withdrawn';
+                        : "";
                 return (
                   <span

[NoCoverage] StringLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:328:35
                         : 'Withdrawn';
                 return (
                   <span
-                    className={cn('cr-dot', CR_STATUS_ICON[r.status])}
+                    className={cn("", CR_STATUS_ICON[r.status])}
                     title={note ? `${label} — reviewer response: ${note}` : label}
                   />

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:339:27
         </Tile>
       )}
 
-      {selectedProgram && selectedRequests.length > 0 && (
+      {selectedProgram && selectedRequests.length >= 0 && (
         <Tile title={`Selected Change Requests in ${selectedProgram.programId}`}>
           <p className="cr-selected-ids">{selectedRequests.map((r) => r.id).join(', ')}</p>

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:339:27
         </Tile>
       )}
 
-      {selectedProgram && selectedRequests.length > 0 && (
+      {selectedProgram && true && (
         <Tile title={`Selected Change Requests in ${selectedProgram.programId}`}>
           <p className="cr-selected-ids">{selectedRequests.map((r) => r.id).join(', ')}</p>

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:341:64
 
       {selectedProgram && selectedRequests.length > 0 && (
         <Tile title={`Selected Change Requests in ${selectedProgram.programId}`}>
-          <p className="cr-selected-ids">{selectedRequests.map((r) => r.id).join(', ')}</p>
+          <p className="cr-selected-ids">{selectedRequests.map(() => undefined).join(', ')}</p>
 
           <ConflictsTable title="Potential Conflicts of the Selected Change Requests" sources={selectedRequests} />

[NoCoverage] BooleanLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:351:42
           />
 
           <InputTextarea
-            className={cn('cr-response', !decision && 'is-disabled')}
+            className={cn('cr-response', decision && 'is-disabled')}
             rows={5}
             placeholder="Choose Approve or Deny to seed a response to the PI…"

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:351:42
           />
 
           <InputTextarea
-            className={cn('cr-response', !decision && 'is-disabled')}
+            className={cn('cr-response', false)}
             rows={5}
             placeholder="Choose Approve or Deny to seed a response to the PI…"

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:357:23
             value={response}
             disabled={!decision}
             title="The message sent to the PI, covering all selected change requests. Pre-filled with boilerplate; edit freely before confirming."
-            onChange={(e) => setResponse(e.target.value)}
+            onChange={() => undefined}
           />
 

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:365:25
               label="Deny"
               icon={<XMark />}
               severity="danger"
-              outlined={decision !== 'DENIED'}
+              outlined={decision === 'DENIED'}
               tooltip="Mark every selected change request as denied and seed a decline response."
               tooltipOptions={{ position: 'top' }}

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:365:25
               label="Deny"
               icon={<XMark />}
               severity="danger"
-              outlined={decision !== 'DENIED'}
+              outlined={false}
               tooltip="Mark every selected change request as denied and seed a decline response."
               tooltipOptions={{ position: 'top' }}

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:368:24
               outlined={decision !== 'DENIED'}
               tooltip="Mark every selected change request as denied and seed a decline response."
               tooltipOptions={{ position: 'top' }}
-              onClick={() => choose('DENIED')}
+              onClick={() => undefined}
             />
             <Button

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:374:25
               label="Approve"
               icon={<Check />}
               severity="success"
-              outlined={decision !== 'APPROVED'}
+              outlined={true}
               tooltip="Mark every selected change request as approved and seed an approval response."
               tooltipOptions={{ position: 'top' }}

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:374:25
               label="Approve"
               icon={<Check />}
               severity="success"
-              outlined={decision !== 'APPROVED'}
+              outlined={decision === 'APPROVED'}
               tooltip="Mark every selected change request as approved and seed an approval response."
               tooltipOptions={{ position: 'top' }}

[NoCoverage] ObjectLiteral
src/features/changeRequests/ChangeRequestsPage.tsx:376:31
               severity="success"
               outlined={decision !== 'APPROVED'}
               tooltip="Mark every selected change request as approved and seed an approval response."
-              tooltipOptions={{ position: 'top' }}
+              tooltipOptions={{}}
               onClick={() => choose('APPROVED')}
             />

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:377:24
               outlined={decision !== 'APPROVED'}
               tooltip="Mark every selected change request as approved and seed an approval response."
               tooltipOptions={{ position: 'top' }}
-              onClick={() => choose('APPROVED')}
+              onClick={() => undefined}
             />
             <span

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:389:27
               <Button
                 label="Confirm"
                 icon={<PaperPlane />}
-                disabled={!decision || saving}
+                disabled={false}
                 loading={saving}
                 onClick={() => void confirm()}

[NoCoverage] ConditionalExpression
src/features/changeRequests/ChangeRequestsPage.tsx:389:27
               <Button
                 label="Confirm"
                 icon={<PaperPlane />}
-                disabled={!decision || saving}
+                disabled={true}
                 loading={saving}
                 onClick={() => void confirm()}

[NoCoverage] ArrowFunction
src/features/changeRequests/ChangeRequestsPage.tsx:391:26
                 icon={<PaperPlane />}
                 disabled={!decision || saving}
                 loading={saving}
-                onClick={() => void confirm()}
+                onClick={() => undefined}
               />
             </span>

[NoCoverage] EqualityOperator
src/features/changeRequests/ChangeRequestsPage.tsx:402:10
 }
 
 function truncate(s: string, n: number): string {
-  return s.length > n ? `${s.slice(0, n)}…` : s;
+  return s.length <= n ? `${s.slice(0, n)}…` : s;
 }
 

[NoCoverage] MethodExpression
src/features/changeRequests/ChangeRequestsPage.tsx:402:28
 }
 
 function truncate(s: string, n: number): string {
-  return s.length > n ? `${s.slice(0, n)}…` : s;
+  return s.length > n ? `${s}…` : s;
 }
 

[NoCoverage] Regex
src/features/changeRequests/ChangeRequestsPage.tsx:409:13
  *  "2027B"). Programs without a reference fall back to their internal id,
  *  which has no semester — group those under "—". */
 function semesterOf(programReference: string): string {
-  const m = /-(\d{4}[AB])-/.exec(programReference);
+  const m = /-(\D{4}[AB])-/.exec(programReference);
   return m ? m[1]! : '—';
 }
