[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:77:5
   const [linkUser, { loading: linkingUser }] = useLinkUser();
   const [deleteProgramUser, { loading: deletingUser }] = useDeleteProgramUser();
   const saving =
-    updatingProgram ||
-    updatingProposalType ||
-    settingAllocations ||
-    creatingNote ||
-    updatingNote ||
-    addingUser ||
-    linkingUser ||
-    deletingUser;
+    false;
 
   /** Persist every edited aspect of the program through its own mutation.

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:77:5
   const [linkUser, { loading: linkingUser }] = useLinkUser();
   const [deleteProgramUser, { loading: deletingUser }] = useDeleteProgramUser();
   const saving =
-    updatingProgram ||
-    updatingProposalType ||
-    settingAllocations ||
-    creatingNote ||
-    updatingNote ||
-    addingUser ||
-    linkingUser ||
+    false ||
     deletingUser;
 

[NoCoverage] EqualityOperator
src/features/programs/ProgramsPage.tsx:95:9
 
     await updateProposalType({ variables: { programId: draft.id, gemini: proposalTypeInput(draft) } });
 
-    if (JSON.stringify(draft.allocations) !== JSON.stringify(original.allocations)) {
+    if (JSON.stringify(draft.allocations) === JSON.stringify(original.allocations)) {
       await setAllocations({ variables: { programId: draft.id, allocations: allocationsInput(draft.allocations) } });
     }

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:95:9
 
     await updateProposalType({ variables: { programId: draft.id, gemini: proposalTypeInput(draft) } });
 
-    if (JSON.stringify(draft.allocations) !== JSON.stringify(original.allocations)) {
+    if (true) {
       await setAllocations({ variables: { programId: draft.id, allocations: allocationsInput(draft.allocations) } });
     }

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:99:55
       await setAllocations({ variables: { programId: draft.id, allocations: allocationsInput(draft.allocations) } });
     }
 
-    if (draft.privateNote !== original.privateNote && draft.privateNote.trim() !== '') {
+    if (draft.privateNote !== original.privateNote && true) {
       if (draft.privateNoteId) {
         await updateNote({ variables: { noteId: draft.privateNoteId, text: draft.privateNote } });

[NoCoverage] EqualityOperator
src/features/programs/ProgramsPage.tsx:99:55
       await setAllocations({ variables: { programId: draft.id, allocations: allocationsInput(draft.allocations) } });
     }
 
-    if (draft.privateNote !== original.privateNote && draft.privateNote.trim() !== '') {
+    if (draft.privateNote !== original.privateNote && draft.privateNote.trim() === '') {
       if (draft.privateNoteId) {
         await updateNote({ variables: { noteId: draft.privateNoteId, text: draft.privateNote } });

[NoCoverage] BlockStatement
src/features/programs/ProgramsPage.tsx:100:32
     }
 
     if (draft.privateNote !== original.privateNote && draft.privateNote.trim() !== '') {
-      if (draft.privateNoteId) {
-        await updateNote({ variables: { noteId: draft.privateNoteId, text: draft.privateNote } });
-      } else {
+      if (draft.privateNoteId) {} else {
         await createNote({ variables: { programId: draft.id, text: draft.privateNote } });
       }

[NoCoverage] BlockStatement
src/features/programs/ProgramsPage.tsx:102:14
     if (draft.privateNote !== original.privateNote && draft.privateNote.trim() !== '') {
       if (draft.privateNoteId) {
         await updateNote({ variables: { noteId: draft.privateNoteId, text: draft.privateNote } });
-      } else {
-        await createNote({ variables: { programId: draft.id, text: draft.privateNote } });
-      }
+      } else {}
     }
 

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:108:30
     }
 
     // Contact scientists: link roster picks that are new, unlink removals.
-    const draftIds = new Set(draft.contactScientists.map((c) => c.programUserId).filter(Boolean));
+    const draftIds = new Set(draft.contactScientists.map(c => c.programUserId));
     for (const removed of original.contactScientists.filter((c) => !draftIds.has(c.programUserId))) {
       await deleteProgramUser({ variables: { programUserId: removed.programUserId ?? '' } });

[NoCoverage] BlockStatement
src/features/programs/ProgramsPage.tsx:109:101
 
     // Contact scientists: link roster picks that are new, unlink removals.
     const draftIds = new Set(draft.contactScientists.map((c) => c.programUserId).filter(Boolean));
-    for (const removed of original.contactScientists.filter((c) => !draftIds.has(c.programUserId))) {
-      await deleteProgramUser({ variables: { programUserId: removed.programUserId ?? '' } });
-    }
+    for (const removed of original.contactScientists.filter((c) => !draftIds.has(c.programUserId))) {}
     for (const added of draft.contactScientists.filter((c) => !c.programUserId && c.userId)) {
       const res = await addProgramUser({ variables: { programId: draft.id } });

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:109:61
 
     // Contact scientists: link roster picks that are new, unlink removals.
     const draftIds = new Set(draft.contactScientists.map((c) => c.programUserId).filter(Boolean));
-    for (const removed of original.contactScientists.filter((c) => !draftIds.has(c.programUserId))) {
+    for (const removed of original.contactScientists.filter(() => undefined)) {
       await deleteProgramUser({ variables: { programUserId: removed.programUserId ?? '' } });
     }

[NoCoverage] StringLiteral
src/features/programs/ProgramsPage.tsx:110:86
     // Contact scientists: link roster picks that are new, unlink removals.
     const draftIds = new Set(draft.contactScientists.map((c) => c.programUserId).filter(Boolean));
     for (const removed of original.contactScientists.filter((c) => !draftIds.has(c.programUserId))) {
-      await deleteProgramUser({ variables: { programUserId: removed.programUserId ?? '' } });
+      await deleteProgramUser({ variables: { programUserId: removed.programUserId ?? "Stryker was here!" } });
     }
     for (const added of draft.contactScientists.filter((c) => !c.programUserId && c.userId)) {

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:112:25
     for (const removed of original.contactScientists.filter((c) => !draftIds.has(c.programUserId))) {
       await deleteProgramUser({ variables: { programUserId: removed.programUserId ?? '' } });
     }
-    for (const added of draft.contactScientists.filter((c) => !c.programUserId && c.userId)) {
+    for (const added of draft.contactScientists) {
       const res = await addProgramUser({ variables: { programId: draft.id } });
       const programUserId = res.data?.addProgramUser.programUser.id;

[NoCoverage] BooleanLiteral
src/features/programs/ProgramsPage.tsx:112:63
     for (const removed of original.contactScientists.filter((c) => !draftIds.has(c.programUserId))) {
       await deleteProgramUser({ variables: { programUserId: removed.programUserId ?? '' } });
     }
-    for (const added of draft.contactScientists.filter((c) => !c.programUserId && c.userId)) {
+    for (const added of draft.contactScientists.filter((c) => c.programUserId && c.userId)) {
       const res = await addProgramUser({ variables: { programId: draft.id } });
       const programUserId = res.data?.addProgramUser.programUser.id;

[NoCoverage] StringLiteral
src/features/programs/ProgramsPage.tsx:115:95
     for (const added of draft.contactScientists.filter((c) => !c.programUserId && c.userId)) {
       const res = await addProgramUser({ variables: { programId: draft.id } });
       const programUserId = res.data?.addProgramUser.programUser.id;
-      if (programUserId) await linkUser({ variables: { programUserId, userId: added.userId ?? '' } });
+      if (programUserId) await linkUser({ variables: { programUserId, userId: added.userId ?? "Stryker was here!" } });
     }
   }

[NoCoverage] StringLiteral
src/features/programs/ProgramsPage.tsx:120:40
   }
 
   const [classFilter, setClassFilter] = useState<ProgramClass | typeof ALL>(ALL);
-  const [search, setSearch] = useState('');
+  const [search, setSearch] = useState("Stryker was here!");
   const filteredPrograms = useMemo(() => {
     const text = search.trim().toLowerCase();

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:122:18
   const [classFilter, setClassFilter] = useState<ProgramClass | typeof ALL>(ALL);
   const [search, setSearch] = useState('');
   const filteredPrograms = useMemo(() => {
-    const text = search.trim().toLowerCase();
+    const text = search.toLowerCase();
     return programs.filter(
       (p) =>

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:122:18
   const [classFilter, setClassFilter] = useState<ProgramClass | typeof ALL>(ALL);
   const [search, setSearch] = useState('');
   const filteredPrograms = useMemo(() => {
-    const text = search.trim().toLowerCase();
+    const text = search.trim().toUpperCase();
     return programs.filter(
       (p) =>

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:123:12
   const [search, setSearch] = useState('');
   const filteredPrograms = useMemo(() => {
     const text = search.trim().toLowerCase();
-    return programs.filter(
-      (p) =>
-        (classFilter === ALL || p.programClass === classFilter) &&
-        (text === '' || [p.reference, p.name, p.pi].some((f) => f.toLowerCase().includes(text))),
-    );
+    return programs;
   }, [programs, classFilter, search]);
 

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:124:7
   const filteredPrograms = useMemo(() => {
     const text = search.trim().toLowerCase();
     return programs.filter(
-      (p) =>
-        (classFilter === ALL || p.programClass === classFilter) &&
-        (text === '' || [p.reference, p.name, p.pi].some((f) => f.toLowerCase().includes(text))),
+      () => undefined,
     );
   }, [programs, classFilter, search]);

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:125:10
     const text = search.trim().toLowerCase();
     return programs.filter(
       (p) =>
-        (classFilter === ALL || p.programClass === classFilter) &&
+        (false || p.programClass === classFilter) &&
         (text === '' || [p.reference, p.name, p.pi].some((f) => f.toLowerCase().includes(text))),
     );

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:125:9
     const text = search.trim().toLowerCase();
     return programs.filter(
       (p) =>
-        (classFilter === ALL || p.programClass === classFilter) &&
-        (text === '' || [p.reference, p.name, p.pi].some((f) => f.toLowerCase().includes(text))),
+        false,
     );
   }, [programs, classFilter, search]);

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:126:25
     return programs.filter(
       (p) =>
         (classFilter === ALL || p.programClass === classFilter) &&
-        (text === '' || [p.reference, p.name, p.pi].some((f) => f.toLowerCase().includes(text))),
+        (text === '' || [p.reference, p.name, p.pi].every(f => f.toLowerCase().includes(text))),
     );
   }, [programs, classFilter, search]);

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:126:58
     return programs.filter(
       (p) =>
         (classFilter === ALL || p.programClass === classFilter) &&
-        (text === '' || [p.reference, p.name, p.pi].some((f) => f.toLowerCase().includes(text))),
+        (text === '' || [p.reference, p.name, p.pi].some(() => undefined)),
     );
   }, [programs, classFilter, search]);

[NoCoverage] EqualityOperator
src/features/programs/ProgramsPage.tsx:132:40
 
   const [programId, setProgramId] = useState<string | null>(null);
   const original = useMemo(
-    () => filteredPrograms.find((p) => p.id === programId) ?? filteredPrograms[0],
+    () => filteredPrograms.find((p) => p.id !== programId) ?? filteredPrograms[0],
     [filteredPrograms, programId],
   );

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:132:40
 
   const [programId, setProgramId] = useState<string | null>(null);
   const original = useMemo(
-    () => filteredPrograms.find((p) => p.id === programId) ?? filteredPrograms[0],
+    () => filteredPrograms.find((p) => false) ?? filteredPrograms[0],
     [filteredPrograms, programId],
   );

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:138:87
 
   const tileControls = (
     <>
-      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={programs.length === 0} />
+      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={false} />
       <Dropdown
         value={classFilter}

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:138:87
 
   const tileControls = (
     <>
-      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={programs.length === 0} />
+      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={true} />
       <Dropdown
         value={classFilter}

[NoCoverage] ObjectLiteral
src/features/programs/ProgramsPage.tsx:142:11
       <Dropdown
         value={classFilter}
         options={[
-          { label: 'All classes', value: ALL },
+          {},
           ...PROGRAM_CLASSES.map((c) => ({ label: PROGRAM_CLASS_LABEL[c], value: c })),
         ]}

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:143:34
         value={classFilter}
         options={[
           { label: 'All classes', value: ALL },
-          ...PROGRAM_CLASSES.map((c) => ({ label: PROGRAM_CLASS_LABEL[c], value: c })),
+          ...PROGRAM_CLASSES.map(() => undefined),
         ]}
         onChange={(e) => setClassFilter(e.value as ProgramClass | typeof ALL)}

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:145:19
           { label: 'All classes', value: ALL },
           ...PROGRAM_CLASSES.map((c) => ({ label: PROGRAM_CLASS_LABEL[c], value: c })),
         ]}
-        onChange={(e) => setClassFilter(e.value as ProgramClass | typeof ALL)}
+        onChange={() => undefined}
         title="Facet the table to Queue or Classical programs only."
       />

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:154:21
         </InputIcon>
         <InputText
           value={search}
-          onChange={(e) => setSearch(e.target.value)}
+          onChange={() => undefined}
           placeholder="Filter reference, PI, or title"
           title="Type to filter the table by program reference, PI, or title."

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:173:30
           dataKey="id"
           selectionMode="single"
           selection={original ?? undefined}
-          onSelectionChange={(e) => setProgramId((e.value as Program | null)?.id ?? null)}
+          onSelectionChange={() => undefined}
           scrollable
           scrollHeight="19rem"

[NoCoverage] StringLiteral
src/features/programs/ProgramsPage.tsx:179:17
           className="programs-table"
           emptyMessage={
             loading
-              ? 'Loading programs…'
+              ? ""
               : error
                 ? friendlyError(error)

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:182:19
               ? 'Loading programs…'
               : error
                 ? friendlyError(error)
-                : programs.length > 0
+                : false
                   ? 'No programs match the filters.'
                   : 'No accepted programs are visible to your role.'

[NoCoverage] EqualityOperator
src/features/programs/ProgramsPage.tsx:182:19
               ? 'Loading programs…'
               : error
                 ? friendlyError(error)
-                : programs.length > 0
+                : programs.length >= 0
                   ? 'No programs match the filters.'
                   : 'No accepted programs are visible to your role.'

[NoCoverage] StringLiteral
src/features/programs/ProgramsPage.tsx:183:21
               : error
                 ? friendlyError(error)
                 : programs.length > 0
-                  ? 'No programs match the filters.'
+                  ? ""
                   : 'No accepted programs are visible to your role.'
           }

[NoCoverage] StringLiteral
src/features/programs/ProgramsPage.tsx:184:21
                 ? friendlyError(error)
                 : programs.length > 0
                   ? 'No programs match the filters.'
-                  : 'No accepted programs are visible to your role.'
+                  : ""
           }
         >

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:199:19
             header="Class"
             sortable
             style={{ width: '8rem' }}
-            body={(p: Program) => PROGRAM_CLASS_LABEL[p.programClass]}
+            body={() => undefined}
             headerTooltip="Queue or Classical, from the proposal type."
           />

[NoCoverage] ObjectLiteral
src/features/programs/ProgramsPage.tsx:207:20
             field="tooStatus"
             header="ToO"
             sortable
-            style={{ width: '7rem' }}
+            style={{}}
             body={(p: Program) => TOO_LABEL[p.tooStatus]}
             headerTooltip="Target-of-Opportunity activation."

[NoCoverage] StringLiteral
src/features/programs/ProgramsPage.tsx:207:29
             field="tooStatus"
             header="ToO"
             sortable
-            style={{ width: '7rem' }}
+            style={{ width: "" }}
             body={(p: Program) => TOO_LABEL[p.tooStatus]}
             headerTooltip="Target-of-Opportunity activation."

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:208:19
             header="ToO"
             sortable
             style={{ width: '7rem' }}
-            body={(p: Program) => TOO_LABEL[p.tooStatus]}
+            body={() => undefined}
             headerTooltip="Target-of-Opportunity activation."
           />

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:215:8
         </DataTable>
       </Tile>
 
-      {original && (
-        <ProgramEditor
-          key={original.id}
-          original={original}
-          saving={saving}
-          onSave={async (draft) => {
-            try {
-              await saveProgram(original, draft);
-              toast.success('Program saved', draft.reference);
-              void refetch();
-            } catch (err) {
-              toast.error('Save failed', friendlyError(err));
-            }
-          }}
-        />
-      )}
+      {true}
     </>
   );

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:215:8
         </DataTable>
       </Tile>
 
-      {original && (
-        <ProgramEditor
-          key={original.id}
-          original={original}
-          saving={saving}
-          onSave={async (draft) => {
-            try {
-              await saveProgram(original, draft);
-              toast.success('Program saved', draft.reference);
-              void refetch();
-            } catch (err) {
-              toast.error('Save failed', friendlyError(err));
-            }
-          }}
-        />
-      )}
+      {false}
     </>
   );

[NoCoverage] BlockStatement
src/features/programs/ProgramsPage.tsx:220:36
           key={original.id}
           original={original}
           saving={saving}
-          onSave={async (draft) => {
-            try {
-              await saveProgram(original, draft);
-              toast.success('Program saved', draft.reference);
-              void refetch();
-            } catch (err) {
-              toast.error('Save failed', friendlyError(err));
-            }
-          }}
+          onSave={async (draft) => {}}
         />
       )}

[NoCoverage] BlockStatement
src/features/programs/ProgramsPage.tsx:221:17
           original={original}
           saving={saving}
           onSave={async (draft) => {
-            try {
-              await saveProgram(original, draft);
-              toast.success('Program saved', draft.reference);
-              void refetch();
-            } catch (err) {
+            try {} catch (err) {
               toast.error('Save failed', friendlyError(err));
             }

[NoCoverage] BlockStatement
src/features/programs/ProgramsPage.tsx:225:27
               await saveProgram(original, draft);
               toast.success('Program saved', draft.reference);
               void refetch();
-            } catch (err) {
-              toast.error('Save failed', friendlyError(err));
-            }
+            } catch (err) {}
           }}
         />

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:248:17
   readonly onSave: (draft: Program) => Promise<void>;
 }): JSX.Element {
   const [draft, setDraft] = useState<Program>(original);
-  const dirty = JSON.stringify(draft) !== JSON.stringify(original);
+  const dirty = true;
 
   function set<K extends keyof Program>(key: K, value: Program[K]): void {

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:248:17
   readonly onSave: (draft: Program) => Promise<void>;
 }): JSX.Element {
   const [draft, setDraft] = useState<Program>(original);
-  const dirty = JSON.stringify(draft) !== JSON.stringify(original);
+  const dirty = false;
 
   function set<K extends keyof Program>(key: K, value: Program[K]): void {

[NoCoverage] BlockStatement
src/features/programs/ProgramsPage.tsx:250:74
   const [draft, setDraft] = useState<Program>(original);
   const dirty = JSON.stringify(draft) !== JSON.stringify(original);
 
-  function set<K extends keyof Program>(key: K, value: Program[K]): void {
-    setDraft((d) => ({ ...d, [key]: value }));
-  }
+  function set<K extends keyof Program>(key: K, value: Program[K]): void {}
 
   // Roster for the contact-scientist type-ahead, from SSO. A failure here

[NoCoverage] BlockStatement
src/features/programs/ProgramsPage.tsx:260:49
   const roster = useMemo(() => (rosterData ? mapRosterUsers(rosterData) : []), [rosterData]);
 
   const [contactSuggestions, setContactSuggestions] = useState<ContactScientist[]>([]);
-  function suggestContacts(query: string): void {
-    const text = query.trim().toLowerCase();
-    const chosen = new Set(draft.contactScientists.map((c) => c.userId));
-    setContactSuggestions(
-      roster
-        .filter((u) => !chosen.has(u.id))
-        .filter((u) => [`${u.givenName} ${u.familyName}`, u.email].some((f) => f.toLowerCase().includes(text)))
-        .slice(0, 8)
-        .map((u) => ({ name: `${u.givenName} ${u.familyName}`, userId: u.id })),
-    );
-  }
+  function suggestContacts(query: string): void {}
 
   return (

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:261:18
 
   const [contactSuggestions, setContactSuggestions] = useState<ContactScientist[]>([]);
   function suggestContacts(query: string): void {
-    const text = query.trim().toLowerCase();
+    const text = query.trim().toUpperCase();
     const chosen = new Set(draft.contactScientists.map((c) => c.userId));
     setContactSuggestions(

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:261:18
 
   const [contactSuggestions, setContactSuggestions] = useState<ContactScientist[]>([]);
   function suggestContacts(query: string): void {
-    const text = query.trim().toLowerCase();
+    const text = query.toLowerCase();
     const chosen = new Set(draft.contactScientists.map((c) => c.userId));
     setContactSuggestions(

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:264:7
     const text = query.trim().toLowerCase();
     const chosen = new Set(draft.contactScientists.map((c) => c.userId));
     setContactSuggestions(
-      roster
-        .filter((u) => !chosen.has(u.id))
-        .filter((u) => [`${u.givenName} ${u.familyName}`, u.email].some((f) => f.toLowerCase().includes(text)))
+      roster.filter(u => !chosen.has(u.id))
         .slice(0, 8)
         .map((u) => ({ name: `${u.givenName} ${u.familyName}`, userId: u.id })),

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:264:7
     const text = query.trim().toLowerCase();
     const chosen = new Set(draft.contactScientists.map((c) => c.userId));
     setContactSuggestions(
-      roster
-        .filter((u) => !chosen.has(u.id))
-        .filter((u) => [`${u.givenName} ${u.familyName}`, u.email].some((f) => f.toLowerCase().includes(text)))
-        .slice(0, 8)
+      roster.filter(u => !chosen.has(u.id)).filter(u => [`${u.givenName} ${u.familyName}`, u.email].some(f => f.toLowerCase().includes(text)))
         .map((u) => ({ name: `${u.givenName} ${u.familyName}`, userId: u.id })),
     );

[NoCoverage] BooleanLiteral
src/features/programs/ProgramsPage.tsx:265:24
     const chosen = new Set(draft.contactScientists.map((c) => c.userId));
     setContactSuggestions(
       roster
-        .filter((u) => !chosen.has(u.id))
+        .filter((u) => chosen.has(u.id))
         .filter((u) => [`${u.givenName} ${u.familyName}`, u.email].some((f) => f.toLowerCase().includes(text)))
         .slice(0, 8)

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:265:17
     const chosen = new Set(draft.contactScientists.map((c) => c.userId));
     setContactSuggestions(
       roster
-        .filter((u) => !chosen.has(u.id))
+        .filter(() => undefined)
         .filter((u) => [`${u.givenName} ${u.familyName}`, u.email].some((f) => f.toLowerCase().includes(text)))
         .slice(0, 8)

[NoCoverage] MethodExpression
src/features/programs/ProgramsPage.tsx:266:24
     setContactSuggestions(
       roster
         .filter((u) => !chosen.has(u.id))
-        .filter((u) => [`${u.givenName} ${u.familyName}`, u.email].some((f) => f.toLowerCase().includes(text)))
+        .filter((u) => [`${u.givenName} ${u.familyName}`, u.email].every(f => f.toLowerCase().includes(text)))
         .slice(0, 8)
         .map((u) => ({ name: `${u.givenName} ${u.familyName}`, userId: u.id })),

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:266:17
     setContactSuggestions(
       roster
         .filter((u) => !chosen.has(u.id))
-        .filter((u) => [`${u.givenName} ${u.familyName}`, u.email].some((f) => f.toLowerCase().includes(text)))
+        .filter(() => undefined)
         .slice(0, 8)
         .map((u) => ({ name: `${u.givenName} ${u.familyName}`, userId: u.id })),

[NoCoverage] StringLiteral
src/features/programs/ProgramsPage.tsx:273:18
   }
 
   return (
-    <Tile title={`Selected Program · ${draft.reference}`}>
+    <Tile title={``}>
       <h2 className="program-title" title="The program's title — display only, not editable here.">
         {draft.name || '(untitled program)'}

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:275:10
   return (
     <Tile title={`Selected Program · ${draft.reference}`}>
       <h2 className="program-title" title="The program's title — display only, not editable here.">
-        {draft.name || '(untitled program)'}
+        {false}
       </h2>
       <div className="program-grid">

[NoCoverage] LogicalOperator
src/features/programs/ProgramsPage.tsx:275:10
   return (
     <Tile title={`Selected Program · ${draft.reference}`}>
       <h2 className="program-title" title="The program's title — display only, not editable here.">
-        {draft.name || '(untitled program)'}
+        {draft.name && '(untitled program)'}
       </h2>
       <div className="program-grid">

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:292:44
             <Dropdown
               inputId="class"
               value={draft.programClass}
-              options={PROGRAM_CLASSES.map((c) => ({ label: PROGRAM_CLASS_LABEL[c], value: c }))}
+              options={PROGRAM_CLASSES.map(() => undefined)}
               onChange={(e) => set('programClass', e.value as ProgramClass)}
             />

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:293:25
               inputId="class"
               value={draft.programClass}
               options={PROGRAM_CLASSES.map((c) => ({ label: PROGRAM_CLASS_LABEL[c], value: c }))}
-              onChange={(e) => set('programClass', e.value as ProgramClass)}
+              onChange={() => undefined}
             />
 

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:305:41
             <Dropdown
               inputId="too"
               value={draft.tooStatus}
-              options={TOO_STATUSES.map((t) => ({ label: TOO_LABEL[t], value: t }))}
+              options={TOO_STATUSES.map(() => undefined)}
               onChange={(e) => set('tooStatus', e.value as ToOActivation)}
               disabled={draft.programClass !== 'QUEUE'}

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:306:25
               inputId="too"
               value={draft.tooStatus}
               options={TOO_STATUSES.map((t) => ({ label: TOO_LABEL[t], value: t }))}
-              onChange={(e) => set('tooStatus', e.value as ToOActivation)}
+              onChange={() => undefined}
               disabled={draft.programClass !== 'QUEUE'}
             />

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:307:25
               value={draft.tooStatus}
               options={TOO_STATUSES.map((t) => ({ label: TOO_LABEL[t], value: t }))}
               onChange={(e) => set('tooStatus', e.value as ToOActivation)}
-              disabled={draft.programClass !== 'QUEUE'}
+              disabled={false}
             />
 
