[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:307:25
               value={draft.tooStatus}
               options={TOO_STATUSES.map((t) => ({ label: TOO_LABEL[t], value: t }))}
               onChange={(e) => set('tooStatus', e.value as ToOActivation)}
-              disabled={draft.programClass !== 'QUEUE'}
+              disabled={true}
             />
 

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:321:31
               multiple
               value={[...draft.contactScientists]}
               suggestions={contactSuggestions}
-              completeMethod={(e) => suggestContacts(e.query)}
+              completeMethod={() => undefined}
               field="name"
               onChange={(e) => set('contactScientists', e.value ?? [])}

[NoCoverage] LogicalOperator
src/features/programs/ProgramsPage.tsx:323:57
               suggestions={contactSuggestions}
               completeMethod={(e) => suggestContacts(e.query)}
               field="name"
-              onChange={(e) => set('contactScientists', e.value ?? [])}
+              onChange={(e) => set('contactScientists', e.value && [])}
               placeholder={draft.contactScientists.length === 0 ? 'Add a contact…' : undefined}
             />

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:323:25
               suggestions={contactSuggestions}
               completeMethod={(e) => suggestContacts(e.query)}
               field="name"
-              onChange={(e) => set('contactScientists', e.value ?? [])}
+              onChange={() => undefined}
               placeholder={draft.contactScientists.length === 0 ? 'Add a contact…' : undefined}
             />

[NoCoverage] EqualityOperator
src/features/programs/ProgramsPage.tsx:324:28
               completeMethod={(e) => suggestContacts(e.query)}
               field="name"
               onChange={(e) => set('contactScientists', e.value ?? [])}
-              placeholder={draft.contactScientists.length === 0 ? 'Add a contact…' : undefined}
+              placeholder={draft.contactScientists.length !== 0 ? 'Add a contact…' : undefined}
             />
 

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:324:28
               completeMethod={(e) => suggestContacts(e.query)}
               field="name"
               onChange={(e) => set('contactScientists', e.value ?? [])}
-              placeholder={draft.contactScientists.length === 0 ? 'Add a contact…' : undefined}
+              placeholder={false ? 'Add a contact…' : undefined}
             />
 

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:372:25
             <Checkbox
               inputId="band3"
               checked={draft.considerForBand3}
-              onChange={(e) => set('considerForBand3', Boolean(e.checked))}
+              onChange={() => undefined}
               disabled={draft.programClass !== 'QUEUE'}
             />

[NoCoverage] EqualityOperator
src/features/programs/ProgramsPage.tsx:373:25
               inputId="band3"
               checked={draft.considerForBand3}
               onChange={(e) => set('considerForBand3', Boolean(e.checked))}
-              disabled={draft.programClass !== 'QUEUE'}
+              disabled={draft.programClass === 'QUEUE'}
             />
 

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:373:25
               inputId="band3"
               checked={draft.considerForBand3}
               onChange={(e) => set('considerForBand3', Boolean(e.checked))}
-              disabled={draft.programClass !== 'QUEUE'}
+              disabled={true}
             />
 

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:388:32
                 value={draft.minPercentTime}
                 min={0}
                 max={100}
-                onValueChange={(e) => set('minPercentTime', e.value ?? 0)}
+                onValueChange={() => undefined}
               />
               <span className="suffix">%</span>

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:407:25
             <Checkbox
               inputId="header"
               checked={draft.privateHeader}
-              onChange={(e) => set('privateHeader', Boolean(e.checked))}
+              onChange={() => undefined}
             />
 

[NoCoverage] EqualityOperator
src/features/programs/ProgramsPage.tsx:414:16
               Thesis
             </label>
             <span className="thesis-list">
-              {draft.thesisInvestigators.length > 0 ? draft.thesisInvestigators.join(', ') : 'None'}
+              {draft.thesisInvestigators.length <= 0 ? draft.thesisInvestigators.join(', ') : 'None'}
             </span>
           </div>

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:414:16
               Thesis
             </label>
             <span className="thesis-list">
-              {draft.thesisInvestigators.length > 0 ? draft.thesisInvestigators.join(', ') : 'None'}
+              {false ? draft.thesisInvestigators.join(', ') : 'None'}
             </span>
           </div>

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:424:69
           >
             Time Awards
           </h2>
-          <TimeAwardsGrid allocations={draft.allocations} onChange={(a) => set('allocations', a)} />
+          <TimeAwardsGrid allocations={draft.allocations} onChange={() => undefined} />
         </div>
 

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:437:23
           <InputTextarea
             className="private-note"
             value={draft.privateNote}
-            onChange={(e) => set('privateNote', e.target.value)}
+            onChange={() => undefined}
             placeholder="Internal note (not visible to the PI)…"
           />

[NoCoverage] ArrowFunction
src/features/programs/ProgramsPage.tsx:447:83
         {/* Wrapped in a title-span so the hint shows even while the button is
             disabled (PrimeReact suppresses tooltips on disabled controls). */}
         <span title={dirty ? 'Discard your unsaved edits and revert to the loaded values.' : 'No changes to discard.'}>
-          <Button text label="Cancel" icon={<XMark />} disabled={!dirty} onClick={() => setDraft(original)} />
+          <Button text label="Cancel" icon={<XMark />} disabled={!dirty} onClick={() => undefined} />
         </span>
         <span

[NoCoverage] BooleanLiteral
src/features/programs/ProgramsPage.tsx:447:66
         {/* Wrapped in a title-span so the hint shows even while the button is
             disabled (PrimeReact suppresses tooltips on disabled controls). */}
         <span title={dirty ? 'Discard your unsaved edits and revert to the loaded values.' : 'No changes to discard.'}>
-          <Button text label="Cancel" icon={<XMark />} disabled={!dirty} onClick={() => setDraft(original)} />
+          <Button text label="Cancel" icon={<XMark />} disabled={dirty} onClick={() => setDraft(original)} />
         </span>
         <span

[NoCoverage] ConditionalExpression
src/features/programs/ProgramsPage.tsx:459:23
           <Button
             label="Save"
             icon={<Upload />}
-            disabled={!dirty || saving}
+            disabled={true}
             loading={saving}
             onClick={() => void onSave(draft)}
