[Killed] ArrowFunction
src/features/proposals/ProposalsPage.tsx:28:33
 type ReviewProposal = Proposal & ReviewItem;
 
 const COLUMNS: ReviewColumn<ReviewProposal>[] = [
-  { header: 'Reference', value: (p) => p.reference, width: '12rem' },
+  { header: 'Reference', value: () => undefined, width: '12rem' },
   { header: 'Semester', value: (p) => p.semester, width: '7rem' },
   { header: 'PI', value: (p) => p.pi, width: '13rem' },
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByRole('cell', { name: 'G-2027B-0042' })

<body>
  
  


  <div>

[Survived] ArrowFunction
src/features/proposals/ProposalsPage.tsx:29:32
 
 const COLUMNS: ReviewColumn<ReviewProposal>[] = [
   { header: 'Reference', value: (p) => p.reference, width: '12rem' },
-  { header: 'Semester', value: (p) => p.semester, width: '7rem' },
+  { header: 'Semester', value: () => undefined, width: '7rem' },
   { header: 'PI', value: (p) => p.pi, width: '13rem' },
   { header: 'Type', value: (p) => SPECIAL_PROPOSAL_TYPE_LABEL[p.type], width: '12rem' },

[Killed] ArrowFunction
src/features/proposals/ProposalsPage.tsx:30:26
 const COLUMNS: ReviewColumn<ReviewProposal>[] = [
   { header: 'Reference', value: (p) => p.reference, width: '12rem' },
   { header: 'Semester', value: (p) => p.semester, width: '7rem' },
-  { header: 'PI', value: (p) => p.pi, width: '13rem' },
+  { header: 'PI', value: () => undefined, width: '13rem' },
   { header: 'Type', value: (p) => SPECIAL_PROPOSAL_TYPE_LABEL[p.type], width: '12rem' },
   { header: 'Status', value: (p) => p.status, width: '11rem' },
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByRole('cell', { name: 'Grace Hopper' })

<body>
  
  


  <div>

[Survived] ArrowFunction
src/features/proposals/ProposalsPage.tsx:31:28
   { header: 'Reference', value: (p) => p.reference, width: '12rem' },
   { header: 'Semester', value: (p) => p.semester, width: '7rem' },
   { header: 'PI', value: (p) => p.pi, width: '13rem' },
-  { header: 'Type', value: (p) => SPECIAL_PROPOSAL_TYPE_LABEL[p.type], width: '12rem' },
+  { header: 'Type', value: () => undefined, width: '12rem' },
   { header: 'Status', value: (p) => p.status, width: '11rem' },
   { header: 'Title', value: (p) => p.title },

[Survived] StringLiteral
src/features/proposals/ProposalsPage.tsx:31:79
   { header: 'Reference', value: (p) => p.reference, width: '12rem' },
   { header: 'Semester', value: (p) => p.semester, width: '7rem' },
   { header: 'PI', value: (p) => p.pi, width: '13rem' },
-  { header: 'Type', value: (p) => SPECIAL_PROPOSAL_TYPE_LABEL[p.type], width: '12rem' },
+  { header: 'Type', value: (p) => SPECIAL_PROPOSAL_TYPE_LABEL[p.type], width: "" },
   { header: 'Status', value: (p) => p.status, width: '11rem' },
   { header: 'Title', value: (p) => p.title },

[Survived] ArrowFunction
src/features/proposals/ProposalsPage.tsx:32:30
   { header: 'Semester', value: (p) => p.semester, width: '7rem' },
   { header: 'PI', value: (p) => p.pi, width: '13rem' },
   { header: 'Type', value: (p) => SPECIAL_PROPOSAL_TYPE_LABEL[p.type], width: '12rem' },
-  { header: 'Status', value: (p) => p.status, width: '11rem' },
+  { header: 'Status', value: () => undefined, width: '11rem' },
   { header: 'Title', value: (p) => p.title },
 ];

[Survived] ArrowFunction
src/features/proposals/ProposalsPage.tsx:33:29
   { header: 'PI', value: (p) => p.pi, width: '13rem' },
   { header: 'Type', value: (p) => SPECIAL_PROPOSAL_TYPE_LABEL[p.type], width: '12rem' },
   { header: 'Status', value: (p) => p.status, width: '11rem' },
-  { header: 'Title', value: (p) => p.title },
+  { header: 'Title', value: () => undefined },
 ];
 

[Killed] StringLiteral
src/features/proposals/ProposalsPage.tsx:33:13
   { header: 'PI', value: (p) => p.pi, width: '13rem' },
   { header: 'Type', value: (p) => SPECIAL_PROPOSAL_TYPE_LABEL[p.type], width: '12rem' },
   { header: 'Status', value: (p) => p.status, width: '11rem' },
-  { header: 'Title', value: (p) => p.title },
+  { header: "", value: (p) => p.title },
 ];
 
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByText('Title', { exact: true })

<body>
  
  


  <div>

[Killed] StringLiteral
src/features/proposals/ProposalsPage.tsx:40:13
 
 /** "Show everything" sentinel for the facet dropdowns (a real string — see the
  *  Change Requests view for why null option values misbehave in PrimeReact). */
-const ALL = 'ALL';
+const ALL = "";
 
 const STATUS_OPTIONS: { label: string; value: ProposalStatus | typeof ALL }[] = [
killedBy: ProposalsPage offers status / type / semester facet dropdowns instead of a resolved toggle
statusReason: Cannot find element with locator: page.getByText('All statuses').first()

<body>
  
  


  <div>

[Killed] StringLiteral
src/features/proposals/ProposalsPage.tsx:43:12
 const ALL = 'ALL';
 
 const STATUS_OPTIONS: { label: string; value: ProposalStatus | typeof ALL }[] = [
-  { label: 'All statuses', value: ALL },
+  { label: "", value: ALL },
   { label: 'Submitted', value: 'SUBMITTED' },
   { label: 'Accepted', value: 'ACCEPTED' },
killedBy: ProposalsPage offers status / type / semester facet dropdowns instead of a resolved toggle
statusReason: Cannot find element with locator: page.getByText('All statuses').first()

<body>
  
  


  <div>

[Survived] StringLiteral
src/features/proposals/ProposalsPage.tsx:63:16
 
 const BLANK_AWARD: AwardDraft = {
   allocations: [],
-  activeStart: '',
+  activeStart: "Stryker was here!",
   activeEnd: '',
   proprietaryMonths: 12,

[Survived] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:83:21
   const [setProposalStatus, { loading: settingStatus }] = useSetProposalStatus();
   const [setAllocations, { loading: settingAllocations }] = useSetAllocations();
   const [updateProgram, { loading: updatingProgram }] = useUpdateProgram();
-  const resolving = settingStatus || settingAllocations || updatingProgram;
+  const resolving = true;
 
   const [statusFilter, setStatusFilter] = useState<ProposalStatus | typeof ALL>(ALL);

[Survived] LogicalOperator
src/features/proposals/ProposalsPage.tsx:83:21
   const [setProposalStatus, { loading: settingStatus }] = useSetProposalStatus();
   const [setAllocations, { loading: settingAllocations }] = useSetAllocations();
   const [updateProgram, { loading: updatingProgram }] = useUpdateProgram();
-  const resolving = settingStatus || settingAllocations || updatingProgram;
+  const resolving = (settingStatus || settingAllocations) && updatingProgram;
 
   const [statusFilter, setStatusFilter] = useState<ProposalStatus | typeof ALL>(ALL);

[Survived] MethodExpression
src/features/proposals/ProposalsPage.tsx:92:7
   // A proposal is "resolved" once its status is a decided one.
   const items: ReviewProposal[] = useMemo(
     () =>
-      proposals
-        .filter(
-          (p) =>
-            (statusFilter === ALL || p.status === statusFilter) &&
-            (typeFilter === ALL || p.type === typeFilter) &&
-            (semesterFilter === ALL || p.semester === semesterFilter),
-        )
+      proposals
         .map((p) => ({ ...p, resolved: p.status === 'ACCEPTED' || p.status === 'NOT_ACCEPTED' })),
     [proposals, statusFilter, typeFilter, semesterFilter],

[Killed] ArrowFunction
src/features/proposals/ProposalsPage.tsx:94:11
     () =>
       proposals
         .filter(
-          (p) =>
-            (statusFilter === ALL || p.status === statusFilter) &&
-            (typeFilter === ALL || p.type === typeFilter) &&
-            (semesterFilter === ALL || p.semester === semesterFilter),
+          () => undefined,
         )
         .map((p) => ({ ...p, resolved: p.status === 'ACCEPTED' || p.status === 'NOT_ACCEPTED' })),
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByRole('cell', { name: 'G-2027B-0042' })

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:95:14
       proposals
         .filter(
           (p) =>
-            (statusFilter === ALL || p.status === statusFilter) &&
+            (false || p.status === statusFilter) &&
             (typeFilter === ALL || p.type === typeFilter) &&
             (semesterFilter === ALL || p.semester === semesterFilter),
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByRole('cell', { name: 'G-2027B-0042' })

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:95:13
       proposals
         .filter(
           (p) =>
-            (statusFilter === ALL || p.status === statusFilter) &&
-            (typeFilter === ALL || p.type === typeFilter) &&
-            (semesterFilter === ALL || p.semester === semesterFilter),
+            false,
         )
         .map((p) => ({ ...p, resolved: p.status === 'ACCEPTED' || p.status === 'NOT_ACCEPTED' })),
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByRole('cell', { name: 'G-2027B-0042' })

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:96:14
         .filter(
           (p) =>
             (statusFilter === ALL || p.status === statusFilter) &&
-            (typeFilter === ALL || p.type === typeFilter) &&
+            (false || p.type === typeFilter) &&
             (semesterFilter === ALL || p.semester === semesterFilter),
         )
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByRole('cell', { name: 'G-2027B-0042' })

<body>
  
  


  <div>

[NoCoverage] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:96:36
         .filter(
           (p) =>
             (statusFilter === ALL || p.status === statusFilter) &&
-            (typeFilter === ALL || p.type === typeFilter) &&
+            (typeFilter === ALL || false) &&
             (semesterFilter === ALL || p.semester === semesterFilter),
         )

[Killed] LogicalOperator
src/features/proposals/ProposalsPage.tsx:97:14
           (p) =>
             (statusFilter === ALL || p.status === statusFilter) &&
             (typeFilter === ALL || p.type === typeFilter) &&
-            (semesterFilter === ALL || p.semester === semesterFilter),
+            (semesterFilter === ALL && p.semester === semesterFilter),
         )
         .map((p) => ({ ...p, resolved: p.status === 'ACCEPTED' || p.status === 'NOT_ACCEPTED' })),
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByRole('cell', { name: 'G-2027B-0042' })

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:97:14
           (p) =>
             (statusFilter === ALL || p.status === statusFilter) &&
             (typeFilter === ALL || p.type === typeFilter) &&
-            (semesterFilter === ALL || p.semester === semesterFilter),
+            (false || p.semester === semesterFilter),
         )
         .map((p) => ({ ...p, resolved: p.status === 'ACCEPTED' || p.status === 'NOT_ACCEPTED' })),
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByRole('cell', { name: 'G-2027B-0042' })

<body>
  
  


  <div>

[Survived] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:99:40
             (typeFilter === ALL || p.type === typeFilter) &&
             (semesterFilter === ALL || p.semester === semesterFilter),
         )
-        .map((p) => ({ ...p, resolved: p.status === 'ACCEPTED' || p.status === 'NOT_ACCEPTED' })),
+        .map((p) => ({ ...p, resolved: false })),
     [proposals, statusFilter, typeFilter, semesterFilter],
   );

[Survived] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:99:40
             (typeFilter === ALL || p.type === typeFilter) &&
             (semesterFilter === ALL || p.semester === semesterFilter),
         )
-        .map((p) => ({ ...p, resolved: p.status === 'ACCEPTED' || p.status === 'NOT_ACCEPTED' })),
+        .map((p) => ({ ...p, resolved: false || p.status === 'NOT_ACCEPTED' })),
     [proposals, statusFilter, typeFilter, semesterFilter],
   );

[Timeout] ArrayDeclaration
src/features/proposals/ProposalsPage.tsx:100:5
             (semesterFilter === ALL || p.semester === semesterFilter),
         )
         .map((p) => ({ ...p, resolved: p.status === 'ACCEPTED' || p.status === 'NOT_ACCEPTED' })),
-    [proposals, statusFilter, typeFilter, semesterFilter],
+    [],
   );
   const semesters = useMemo(() => Array.from(new Set(proposals.map((p) => p.semester))).sort(), [proposals]);

[Survived] ArrowFunction
src/features/proposals/ProposalsPage.tsx:102:68
         .map((p) => ({ ...p, resolved: p.status === 'ACCEPTED' || p.status === 'NOT_ACCEPTED' })),
     [proposals, statusFilter, typeFilter, semesterFilter],
   );
-  const semesters = useMemo(() => Array.from(new Set(proposals.map((p) => p.semester))).sort(), [proposals]);
+  const semesters = useMemo(() => Array.from(new Set(proposals.map(() => undefined))).sort(), [proposals]);
 
   // The award being drafted per proposal (keyed by program id). State, and

[Survived] MethodExpression
src/features/proposals/ProposalsPage.tsx:102:35
         .map((p) => ({ ...p, resolved: p.status === 'ACCEPTED' || p.status === 'NOT_ACCEPTED' })),
     [proposals, statusFilter, typeFilter, semesterFilter],
   );
-  const semesters = useMemo(() => Array.from(new Set(proposals.map((p) => p.semester))).sort(), [proposals]);
+  const semesters = useMemo(() => Array.from(new Set(proposals.map(p => p.semester))), [proposals]);
 
   // The award being drafted per proposal (keyed by program id). State, and

[NoCoverage] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:111:12
   const [awards, setAwards] = useState<ReadonlyMap<string, AwardDraft>>(new Map());
 
   function boilerplate(p: ReviewProposal, decision: Decision): string {
-    return decision === 'ACCEPT'
+    return false
       : `Dear ${p.pi},\n\nAfter review, your ${SPECIAL_PROPOSAL_TYPE_LABEL[p.type]} proposal "${p.title}" (${p.reference}) has not been accepted at this time.\n\nRegards,\nGemini Science Operations`;

[NoCoverage] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:111:12
   const [awards, setAwards] = useState<ReadonlyMap<string, AwardDraft>>(new Map());
 
   function boilerplate(p: ReviewProposal, decision: Decision): string {
-    return decision === 'ACCEPT'
+    return true
       : `Dear ${p.pi},\n\nAfter review, your ${SPECIAL_PROPOSAL_TYPE_LABEL[p.type]} proposal "${p.title}" (${p.reference}) has not been accepted at this time.\n\nRegards,\nGemini Science Operations`;

[NoCoverage] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:121:11
    *  updatePrograms. Returns true when everything landed. */
   async function onResolve(p: ReviewProposal, decision: Decision): Promise<boolean> {
     try {
-      if (decision === 'ACCEPT') {
+      if (false) {
         const award = awards.get(p.id) ?? BLANK_AWARD;
         const allocations = allocationsInput(award.allocations);

[NoCoverage] EqualityOperator
src/features/proposals/ProposalsPage.tsx:121:11
    *  updatePrograms. Returns true when everything landed. */
   async function onResolve(p: ReviewProposal, decision: Decision): Promise<boolean> {
     try {
-      if (decision === 'ACCEPT') {
+      if (decision !== 'ACCEPT') {
         const award = awards.get(p.id) ?? BLANK_AWARD;
         const allocations = allocationsInput(award.allocations);

[NoCoverage] ObjectLiteral
src/features/proposals/ProposalsPage.tsx:125:16
         const award = awards.get(p.id) ?? BLANK_AWARD;
         const allocations = allocationsInput(award.allocations);
         const SET: ProgramPropertiesInput = {
-          goa: { proprietaryMonths: award.proprietaryMonths },
+          goa: {},
           ...(award.activeStart ? { activeStart: award.activeStart } : {}),
           ...(award.activeEnd ? { activeEnd: award.activeEnd } : {}),

[NoCoverage] ObjectLiteral
src/features/proposals/ProposalsPage.tsx:127:33
         const SET: ProgramPropertiesInput = {
           goa: { proprietaryMonths: award.proprietaryMonths },
           ...(award.activeStart ? { activeStart: award.activeStart } : {}),
-          ...(award.activeEnd ? { activeEnd: award.activeEnd } : {}),
+          ...(award.activeEnd ? {} : {}),
         };
         // Status first — it validates the proposal is decidable before any

[NoCoverage] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:132:13
         // Status first — it validates the proposal is decidable before any
         // program properties are touched.
         await setProposalStatus({ variables: { programId: p.id, status: 'ACCEPTED' } });
-        if (allocations.length > 0) {
+        if (true) {
           await setAllocations({ variables: { programId: p.id, allocations } });
         }

[NoCoverage] EqualityOperator
src/features/proposals/ProposalsPage.tsx:132:13
         // Status first — it validates the proposal is decidable before any
         // program properties are touched.
         await setProposalStatus({ variables: { programId: p.id, status: 'ACCEPTED' } });
-        if (allocations.length > 0) {
+        if (allocations.length <= 0) {
           await setAllocations({ variables: { programId: p.id, allocations } });
         }

[NoCoverage] BlockStatement
src/features/proposals/ProposalsPage.tsx:137:14
         }
         await updateProgram({ variables: { programId: p.id, SET } });
         toast.success('Proposal accepted', p.reference);
-      } else {
-        await setProposalStatus({ variables: { programId: p.id, status: 'NOT_ACCEPTED' } });
-        toast.success('Proposal rejected', p.reference);
-      }
+      } else {}
       void refetch();
       return true;

[NoCoverage] BooleanLiteral
src/features/proposals/ProposalsPage.tsx:142:14
         toast.success('Proposal rejected', p.reference);
       }
       void refetch();
-      return true;
+      return false;
     } catch (err) {
       toast.error('Resolve failed', friendlyError(err));

[NoCoverage] BooleanLiteral
src/features/proposals/ProposalsPage.tsx:145:14
       return true;
     } catch (err) {
       toast.error('Resolve failed', friendlyError(err));
-      return false;
+      return true;
     }
   }

[Survived] ArrowFunction
src/features/proposals/ProposalsPage.tsx:154:19
       <Dropdown
         value={statusFilter}
         options={STATUS_OPTIONS}
-        onChange={(e) => setStatusFilter(e.value as ProposalStatus | typeof ALL)}
+        onChange={() => undefined}
         title="Facet by proposal status — e.g. just the Submitted ones awaiting a decision."
       />

[Killed] StringLiteral
src/features/proposals/ProposalsPage.tsx:160:20
       <Dropdown
         value={typeFilter}
         options={[
-          { label: 'All types', value: ALL },
+          { label: "", value: ALL },
           ...Object.entries(SPECIAL_PROPOSAL_TYPE_LABEL).map(([value, label]) => ({ label, value })),
         ]}
killedBy: ProposalsPage offers status / type / semester facet dropdowns instead of a resolved toggle
statusReason: Cannot find element with locator: page.getByText('All types').first()

<body>
  
  


  <div>

[Killed] ObjectLiteral
src/features/proposals/ProposalsPage.tsx:160:11
       <Dropdown
         value={typeFilter}
         options={[
-          { label: 'All types', value: ALL },
+          {},
           ...Object.entries(SPECIAL_PROPOSAL_TYPE_LABEL).map(([value, label]) => ({ label, value })),
         ]}
killedBy: ProposalsPage offers status / type / semester facet dropdowns instead of a resolved toggle
statusReason: Cannot find element with locator: page.getByText('All types').first()

<body>
  
  


  <div>

[Killed] ArrowFunction
src/features/proposals/ProposalsPage.tsx:161:62
         value={typeFilter}
         options={[
           { label: 'All types', value: ALL },
-          ...Object.entries(SPECIAL_PROPOSAL_TYPE_LABEL).map(([value, label]) => ({ label, value })),
+          ...Object.entries(SPECIAL_PROPOSAL_TYPE_LABEL).map(() => undefined),
         ]}
         onChange={(e) => setTypeFilter(e.value as SpecialProposalType | typeof ALL)}
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot read properties of undefined (reading 'style')

[Survived] ArrowFunction
src/features/proposals/ProposalsPage.tsx:163:19
           { label: 'All types', value: ALL },
           ...Object.entries(SPECIAL_PROPOSAL_TYPE_LABEL).map(([value, label]) => ({ label, value })),
         ]}
-        onChange={(e) => setTypeFilter(e.value as SpecialProposalType | typeof ALL)}
+        onChange={() => undefined}
         title="Facet by proposal type — Director's Time or Poor Weather."
       />

[Killed] ArrowFunction
src/features/proposals/ProposalsPage.tsx:168:76
       />
       <Dropdown
         value={semesterFilter}
-        options={[{ label: 'All semesters', value: ALL }, ...semesters.map((s) => ({ label: s, value: s }))]}
+        options={[{ label: 'All semesters', value: ALL }, ...semesters.map(() => undefined)]}
         onChange={(e) => setSemesterFilter(e.value as string)}
         title="Facet by the semester in the proposal reference."
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByRole('cell', { name: 'G-2027B-0042' })

<body>
  
  


  <div />

[Killed] ObjectLiteral
src/features/proposals/ProposalsPage.tsx:168:19
       />
       <Dropdown
         value={semesterFilter}
-        options={[{ label: 'All semesters', value: ALL }, ...semesters.map((s) => ({ label: s, value: s }))]}
+        options={[{}, ...semesters.map((s) => ({ label: s, value: s }))]}
         onChange={(e) => setSemesterFilter(e.value as string)}
         title="Facet by the semester in the proposal reference."
killedBy: ProposalsPage offers status / type / semester facet dropdowns instead of a resolved toggle
statusReason: Cannot find element with locator: page.getByText('All semesters').first()

<body>
  
  


  <div>

[Survived] ArrowFunction
src/features/proposals/ProposalsPage.tsx:169:19
       <Dropdown
         value={semesterFilter}
         options={[{ label: 'All semesters', value: ALL }, ...semesters.map((s) => ({ label: s, value: s }))]}
-        onChange={(e) => setSemesterFilter(e.value as string)}
+        onChange={() => undefined}
         title="Facet by the semester in the proposal reference."
       />

[Survived] EqualityOperator
src/features/proposals/ProposalsPage.tsx:179:94
     <ReviewView<ReviewProposal>
       title="Proposals"
       blurb="Review & respond to Director’s Time and Poor Weather proposals."
-      badge={<DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={items.length === 0} />}
+      badge={<DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={items.length !== 0} />}
       controls={controls}
       resolving={resolving}

[Survived] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:179:94
     <ReviewView<ReviewProposal>
       title="Proposals"
       blurb="Review & respond to Director’s Time and Poor Weather proposals."
-      badge={<DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={items.length === 0} />}
+      badge={<DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={true} />}
       controls={controls}
       resolving={resolving}

[Survived] ArrowFunction
src/features/proposals/ProposalsPage.tsx:187:21
       noun="proposal"
       resolveMutation="setProposalStatus + setAllocations + updatePrograms"
       detailTitle={(p) => `${p.reference} · ${p.pi}`}
-      renderDetail={(p) => (
-        <>
-          <dl>
-            <dt>Reference</dt>
-            <dd>{p.reference}</dd>
-            <dt>PI</dt>
-            <dd>{p.pi}</dd>
-            <dt>Type</dt>
-            <dd>{SPECIAL_PROPOSAL_TYPE_LABEL[p.type]}</dd>
-          </dl>
-          <p className="review-abstract">{p.abstract}</p>
-        </>
-      )}
+      renderDetail={() => undefined}
       renderExtra={(p, decision) =>
         decision === 'ACCEPT' && (

[Survived] ArrowFunction
src/features/proposals/ProposalsPage.tsx:200:20
           <p className="review-abstract">{p.abstract}</p>
         </>
       )}
-      renderExtra={(p, decision) =>
-        decision === 'ACCEPT' && (
-          <AwardForm
-            key={p.id}
-            requestedHours={p.observations.reduce((s, o) => s + o.hours, 0)}
-            award={awards.get(p.id) ?? BLANK_AWARD}
-            onChange={(award) => setAwards((prev) => new Map(prev).set(p.id, award))}
-          />
-        )
+      renderExtra={() => undefined
       }
       boilerplate={boilerplate}

[Survived] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:201:9
         </>
       )}
       renderExtra={(p, decision) =>
-        decision === 'ACCEPT' && (
-          <AwardForm
-            key={p.id}
-            requestedHours={p.observations.reduce((s, o) => s + o.hours, 0)}
-            award={awards.get(p.id) ?? BLANK_AWARD}
-            onChange={(award) => setAwards((prev) => new Map(prev).set(p.id, award))}
-          />
-        )
+        false
       }
       boilerplate={boilerplate}

[Survived] ConditionalExpression
src/features/proposals/ProposalsPage.tsx:201:9
         </>
       )}
       renderExtra={(p, decision) =>
-        decision === 'ACCEPT' && (
-          <AwardForm
-            key={p.id}
-            requestedHours={p.observations.reduce((s, o) => s + o.hours, 0)}
-            award={awards.get(p.id) ?? BLANK_AWARD}
-            onChange={(award) => setAwards((prev) => new Map(prev).set(p.id, award))}
-          />
-        )
+        true
       }
       boilerplate={boilerplate}

[NoCoverage] ArithmeticOperator
src/features/proposals/ProposalsPage.tsx:204:61
         decision === 'ACCEPT' && (
           <AwardForm
             key={p.id}
-            requestedHours={p.observations.reduce((s, o) => s + o.hours, 0)}
+            requestedHours={p.observations.reduce((s, o) => s - o.hours, 0)}
             award={awards.get(p.id) ?? BLANK_AWARD}
             onChange={(award) => setAwards((prev) => new Map(prev).set(p.id, award))}

[NoCoverage] ArrowFunction
src/features/proposals/ProposalsPage.tsx:206:23
             key={p.id}
             requestedHours={p.observations.reduce((s, o) => s + o.hours, 0)}
             award={awards.get(p.id) ?? BLANK_AWARD}
-            onChange={(award) => setAwards((prev) => new Map(prev).set(p.id, award))}
+            onChange={() => undefined}
           />
         )

[NoCoverage] BlockStatement
src/features/proposals/ProposalsPage.tsx:229:53
   readonly award: AwardDraft;
   readonly onChange: (award: AwardDraft) => void;
 }): JSX.Element {
-  function update(patch: Partial<AwardDraft>): void {
-    onChange({ ...award, ...patch });
-  }
+  function update(patch: Partial<AwardDraft>): void {}
 
   const awarded = award.allocations.reduce((s, a) => s + a.hours, 0);

[NoCoverage] ArithmeticOperator
src/features/proposals/ProposalsPage.tsx:233:54
     onChange({ ...award, ...patch });
   }
 
-  const awarded = award.allocations.reduce((s, a) => s + a.hours, 0);
+  const awarded = award.allocations.reduce((s, a) => s - a.hours, 0);
 
   return (

[NoCoverage] ArrowFunction
src/features/proposals/ProposalsPage.tsx:241:65
       <p className="decision-hint">
         {requestedHours.toFixed(1)} hours requested · {awarded.toFixed(1)} awarded — enter each partner’s award by band.
       </p>
-      <TimeAwardsGrid allocations={award.allocations} onChange={(a) => update({ allocations: a })} />
+      <TimeAwardsGrid allocations={award.allocations} onChange={() => undefined} />
 
       <dl className="decision-fields">

[NoCoverage] ObjectLiteral
src/features/proposals/ProposalsPage.tsx:241:79
       <p className="decision-hint">
         {requestedHours.toFixed(1)} hours requested · {awarded.toFixed(1)} awarded — enter each partner’s award by band.
       </p>
-      <TimeAwardsGrid allocations={award.allocations} onChange={(a) => update({ allocations: a })} />
+      <TimeAwardsGrid allocations={award.allocations} onChange={(a) => update({})} />
 
       <dl className="decision-fields">

[NoCoverage] ArrowFunction
src/features/proposals/ProposalsPage.tsx:254:23
             id="award-start"
             value={award.activeStart}
             placeholder="YYYY-MM-DD"
-            onChange={(e) => update({ activeStart: e.target.value })}
+            onChange={() => undefined}
           />
           <span>–</span>

[NoCoverage] ArrowFunction
src/features/proposals/ProposalsPage.tsx:260:23
           <InputText
             value={award.activeEnd}
             placeholder="YYYY-MM-DD"
-            onChange={(e) => update({ activeEnd: e.target.value })}
+            onChange={() => undefined}
           />
         </dd>

[NoCoverage] ArrowFunction
src/features/proposals/ProposalsPage.tsx:275:28
             min={0}
             max={36}
             suffix=" months"
-            onValueChange={(e) => update({ proprietaryMonths: e.value ?? 0 })}
+            onValueChange={() => undefined}
           />
         </dd>
