[NoCoverage] ArrowFunction
src/features/proposals/ProposalsPage.tsx:290:23
           <Chips
             inputId="award-contacts"
             value={[...award.contactScientists]}
-            onChange={(e) => update({ contactScientists: e.value ?? [] })}
+            onChange={() => undefined}
             placeholder="Add a contact…"
           />

[NoCoverage] ArrayDeclaration
src/features/proposals/ProposalsPage.tsx:290:69
           <Chips
             inputId="award-contacts"
             value={[...award.contactScientists]}
-            onChange={(e) => update({ contactScientists: e.value ?? [] })}
+            onChange={(e) => update({ contactScientists: e.value ?? ["Stryker was here"] })}
             placeholder="Add a contact…"
           />
