[NoCoverage] BooleanLiteral
src/features/review/ReviewView.tsx:81:17
     blurb,
     badge,
     controls,
-    resolving = false,
+    resolving = true,
     items,
     columns,

[Survived] MethodExpression
src/features/review/ReviewView.tsx:93:24
     resolveMutation,
   } = props;
 
-  const nounTitle = `${noun[0]!.toUpperCase()}${noun.slice(1)}`;
+  const nounTitle = `${noun[0]!.toLowerCase()}${noun.slice(1)}`;
   const visible = items;
   const [selectedId, setSelectedId] = useState<string | null>(null);

[Survived] MethodExpression
src/features/review/ReviewView.tsx:93:49
     resolveMutation,
   } = props;
 
-  const nounTitle = `${noun[0]!.toUpperCase()}${noun.slice(1)}`;
+  const nounTitle = `${noun[0]!.toUpperCase()}${noun}`;
   const visible = items;
   const [selectedId, setSelectedId] = useState<string | null>(null);

[Survived] ArrowFunction
src/features/review/ReviewView.tsx:96:33
   const nounTitle = `${noun[0]!.toUpperCase()}${noun.slice(1)}`;
   const visible = items;
   const [selectedId, setSelectedId] = useState<string | null>(null);
-  const selected = visible.find((i) => i.id === selectedId) ?? visible[0] ?? null;
+  const selected = visible.find(() => undefined) ?? visible[0] ?? null;
 
   const [decision, setDecision] = useState<Decision | null>(null);

[Survived] EqualityOperator
src/features/review/ReviewView.tsx:96:40
   const nounTitle = `${noun[0]!.toUpperCase()}${noun.slice(1)}`;
   const visible = items;
   const [selectedId, setSelectedId] = useState<string | null>(null);
-  const selected = visible.find((i) => i.id === selectedId) ?? visible[0] ?? null;
+  const selected = visible.find((i) => i.id !== selectedId) ?? visible[0] ?? null;
 
   const [decision, setDecision] = useState<Decision | null>(null);

[NoCoverage] BlockStatement
src/features/review/ReviewView.tsx:103:44
 
   /** Select an item, clearing any in-progress decision/response from the
    *  previously selected one (they belong to that item, not the new one). */
-  function select(id: string | null): void {
-    setSelectedId(id);
-    setDecision(null);
-    setResponse('');
-  }
+  function select(id: string | null): void {}
 
   /** Pick accept/reject and seed the response box with boilerplate. */

[NoCoverage] StringLiteral
src/features/review/ReviewView.tsx:106:17
   function select(id: string | null): void {
     setSelectedId(id);
     setDecision(null);
-    setResponse('');
+    setResponse("Stryker was here!");
   }
 

[NoCoverage] BlockStatement
src/features/review/ReviewView.tsx:110:50
   }
 
   /** Pick accept/reject and seed the response box with boilerplate. */
-  function choose(item: T, next: Decision): void {
-    setDecision(next);
-    setResponse(boilerplate(item, next));
-  }
+  function choose(item: T, next: Decision): void {}
 
   function resolve(item: T): void {

[NoCoverage] BlockStatement
src/features/review/ReviewView.tsx:115:35
     setResponse(boilerplate(item, next));
   }
 
-  function resolve(item: T): void {
-    if (!decision) return;
-    void onResolve(item, decision, response).then((ok) => {
-      if (ok) {
-        setDecision(null);
-        setResponse('');
-      }
-    });
-  }
+  function resolve(item: T): void {}
 
   const listControls = (

[NoCoverage] BlockStatement
src/features/review/ReviewView.tsx:117:59
 
   function resolve(item: T): void {
     if (!decision) return;
-    void onResolve(item, decision, response).then((ok) => {
-      if (ok) {
-        setDecision(null);
-        setResponse('');
-      }
-    });
+    void onResolve(item, decision, response).then((ok) => {});
   }
 

[NoCoverage] ConditionalExpression
src/features/review/ReviewView.tsx:118:11
   function resolve(item: T): void {
     if (!decision) return;
     void onResolve(item, decision, response).then((ok) => {
-      if (ok) {
+      if (false) {
         setDecision(null);
         setResponse('');

[NoCoverage] BlockStatement
src/features/review/ReviewView.tsx:118:15
   function resolve(item: T): void {
     if (!decision) return;
     void onResolve(item, decision, response).then((ok) => {
-      if (ok) {
-        setDecision(null);
-        setResponse('');
-      }
+      if (ok) {}
     });
   }

[Survived] LogicalOperator
src/features/review/ReviewView.tsx:140:22
           value={visible as T[]}
           dataKey="id"
           selectionMode="single"
-          selection={selected ?? undefined}
+          selection={selected && undefined}
           onSelectionChange={(e) => select((e.value as T | null)?.id ?? null)}
           emptyMessage={`No ${noun}s match the filters.`}

[Survived] ArrowFunction
src/features/review/ReviewView.tsx:141:30
           dataKey="id"
           selectionMode="single"
           selection={selected ?? undefined}
-          onSelectionChange={(e) => select((e.value as T | null)?.id ?? null)}
+          onSelectionChange={() => undefined}
           emptyMessage={`No ${noun}s match the filters.`}
           className="review-table"

[Survived] StringLiteral
src/features/review/ReviewView.tsx:142:25
           selectionMode="single"
           selection={selected ?? undefined}
           onSelectionChange={(e) => select((e.value as T | null)?.id ?? null)}
-          emptyMessage={`No ${noun}s match the filters.`}
+          emptyMessage={``}
           className="review-table"
         >

[Killed] ArrowFunction
src/features/review/ReviewView.tsx:145:24
           emptyMessage={`No ${noun}s match the filters.`}
           className="review-table"
         >
-          {columns.map((col) => (
-            <Column
-              key={col.header}
-              header={col.header}
-              headerTooltip={col.headerTooltip ?? `Click a row to review and respond to that ${noun}.`}
-              body={(row: T) => col.value(row)}
-              style={col.width ? { width: col.width } : undefined}
-            />
-          ))}
+          {columns.map(() => undefined)}
         </DataTable>
       </Tile>
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByText('Semester', { exact: true })

<body>
  
  


  <div>

[Survived] LogicalOperator
src/features/review/ReviewView.tsx:149:30
             <Column
               key={col.header}
               header={col.header}
-              headerTooltip={col.headerTooltip ?? `Click a row to review and respond to that ${noun}.`}
+              headerTooltip={col.headerTooltip && `Click a row to review and respond to that ${noun}.`}
               body={(row: T) => col.value(row)}
               style={col.width ? { width: col.width } : undefined}

[Killed] ArrowFunction
src/features/review/ReviewView.tsx:150:21
               key={col.header}
               header={col.header}
               headerTooltip={col.headerTooltip ?? `Click a row to review and respond to that ${noun}.`}
-              body={(row: T) => col.value(row)}
+              body={() => undefined}
               style={col.width ? { width: col.width } : undefined}
             />
killedBy: ProposalsPage lists special proposals with the master-list columns
statusReason: Cannot find element with locator: page.getByRole('cell', { name: 'G-2027B-0042' })

<body>
  
  


  <div>

[Survived] ObjectLiteral
src/features/review/ReviewView.tsx:151:34
               header={col.header}
               headerTooltip={col.headerTooltip ?? `Click a row to review and respond to that ${noun}.`}
               body={(row: T) => col.value(row)}
-              style={col.width ? { width: col.width } : undefined}
+              style={col.width ? {} : undefined}
             />
           ))}

[Survived] StringLiteral
src/features/review/ReviewView.tsx:161:51
         <Tile title={detailTitle(selected)}>
           <div className="review-detail-body">{renderDetail(selected)}</div>
 
-          <h3 className="review-obs-title" title={`The observations attached to this ${noun}.`}>
+          <h3 className="review-obs-title" title={``}>
             Observations
           </h3>

[Survived] ArrowFunction
src/features/review/ReviewView.tsx:182:21
               field="hours"
               header="Time"
               headerTooltip="Time requested for this observation."
-              body={(o: ObservationRow) => `${o.hours} h`}
+              body={() => undefined}
               style={{ width: '5rem' }}
             />

[NoCoverage] StringLiteral
src/features/review/ReviewView.tsx:182:44
               field="hours"
               header="Time"
               headerTooltip="Time requested for this observation."
-              body={(o: ObservationRow) => `${o.hours} h`}
+              body={(o: ObservationRow) => ``}
               style={{ width: '5rem' }}
             />

[Survived] StringLiteral
src/features/review/ReviewView.tsx:189:31
               field="config"
               header="Config"
               headerTooltip="The instrument and observing mode requested (Observation.observingMode)."
-              style={{ width: '11rem' }}
+              style={{ width: "" }}
             />
             <Column

[Survived] StringLiteral
src/features/review/ReviewView.tsx:200:20
           </DataTable>
 
           <ConflictsTable
-            title={`Potential Conflicts of this ${nounTitle}’s Observations`}
+            title={``}
             sources={selected.observations.map((o) => ({ ...o, programId: selected.id }))}
           />

[Survived] BooleanLiteral
src/features/review/ReviewView.tsx:211:12
 
           {renderExtra?.(selected, decision)}
 
-          {!selected.resolved && (
+          {selected.resolved && (
             <div className="review-respond">
               <div className="review-decision">

[Survived] ConditionalExpression
src/features/review/ReviewView.tsx:218:29
                   label="Accept"
                   icon={<Check />}
                   severity="success"
-                  outlined={decision !== 'ACCEPT'}
+                  outlined={true}
                   tooltip={`Mark this ${noun} for acceptance and seed an approval response to the PI below.`}
                   tooltipOptions={{ position: 'top' }}

[Survived] EqualityOperator
src/features/review/ReviewView.tsx:218:29
                   label="Accept"
                   icon={<Check />}
                   severity="success"
-                  outlined={decision !== 'ACCEPT'}
+                  outlined={decision === 'ACCEPT'}
                   tooltip={`Mark this ${noun} for acceptance and seed an approval response to the PI below.`}
                   tooltipOptions={{ position: 'top' }}

[Survived] ArrowFunction
src/features/review/ReviewView.tsx:221:28
                   outlined={decision !== 'ACCEPT'}
                   tooltip={`Mark this ${noun} for acceptance and seed an approval response to the PI below.`}
                   tooltipOptions={{ position: 'top' }}
-                  onClick={() => choose(selected, 'ACCEPT')}
+                  onClick={() => undefined}
                 />
                 <Button

[Survived] EqualityOperator
src/features/review/ReviewView.tsx:227:29
                   label="Reject"
                   icon={<XMark />}
                   severity="danger"
-                  outlined={decision !== 'REJECT'}
+                  outlined={decision === 'REJECT'}
                   tooltip={`Mark this ${noun} for rejection and seed a decline response to the PI below.`}
                   tooltipOptions={{ position: 'top' }}

[Survived] ConditionalExpression
src/features/review/ReviewView.tsx:227:29
                   label="Reject"
                   icon={<XMark />}
                   severity="danger"
-                  outlined={decision !== 'REJECT'}
+                  outlined={false}
                   tooltip={`Mark this ${noun} for rejection and seed a decline response to the PI below.`}
                   tooltipOptions={{ position: 'top' }}

[Survived] ObjectLiteral
src/features/review/ReviewView.tsx:229:35
                   severity="danger"
                   outlined={decision !== 'REJECT'}
                   tooltip={`Mark this ${noun} for rejection and seed a decline response to the PI below.`}
-                  tooltipOptions={{ position: 'top' }}
+                  tooltipOptions={{}}
                   onClick={() => choose(selected, 'REJECT')}
                 />

[Survived] ArrowFunction
src/features/review/ReviewView.tsx:230:28
                   outlined={decision !== 'REJECT'}
                   tooltip={`Mark this ${noun} for rejection and seed a decline response to the PI below.`}
                   tooltipOptions={{ position: 'top' }}
-                  onClick={() => choose(selected, 'REJECT')}
+                  onClick={() => undefined}
                 />
               </div>

[Survived] BooleanLiteral
src/features/review/ReviewView.tsx:235:50
               </div>
 
               <InputTextarea
-                className={cn('review-response', !decision && 'is-disabled')}
+                className={cn('review-response', decision && 'is-disabled')}
                 rows={5}
                 placeholder="Choose accept or reject to seed a response to the PI…"

[Survived] ConditionalExpression
src/features/review/ReviewView.tsx:235:50
               </div>
 
               <InputTextarea
-                className={cn('review-response', !decision && 'is-disabled')}
+                className={cn('review-response', false)}
                 rows={5}
                 placeholder="Choose accept or reject to seed a response to the PI…"

[Survived] ArrowFunction
src/features/review/ReviewView.tsx:241:27
                 value={response}
                 disabled={!decision}
                 title="The message sent to the PI. Pre-filled with boilerplate from your accept/reject choice; edit freely before resolving."
-                onChange={(e) => setResponse(e.target.value)}
+                onChange={() => undefined}
               />
 

[Survived] ConditionalExpression
src/features/review/ReviewView.tsx:256:31
                   <Button
                     label="Resolve"
                     icon={<PaperPlane />}
-                    disabled={!decision || resolving}
+                    disabled={false}
                     loading={resolving}
                     onClick={() => resolve(selected)}

[Survived] LogicalOperator
src/features/review/ReviewView.tsx:256:31
                   <Button
                     label="Resolve"
                     icon={<PaperPlane />}
-                    disabled={!decision || resolving}
+                    disabled={!decision && resolving}
                     loading={resolving}
                     onClick={() => resolve(selected)}

[Survived] ArrowFunction
src/features/review/ReviewView.tsx:258:30
                     icon={<PaperPlane />}
                     disabled={!decision || resolving}
                     loading={resolving}
-                    onClick={() => resolve(selected)}
+                    onClick={() => undefined}
                   />
                 </span>

[Survived] ConditionalExpression
src/features/review/ReviewView.tsx:265:12
             </div>
           )}
 
-          {selected.resolved && (
-            <p className="review-resolved-note">
-              <CircleCheck /> This {noun} has been resolved.
-            </p>
-          )}
+          {false}
         </Tile>
       )}

[Survived] ConditionalExpression
src/features/review/ReviewView.tsx:265:12
             </div>
           )}
 
-          {selected.resolved && (
-            <p className="review-resolved-note">
-              <CircleCheck /> This {noun} has been resolved.
-            </p>
-          )}
+          {true}
         </Tile>
       )}
