[Killed] ConditionalExpression
src/features/users/UsersPage.tsx:30:33
 
 /** Does the user currently hold this role? NGO roles must match the partner. */
 function hasRole(user: RosterUser, type: RoleType, partner?: Partner): boolean {
-  return user.roles.some((r) => r.type === type && r.partner === partner);
+  return user.roles.some((r) => false);
 }
 
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: Cannot find element with locator: page.getByText('Staffer')

<body>
  
  


  <div>

[Killed] EqualityOperator
src/features/users/UsersPage.tsx:30:33
 
 /** Does the user currently hold this role? NGO roles must match the partner. */
 function hasRole(user: RosterUser, type: RoleType, partner?: Partner): boolean {
-  return user.roles.some((r) => r.type === type && r.partner === partner);
+  return user.roles.some((r) => r.type !== type && r.partner === partner);
 }
 
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: Cannot find element with locator: page.getByText('Staffer')

<body>
  
  


  <div>

[Killed] EqualityOperator
src/features/users/UsersPage.tsx:39:76
   readonly partner?: Partner;
 }
 
-const sameRole = (a: RoleKey | null, b: RoleKey): boolean => a !== null && a.type === b.type && a.partner === b.partner;
+const sameRole = (a: RoleKey | null, b: RoleKey): boolean => a !== null && a.type !== b.type && a.partner === b.partner;
 
 /**
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: Cannot find element with locator: page.getByText('Plain')

<body>
  
  


  <div>

[Killed] ConditionalExpression
src/features/users/UsersPage.tsx:39:62
   readonly partner?: Partner;
 }
 
-const sameRole = (a: RoleKey | null, b: RoleKey): boolean => a !== null && a.type === b.type && a.partner === b.partner;
+const sameRole = (a: RoleKey | null, b: RoleKey): boolean => true;
 
 /**
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-p-cell-editing="false"
  data-p-editable-column="true"
  data-p-frozen-column="false"
  data-p-selectable-cell="false"
  data-p-selection-column="false"

[Killed] StringLiteral
src/features/users/UsersPage.tsx:57:52
   const users = useMemo(() => (data ? mapRosterUsers(data) : []), [data]);
   const [addRole] = useAddRole();
   const [deleteRole] = useDeleteRole();
-  const [globalFilter, setGlobalFilter] = useState('');
+  const [globalFilter, setGlobalFilter] = useState("Stryker was here!");
   const [roleFilter, setRoleFilter] = useState<RoleKey | null>(null);
 
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: Cannot find element with locator: page.getByText('Staffer')

<body>
  
  


  <div>

[Survived] MethodExpression
src/features/users/UsersPage.tsx:63:18
   // Filtering happens here rather than via DataTable's `filters` so it composes
   // with the role facet and stays compatible with the scroller.
   const visibleUsers = useMemo(() => {
-    const text = globalFilter.trim().toLowerCase();
+    const text = globalFilter.trim().toUpperCase();
     return users.filter((u) => {
       if (roleFilter && !hasRole(u, roleFilter.type, roleFilter.partner)) return false;

[Survived] MethodExpression
src/features/users/UsersPage.tsx:63:18
   // Filtering happens here rather than via DataTable's `filters` so it composes
   // with the role facet and stays compatible with the scroller.
   const visibleUsers = useMemo(() => {
-    const text = globalFilter.trim().toLowerCase();
+    const text = globalFilter.toLowerCase();
     return users.filter((u) => {
       if (roleFilter && !hasRole(u, roleFilter.type, roleFilter.partner)) return false;

[Killed] BlockStatement
src/features/users/UsersPage.tsx:64:32
   // with the role facet and stays compatible with the scroller.
   const visibleUsers = useMemo(() => {
     const text = globalFilter.trim().toLowerCase();
-    return users.filter((u) => {
-      if (roleFilter && !hasRole(u, roleFilter.type, roleFilter.partner)) return false;
-      if (text === '') return true;
-      return [u.givenName, u.familyName, u.email, u.orcidId].some((f) => f.toLowerCase().includes(text));
-    });
+    return users.filter((u) => {});
   }, [users, globalFilter, roleFilter]);
 
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: Cannot find element with locator: page.getByText('Staffer')

<body>
  
  


  <div>

[Killed] MethodExpression
src/features/users/UsersPage.tsx:64:12
   // with the role facet and stays compatible with the scroller.
   const visibleUsers = useMemo(() => {
     const text = globalFilter.trim().toLowerCase();
-    return users.filter((u) => {
-      if (roleFilter && !hasRole(u, roleFilter.type, roleFilter.partner)) return false;
-      if (text === '') return true;
-      return [u.givenName, u.familyName, u.email, u.orcidId].some((f) => f.toLowerCase().includes(text));
-    });
+    return users;
   }, [users, globalFilter, roleFilter]);
 
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-p-cell-editing="false"
  data-p-editable-column="true"
  data-p-frozen-column="false"
  data-p-selectable-cell="false"
  data-p-selection-column="false"

[Killed] ConditionalExpression
src/features/users/UsersPage.tsx:65:11
   const visibleUsers = useMemo(() => {
     const text = globalFilter.trim().toLowerCase();
     return users.filter((u) => {
-      if (roleFilter && !hasRole(u, roleFilter.type, roleFilter.partner)) return false;
+      if (false) return false;
       if (text === '') return true;
       return [u.givenName, u.familyName, u.email, u.orcidId].some((f) => f.toLowerCase().includes(text));
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-p-cell-editing="false"
  data-p-editable-column="true"
  data-p-frozen-column="false"
  data-p-selectable-cell="false"
  data-p-selection-column="false"

[Killed] BooleanLiteral
src/features/users/UsersPage.tsx:65:25
   const visibleUsers = useMemo(() => {
     const text = globalFilter.trim().toLowerCase();
     return users.filter((u) => {
-      if (roleFilter && !hasRole(u, roleFilter.type, roleFilter.partner)) return false;
+      if (roleFilter && hasRole(u, roleFilter.type, roleFilter.partner)) return false;
       if (text === '') return true;
       return [u.givenName, u.familyName, u.email, u.orcidId].some((f) => f.toLowerCase().includes(text));
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: Cannot find element with locator: page.getByText('Staffer')

<body>
  
  


  <div>

[Killed] BooleanLiteral
src/features/users/UsersPage.tsx:66:31
     const text = globalFilter.trim().toLowerCase();
     return users.filter((u) => {
       if (roleFilter && !hasRole(u, roleFilter.type, roleFilter.partner)) return false;
-      if (text === '') return true;
+      if (text === '') return false;
       return [u.givenName, u.familyName, u.email, u.orcidId].some((f) => f.toLowerCase().includes(text));
     });
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: Cannot find element with locator: page.getByText('Staffer')

<body>
  
  


  <div>

[Survived] ConditionalExpression
src/features/users/UsersPage.tsx:66:11
     const text = globalFilter.trim().toLowerCase();
     return users.filter((u) => {
       if (roleFilter && !hasRole(u, roleFilter.type, roleFilter.partner)) return false;
-      if (text === '') return true;
+      if (false) return true;
       return [u.givenName, u.familyName, u.email, u.orcidId].some((f) => f.toLowerCase().includes(text));
     });

[NoCoverage] MethodExpression
src/features/users/UsersPage.tsx:67:74
     return users.filter((u) => {
       if (roleFilter && !hasRole(u, roleFilter.type, roleFilter.partner)) return false;
       if (text === '') return true;
-      return [u.givenName, u.familyName, u.email, u.orcidId].some((f) => f.toLowerCase().includes(text));
+      return [u.givenName, u.familyName, u.email, u.orcidId].some((f) => f.toUpperCase().includes(text));
     });
   }, [users, globalFilter, roleFilter]);

[NoCoverage] ArrowFunction
src/features/users/UsersPage.tsx:67:67
     return users.filter((u) => {
       if (roleFilter && !hasRole(u, roleFilter.type, roleFilter.partner)) return false;
       if (text === '') return true;
-      return [u.givenName, u.familyName, u.email, u.orcidId].some((f) => f.toLowerCase().includes(text));
+      return [u.givenName, u.familyName, u.email, u.orcidId].some(() => undefined);
     });
   }, [users, globalFilter, roleFilter]);

[NoCoverage] BlockStatement
src/features/users/UsersPage.tsx:74:94
   /** Grant a role via `addRole`. The mutation refetches the roster, so the
    *  new role (with the RoleId the same checkbox needs to revoke it) is on
    *  screen before this resolves. */
-  async function grantRole(userId: string, type: RoleType, partner?: Partner): Promise<void> {
-    const target = users.find((u) => u.id === userId);
-    if (!target) return;
-    const label = `${type}${partner ? `, ${partner}` : ''}`;
-    try {
-      await addRole({ variables: { userId, roleType: type, partner: partner ?? null } });
-      toast.success('Role granted', `${target.givenName} ${target.familyName} — ${label}`);
-    } catch (err) {
-      toast.error('Grant failed', friendlyError(err));
-    }
-  }
+  async function grantRole(userId: string, type: RoleType, partner?: Partner): Promise<void> {}
 
   /** Revoke a role via `deleteRole` (sc-8978). SSO also deletes the role's

[NoCoverage] ArrowFunction
src/features/users/UsersPage.tsx:75:31
    *  new role (with the RoleId the same checkbox needs to revoke it) is on
    *  screen before this resolves. */
   async function grantRole(userId: string, type: RoleType, partner?: Partner): Promise<void> {
-    const target = users.find((u) => u.id === userId);
+    const target = users.find(() => undefined);
     if (!target) return;
     const label = `${type}${partner ? `, ${partner}` : ''}`;

[NoCoverage] ConditionalExpression
src/features/users/UsersPage.tsx:75:38
    *  new role (with the RoleId the same checkbox needs to revoke it) is on
    *  screen before this resolves. */
   async function grantRole(userId: string, type: RoleType, partner?: Partner): Promise<void> {
-    const target = users.find((u) => u.id === userId);
+    const target = users.find((u) => true);
     if (!target) return;
     const label = `${type}${partner ? `, ${partner}` : ''}`;

[NoCoverage] StringLiteral
src/features/users/UsersPage.tsx:77:19
   async function grantRole(userId: string, type: RoleType, partner?: Partner): Promise<void> {
     const target = users.find((u) => u.id === userId);
     if (!target) return;
-    const label = `${type}${partner ? `, ${partner}` : ''}`;
+    const label = ``;
     try {
       await addRole({ variables: { userId, roleType: type, partner: partner ?? null } });

[NoCoverage] StringLiteral
src/features/users/UsersPage.tsx:77:39
   async function grantRole(userId: string, type: RoleType, partner?: Partner): Promise<void> {
     const target = users.find((u) => u.id === userId);
     if (!target) return;
-    const label = `${type}${partner ? `, ${partner}` : ''}`;
+    const label = `${type}${partner ? `` : ''}`;
     try {
       await addRole({ variables: { userId, roleType: type, partner: partner ?? null } });

[NoCoverage] BlockStatement
src/features/users/UsersPage.tsx:78:9
     const target = users.find((u) => u.id === userId);
     if (!target) return;
     const label = `${type}${partner ? `, ${partner}` : ''}`;
-    try {
-      await addRole({ variables: { userId, roleType: type, partner: partner ?? null } });
-      toast.success('Role granted', `${target.givenName} ${target.familyName} — ${label}`);
-    } catch (err) {
+    try {} catch (err) {
       toast.error('Grant failed', friendlyError(err));
     }

[NoCoverage] LogicalOperator
src/features/users/UsersPage.tsx:79:69
     if (!target) return;
     const label = `${type}${partner ? `, ${partner}` : ''}`;
     try {
-      await addRole({ variables: { userId, roleType: type, partner: partner ?? null } });
+      await addRole({ variables: { userId, roleType: type, partner: partner && null } });
       toast.success('Role granted', `${target.givenName} ${target.familyName} — ${label}`);
     } catch (err) {

[NoCoverage] BlockStatement
src/features/users/UsersPage.tsx:81:19
     try {
       await addRole({ variables: { userId, roleType: type, partner: partner ?? null } });
       toast.success('Role granted', `${target.givenName} ${target.familyName} — ${label}`);
-    } catch (err) {
-      toast.error('Grant failed', friendlyError(err));
-    }
+    } catch (err) {}
   }
 

[NoCoverage] BlockStatement
src/features/users/UsersPage.tsx:88:91
 
   /** Revoke a role via `deleteRole` (sc-8978). SSO also deletes the role's
    *  sessions, so a signed-in holder loses it on their next token renewal. */
-  async function revokeRole(userId: string, roleId: string, label: string): Promise<void> {
-    const target = users.find((u) => u.id === userId);
-    if (!target) return;
-    try {
-      await deleteRole({ variables: { roleId } });
-      toast.success('Role revoked', `${target.givenName} ${target.familyName} — ${label}`);
-    } catch (err) {
-      toast.error('Revoke failed', friendlyError(err));
-    }
-  }
+  async function revokeRole(userId: string, roleId: string, label: string): Promise<void> {}
 
   function roleColumnBody(type: RoleType, partner?: Partner) {

[NoCoverage] EqualityOperator
src/features/users/UsersPage.tsx:89:38
   /** Revoke a role via `deleteRole` (sc-8978). SSO also deletes the role's
    *  sessions, so a signed-in holder loses it on their next token renewal. */
   async function revokeRole(userId: string, roleId: string, label: string): Promise<void> {
-    const target = users.find((u) => u.id === userId);
+    const target = users.find((u) => u.id !== userId);
     if (!target) return;
     try {

[NoCoverage] ConditionalExpression
src/features/users/UsersPage.tsx:89:38
   /** Revoke a role via `deleteRole` (sc-8978). SSO also deletes the role's
    *  sessions, so a signed-in holder loses it on their next token renewal. */
   async function revokeRole(userId: string, roleId: string, label: string): Promise<void> {
-    const target = users.find((u) => u.id === userId);
+    const target = users.find((u) => false);
     if (!target) return;
     try {

[NoCoverage] BlockStatement
src/features/users/UsersPage.tsx:91:9
   async function revokeRole(userId: string, roleId: string, label: string): Promise<void> {
     const target = users.find((u) => u.id === userId);
     if (!target) return;
-    try {
-      await deleteRole({ variables: { roleId } });
-      toast.success('Role revoked', `${target.givenName} ${target.familyName} — ${label}`);
-    } catch (err) {
+    try {} catch (err) {
       toast.error('Revoke failed', friendlyError(err));
     }

[NoCoverage] BlockStatement
src/features/users/UsersPage.tsx:94:19
     try {
       await deleteRole({ variables: { roleId } });
       toast.success('Role revoked', `${target.givenName} ${target.familyName} — ${label}`);
-    } catch (err) {
-      toast.error('Revoke failed', friendlyError(err));
-    }
+    } catch (err) {}
   }
 

[Survived] ArrowFunction
src/features/users/UsersPage.tsx:103:36
     const label = partner ? `${type} for ${partner}` : type;
     // A PrimeReact column body render function (called per row), not a component.
     return function roleCell(user: RosterUser): JSX.Element {
-      const held = user.roles.find((r) => r.type === type && r.partner === partner);
+      const held = user.roles.find(() => undefined);
       return (
         <span

[Survived] EqualityOperator
src/features/users/UsersPage.tsx:103:43
     const label = partner ? `${type} for ${partner}` : type;
     // A PrimeReact column body render function (called per row), not a component.
     return function roleCell(user: RosterUser): JSX.Element {
-      const held = user.roles.find((r) => r.type === type && r.partner === partner);
+      const held = user.roles.find((r) => r.type !== type && r.partner === partner);
       return (
         <span

[Survived] ConditionalExpression
src/features/users/UsersPage.tsx:113:22
           }
         >
           <Checkbox
-            checked={held !== undefined}
+            checked={false}
             onChange={() => void (held ? revokeRole(user.id, held.id, label) : grantRole(user.id, type, partner))}
           />

[Survived] ConditionalExpression
src/features/users/UsersPage.tsx:113:22
           }
         >
           <Checkbox
-            checked={held !== undefined}
+            checked={true}
             onChange={() => void (held ? revokeRole(user.id, held.id, label) : grantRole(user.id, type, partner))}
           />

[Survived] ArrowFunction
src/features/users/UsersPage.tsx:114:23
         >
           <Checkbox
             checked={held !== undefined}
-            onChange={() => void (held ? revokeRole(user.id, held.id, label) : grantRole(user.id, type, partner))}
+            onChange={() => undefined}
           />
         </span>

[Survived] StringLiteral
src/features/users/UsersPage.tsx:127:20
     return (
       <button
         type="button"
-        className={`users-role-facet${active ? 'users-role-facet-active' : ''}`}
+        className={``}
         title={
           active

[Survived] StringLiteral
src/features/users/UsersPage.tsx:127:48
     return (
       <button
         type="button"
-        className={`users-role-facet${active ? 'users-role-facet-active' : ''}`}
+        className={`users-role-facet${active ? "" : ''}`}
         title={
           active

[Survived] StringLiteral
src/features/users/UsersPage.tsx:130:15
         className={`users-role-facet${active ? 'users-role-facet-active' : ''}`}
         title={
           active
-            ? `Showing only ${describe} holders — click to show everyone again.`
+            ? ``
             : `${describe}. Click to show only users who hold it.`
         }

[Killed] ArrowFunction
src/features/users/UsersPage.tsx:133:18
             ? `Showing only ${describe} holders — click to show everyone again.`
             : `${describe}. Click to show only users who hold it.`
         }
-        onClick={() => setRoleFilter(active ? null : key)}
+        onClick={() => undefined}
       >
         {label}
killedBy: UsersPage facets to holders of a role when its column header is clicked, and back
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-p-cell-editing="false"
  data-p-editable-column="true"
  data-p-frozen-column="false"
  data-p-selectable-cell="false"
  data-p-selection-column="false"

[Survived] ConditionalExpression
src/features/users/UsersPage.tsx:142:87
 
   const controls = (
     <>
-      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={users.length === 0} />
+      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={true} />
       <span className="users-count" title="Users shown / users loaded from SSO.">
         {visibleUsers.length}/{users.length}

[Survived] ConditionalExpression
src/features/users/UsersPage.tsx:142:87
 
   const controls = (
     <>
-      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={users.length === 0} />
+      <DataSourceBadge loading={loading} error={error && friendlyError(error)} empty={false} />
       <span className="users-count" title="Users shown / users loaded from SSO.">
         {visibleUsers.length}/{users.length}

[Survived] ArrowFunction
src/features/users/UsersPage.tsx:152:21
         </InputIcon>
         <InputText
           value={globalFilter}
-          onChange={(e) => setGlobalFilter(e.target.value)}
+          onChange={() => undefined}
           placeholder="Filter name, email, or ORCiD"
           title="Type to filter the table by name, email, or ORCiD (matches any of them)."

[Survived] ConditionalExpression
src/features/users/UsersPage.tsx:172:17
             ? 'Loading users…'
             : error
               ? friendlyError(error)
-              : users.length > 0
+              : true
                 ? 'No users match the filters.'
                 : 'No users found.'

[Survived] ConditionalExpression
src/features/users/UsersPage.tsx:172:17
             ? 'Loading users…'
             : error
               ? friendlyError(error)
-              : users.length > 0
+              : false
                 ? 'No users match the filters.'
                 : 'No users found.'

[Killed] ArrowFunction
src/features/users/UsersPage.tsx:205:23
           style={{ minWidth: '12rem' }}
         />
 
-        {PARTNERS.map((p) => (
-          <Column
-            key={p}
-            header={roleColumnHeader(p, { type: 'NGO', partner: p }, `NGO role for ${PARTNER_NAME[p]} (${p})`)}
-            dataType="boolean"
-            align="center"
-            body={roleColumnBody('NGO', p)}
-            style={{ width: '3.5rem' }}
-          />
-        ))}
+        {PARTNERS.map(() => undefined)}
         <Column
           header={roleColumnHeader('Staff', { type: 'STAFF' }, 'Gemini staff role')}
killedBy: UsersPage renders the role-assignment grid with a column per partner + Staff/Adm
statusReason: Cannot find element with locator: page.getByText('AR', { exact: true })

<body>
  
  


  <div>

[Survived] ObjectLiteral
src/features/users/UsersPage.tsx:212:20
             dataType="boolean"
             align="center"
             body={roleColumnBody('NGO', p)}
-            style={{ width: '3.5rem' }}
+            style={{}}
           />
         ))}

[Survived] StringLiteral
src/features/users/UsersPage.tsx:220:27
           dataType="boolean"
           align="center"
           body={roleColumnBody('STAFF')}
-          style={{ width: '4rem' }}
+          style={{ width: "" }}
         />
         <Column

[Killed] StringLiteral
src/features/users/UsersPage.tsx:223:36
           style={{ width: '4rem' }}
         />
         <Column
-          header={roleColumnHeader('Adm', { type: 'ADMIN' }, 'Admin role')}
+          header={roleColumnHeader("", { type: 'ADMIN' }, 'Admin role')}
           dataType="boolean"
           align="center"
killedBy: UsersPage renders the role-assignment grid with a column per partner + Staff/Adm
statusReason: Cannot find element with locator: page.getByRole('button', { name: 'Adm', exact: true })

<body>
  
  


  <div>

[Survived] ObjectLiteral
src/features/users/UsersPage.tsx:227:18
           dataType="boolean"
           align="center"
           body={roleColumnBody('ADMIN')}
-          style={{ width: '4rem' }}
+          style={{}}
         />
       </DataTable>
