[NoCoverage] StringLiteral
src/gql/ApolloConfigs.ts:27:55
   // Apollo types operation context values as `any`; pin the headers shape.
   const prevHeaders = (prevContext.headers ?? {}) as Record<string, string>;
   return {
-    headers: token ? { ...prevHeaders, Authorization: `Bearer ${token}` } : prevHeaders,
+    headers: token ? { ...prevHeaders, Authorization: `` } : prevHeaders,
   };
 });

[NoCoverage] ObjectLiteral
src/gql/ApolloConfigs.ts:27:22
   // Apollo types operation context values as `any`; pin the headers shape.
   const prevHeaders = (prevContext.headers ?? {}) as Record<string, string>;
   return {
-    headers: token ? { ...prevHeaders, Authorization: `Bearer ${token}` } : prevHeaders,
+    headers: token ? {} : prevHeaders,
   };
 });

[NoCoverage] ConditionalExpression
src/gql/ApolloConfigs.ts:32:18
 });
 
 const endpointLink = ApolloLink.split(
-  (operation) => operation.getContext().clientName === 'sso',
+  (operation) => false,
   new HttpLink({ uri: withAbsoluteUri(CURRENT_ENV.ssoGraphqlUri) }),
   new HttpLink({ uri: withAbsoluteUri(CURRENT_ENV.odbUri) }),

[NoCoverage] EqualityOperator
src/gql/ApolloConfigs.ts:32:18
 });
 
 const endpointLink = ApolloLink.split(
-  (operation) => operation.getContext().clientName === 'sso',
+  (operation) => operation.getContext().clientName !== 'sso',
   new HttpLink({ uri: withAbsoluteUri(CURRENT_ENV.ssoGraphqlUri) }),
   new HttpLink({ uri: withAbsoluteUri(CURRENT_ENV.odbUri) }),

[NoCoverage] ObjectLiteral
src/gql/ApolloConfigs.ts:38:20
 );
 
 export const client = new ApolloClient({
-  clientAwareness: {
-    name: 'admin-ui',
-    version: import.meta.env.FRONTEND_VERSION,
-  },
+  clientAwareness: {},
   link: authLink.concat(endpointLink),
   cache: new InMemoryCache(),

[NoCoverage] StringLiteral
src/gql/ApolloConfigs.ts:39:11
 
 export const client = new ApolloClient({
   clientAwareness: {
-    name: 'admin-ui',
+    name: "",
     version: import.meta.env.FRONTEND_VERSION,
   },
