[NoCoverage] ObjectLiteral
src/gql/cfp.ts:84:31
 
 /** The calls list — cached rows render immediately, refreshed in background. */
 export function useCfps() {
-  return useQuery(CFPS_QUERY, { fetchPolicy: 'cache-and-network' });
+  return useQuery(CFPS_QUERY, {});
 }
 

[Killed] ConditionalExpression
src/gql/cfp.ts:96:101
   return raw.callsForProposals.matches.flatMap((c) => {
     const gemini = c.gemini;
     if (!gemini) return [];
-    const partnerDeadlines = c.partners.map((p) => p.submissionDeadline).filter((d): d is string => d !== null);
+    const partnerDeadlines = c.partners.map((p) => p.submissionDeadline).filter((d): d is string => false);
     const otherDeadlines = gemini.allowsNonPartnerPi && gemini.nonPartnerDeadline ? [gemini.nonPartnerDeadline] : [];
     return [
killedBy: mapCfps is open while today is before the latest partner deadline, closed once all have passed
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/gql/cfp.ts:96:101
   return raw.callsForProposals.matches.flatMap((c) => {
     const gemini = c.gemini;
     if (!gemini) return [];
-    const partnerDeadlines = c.partners.map((p) => p.submissionDeadline).filter((d): d is string => d !== null);
+    const partnerDeadlines = c.partners.map((p) => p.submissionDeadline).filter((d): d is string => d === null);
     const otherDeadlines = gemini.allowsNonPartnerPi && gemini.nonPartnerDeadline ? [gemini.nonPartnerDeadline] : [];
     return [
killedBy: mapCfps is open while today is before the latest partner deadline, closed once all have passed
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/gql/cfp.ts:116:22
         south: mapCoordinateLimits(gemini.coordinateLimits.south),
         // Enum values, not display labels — the editor checklist compares these
         // against the schema's Instrument enum (labels are render-time only).
-        instruments: [...gemini.instruments],
+        instruments: [],
         // Every participating partner, whether or not it overrides the default
         // deadline.
killedBy: mapCfps projects a Gemini call, keeping instrument enum values and every partner
statusReason: expected [] to deeply equal [ 'GMOS_NORTH', 'GMOS_SOUTH', …(2) ]

[NoCoverage] BooleanLiteral
src/gql/cfp.ts:158:96
 `);
 
 export function useUpdateCfp() {
-  return useMutation(UPDATE_CFP_MUTATION, { refetchQueries: [CFPS_QUERY], awaitRefetchQueries: true });
+  return useMutation(UPDATE_CFP_MUTATION, { refetchQueries: [CFPS_QUERY], awaitRefetchQueries: false });
 }
 

[NoCoverage] BooleanLiteral
src/gql/cfp.ts:162:96
 }
 
 export function useCreateCfp() {
-  return useMutation(CREATE_CFP_MUTATION, { refetchQueries: [CFPS_QUERY], awaitRefetchQueries: true });
+  return useMutation(CREATE_CFP_MUTATION, { refetchQueries: [CFPS_QUERY], awaitRefetchQueries: false });
 }
 

[Killed] ObjectLiteral
src/gql/cfp.ts:170:10
  *  field. `allowsNonPartnerPi` is derived by the ODB from the call type and is
  *  deliberately absent. */
 export function cfpPropertiesInput(c: CallForProposals): CallForProposalsPropertiesInput {
-  return {
-    semester: c.semester,
-    ...(c.title.trim() === '' ? {} : { title: c.title.trim() }),
-    activeStart: c.activeStart,
-    activeEnd: c.activeEnd,
-    ...(c.defaultDeadline.trim() === '' ? {} : { submissionDeadlineDefault: c.defaultDeadline.trim() }),
-    partners: c.partners.map((p) => ({
-      geminiPartner: p.partner,
-      ...(p.deadlineOverride ? { submissionDeadlineOverride: p.deadlineOverride } : {}),
-    })),
-    gemini: {
-      type: c.type,
-      proprietaryMonths: c.proprietaryMonths,
-      coordinateLimits: {
-        north: coordinateLimitsInput(c.north),
-        south: coordinateLimitsInput(c.south),
-      },
-      instruments: [...c.instruments] as NonNullable<
-        NonNullable<CallForProposalsPropertiesInput['gemini']>['instruments']
-      >,
-    },
-  };
+  return {};
 }
 
killedBy: cfpPropertiesInput serializes an edited call, Gemini properties under `gemini`
statusReason: expected {} to deeply equal { semester: '2025A', …(6) }

[Killed] MethodExpression
src/gql/cfp.ts:172:47
 export function cfpPropertiesInput(c: CallForProposals): CallForProposalsPropertiesInput {
   return {
     semester: c.semester,
-    ...(c.title.trim() === '' ? {} : { title: c.title.trim() }),
+    ...(c.title.trim() === '' ? {} : { title: c.title }),
     activeStart: c.activeStart,
     activeEnd: c.activeEnd,
killedBy: cfpPropertiesInput serializes an edited call, Gemini properties under `gemini`
statusReason: expected { semester: '2025A', …(6) } to deeply equal { semester: '2025A', …(6) }

[Killed] EqualityOperator
src/gql/cfp.ts:172:9
 export function cfpPropertiesInput(c: CallForProposals): CallForProposalsPropertiesInput {
   return {
     semester: c.semester,
-    ...(c.title.trim() === '' ? {} : { title: c.title.trim() }),
+    ...(c.title.trim() !== '' ? {} : { title: c.title.trim() }),
     activeStart: c.activeStart,
     activeEnd: c.activeEnd,
killedBy: cfpPropertiesInput serializes an edited call, Gemini properties under `gemini`
statusReason: expected { semester: '2025A', …(5) } to deeply equal { semester: '2025A', …(6) }

[Killed] ConditionalExpression
src/gql/cfp.ts:175:9
     ...(c.title.trim() === '' ? {} : { title: c.title.trim() }),
     activeStart: c.activeStart,
     activeEnd: c.activeEnd,
-    ...(c.defaultDeadline.trim() === '' ? {} : { submissionDeadlineDefault: c.defaultDeadline.trim() }),
+    ...(true ? {} : { submissionDeadlineDefault: c.defaultDeadline.trim() }),
     partners: c.partners.map((p) => ({
       geminiPartner: p.partner,
killedBy: cfpPropertiesInput serializes an edited call, Gemini properties under `gemini`
statusReason: expected { semester: '2025A', …(5) } to deeply equal { semester: '2025A', …(6) }

[Killed] EqualityOperator
src/gql/cfp.ts:175:9
     ...(c.title.trim() === '' ? {} : { title: c.title.trim() }),
     activeStart: c.activeStart,
     activeEnd: c.activeEnd,
-    ...(c.defaultDeadline.trim() === '' ? {} : { submissionDeadlineDefault: c.defaultDeadline.trim() }),
+    ...(c.defaultDeadline.trim() !== '' ? {} : { submissionDeadlineDefault: c.defaultDeadline.trim() }),
     partners: c.partners.map((p) => ({
       geminiPartner: p.partner,
killedBy: cfpPropertiesInput serializes an edited call, Gemini properties under `gemini`
statusReason: expected { semester: '2025A', …(5) } to deeply equal { semester: '2025A', …(6) }

[Killed] ArithmeticOperator
src/gql/cfp.ts:207:17
  *  Aug–Jan (January belongs to the previous year's B). Seeds newly created
  *  calls. */
 export function currentSemester(now: Date = new Date()): string {
-  const month = now.getUTCMonth() + 1;
+  const month = now.getUTCMonth() - 1;
   if (month === 1) return `${String(now.getUTCFullYear() - 1)}B`;
   return `${String(now.getUTCFullYear())}${month < 8 ? 'A' : 'B'}`;
killedBy: currentSemester assigns Feb-Jul to A and Aug-Dec to B
statusReason: expected '2027A' to be '2027B' // Object.is equality

[Killed] ArithmeticOperator
src/gql/cfp.ts:208:37
  *  calls. */
 export function currentSemester(now: Date = new Date()): string {
   const month = now.getUTCMonth() + 1;
-  if (month === 1) return `${String(now.getUTCFullYear() - 1)}B`;
+  if (month === 1) return `${String(now.getUTCFullYear() + 1)}B`;
   return `${String(now.getUTCFullYear())}${month < 8 ? 'A' : 'B'}`;
 }
killedBy: currentSemester assigns January to the previous year's B semester
statusReason: expected '2029B' to be '2027B' // Object.is equality

[Killed] EqualityOperator
src/gql/cfp.ts:208:7
  *  calls. */
 export function currentSemester(now: Date = new Date()): string {
   const month = now.getUTCMonth() + 1;
-  if (month === 1) return `${String(now.getUTCFullYear() - 1)}B`;
+  if (month !== 1) return `${String(now.getUTCFullYear() - 1)}B`;
   return `${String(now.getUTCFullYear())}${month < 8 ? 'A' : 'B'}`;
 }
killedBy: currentSemester assigns Feb-Jul to A and Aug-Dec to B
statusReason: expected '2026B' to be '2027A' // Object.is equality

[Killed] EqualityOperator
src/gql/cfp.ts:209:44
 export function currentSemester(now: Date = new Date()): string {
   const month = now.getUTCMonth() + 1;
   if (month === 1) return `${String(now.getUTCFullYear() - 1)}B`;
-  return `${String(now.getUTCFullYear())}${month < 8 ? 'A' : 'B'}`;
+  return `${String(now.getUTCFullYear())}${month <= 8 ? 'A' : 'B'}`;
 }
 
killedBy: currentSemester assigns Feb-Jul to A and Aug-Dec to B
statusReason: expected '2027A' to be '2027B' // Object.is equality

[Killed] EqualityOperator
src/gql/cfp.ts:209:44
 export function currentSemester(now: Date = new Date()): string {
   const month = now.getUTCMonth() + 1;
   if (month === 1) return `${String(now.getUTCFullYear() - 1)}B`;
-  return `${String(now.getUTCFullYear())}${month < 8 ? 'A' : 'B'}`;
+  return `${String(now.getUTCFullYear())}${month >= 8 ? 'A' : 'B'}`;
 }
 
killedBy: currentSemester assigns Feb-Jul to A and Aug-Dec to B
statusReason: expected '2027B' to be '2027A' // Object.is equality

[Killed] MethodExpression
src/gql/cfp.ts:215:23
 /** A semester's active date range — the ODB requires activeStart/activeEnd on
  *  create. A: Feb 1 – Aug 1; B: Aug 1 – Feb 1 of the next year. */
 export function semesterDates(semester: string): { activeStart: string; activeEnd: string } {
-  const year = Number(semester.slice(0, 4));
+  const year = Number(semester);
   return semester.endsWith('A')
     ? { activeStart: `${String(year)}-02-01`, activeEnd: `${String(year)}-08-01` }
killedBy: semesterDates spans Feb-Aug for A and Aug-Feb (of the next year) for B
statusReason: expected { activeStart: 'NaN-02-01', …(1) } to deeply equal { activeStart: '2027-02-01', …(1) }

[Killed] MethodExpression
src/gql/cfp.ts:216:10
  *  create. A: Feb 1 – Aug 1; B: Aug 1 – Feb 1 of the next year. */
 export function semesterDates(semester: string): { activeStart: string; activeEnd: string } {
   const year = Number(semester.slice(0, 4));
-  return semester.endsWith('A')
+  return semester.startsWith('A')
     ? { activeStart: `${String(year)}-02-01`, activeEnd: `${String(year)}-08-01` }
     : { activeStart: `${String(year)}-08-01`, activeEnd: `${String(year + 1)}-02-01` };
killedBy: semesterDates spans Feb-Aug for A and Aug-Feb (of the next year) for B
statusReason: expected { activeStart: '2027-08-01', …(1) } to deeply equal { activeStart: '2027-02-01', …(1) }

[Killed] ArithmeticOperator
src/gql/cfp.ts:218:68
   const year = Number(semester.slice(0, 4));
   return semester.endsWith('A')
     ? { activeStart: `${String(year)}-02-01`, activeEnd: `${String(year)}-08-01` }
-    : { activeStart: `${String(year)}-08-01`, activeEnd: `${String(year + 1)}-02-01` };
+    : { activeStart: `${String(year)}-08-01`, activeEnd: `${String(year - 1)}-02-01` };
 }
 
killedBy: semesterDates spans Feb-Aug for A and Aug-Feb (of the next year) for B
statusReason: expected { activeStart: '2027-08-01', …(1) } to deeply equal { activeStart: '2027-08-01', …(1) }

[Killed] StringLiteral
src/gql/cfp.ts:218:58
   const year = Number(semester.slice(0, 4));
   return semester.endsWith('A')
     ? { activeStart: `${String(year)}-02-01`, activeEnd: `${String(year)}-08-01` }
-    : { activeStart: `${String(year)}-08-01`, activeEnd: `${String(year + 1)}-02-01` };
+    : { activeStart: `${String(year)}-08-01`, activeEnd: `` };
 }
 
killedBy: semesterDates spans Feb-Aug for A and Aug-Feb (of the next year) for B
statusReason: expected { activeStart: '2027-08-01', …(1) } to deeply equal { activeStart: '2027-08-01', …(1) }

[Killed] BooleanLiteral
src/gql/cfp.ts:225:38
  *  it stays open until every participating partner's window has closed.
  *  No deadlines at all (e.g. a draft) is treated as not yet open. */
 function isCallOpen(deadlines: readonly string[]): boolean {
-  if (deadlines.length === 0) return false;
+  if (deadlines.length === 0) return true;
   const latest = Math.max(...deadlines.map((d) => new Date(d).getTime()));
   return Date.now() <= latest;
killedBy: mapCfps is open while today is before the latest partner deadline, closed once all have passed
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/gql/cfp.ts:225:7
  *  it stays open until every participating partner's window has closed.
  *  No deadlines at all (e.g. a draft) is treated as not yet open. */
 function isCallOpen(deadlines: readonly string[]): boolean {
-  if (deadlines.length === 0) return false;
+  if (deadlines.length !== 0) return false;
   const latest = Math.max(...deadlines.map((d) => new Date(d).getTime()));
   return Date.now() <= latest;
killedBy: mapCfps is open while today is before the latest partner deadline, closed once all have passed
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/gql/cfp.ts:226:18
  *  No deadlines at all (e.g. a draft) is treated as not yet open. */
 function isCallOpen(deadlines: readonly string[]): boolean {
   if (deadlines.length === 0) return false;
-  const latest = Math.max(...deadlines.map((d) => new Date(d).getTime()));
+  const latest = Math.min(...deadlines.map(d => new Date(d).getTime()));
   return Date.now() <= latest;
 }

[Killed] EqualityOperator
src/gql/cfp.ts:227:10
 function isCallOpen(deadlines: readonly string[]): boolean {
   if (deadlines.length === 0) return false;
   const latest = Math.max(...deadlines.map((d) => new Date(d).getTime()));
-  return Date.now() <= latest;
+  return Date.now() > latest;
 }
 
killedBy: mapCfps is open while today is before the latest partner deadline, closed once all have passed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/gql/cfp.ts:227:10
 function isCallOpen(deadlines: readonly string[]): boolean {
   if (deadlines.length === 0) return false;
   const latest = Math.max(...deadlines.map((d) => new Date(d).getTime()));
-  return Date.now() <= latest;
+  return false;
 }
 
killedBy: mapCfps is open while today is before the latest partner deadline, closed once all have passed
statusReason: expected false to be true // Object.is equality
