[Survived] StringLiteral
src/gql/changeRequests.ts:80:24
  *  (e.g. visiting instruments) default to North, since that's unverifiable
  *  from the enum alone — flagged via the label itself. */
 const INSTRUMENT_SITE: Partial<Record<Instrument, { label: string; site: Site }>> = {
-  GMOS_NORTH: { label: 'GMOS-N', site: 'NORTH' },
+  GMOS_NORTH: { label: "", site: 'NORTH' },
   GMOS_SOUTH: { label: 'GMOS-S', site: 'SOUTH' },
   FLAMINGOS2: { label: 'Flamingos-2', site: 'SOUTH' },

[Survived] StringLiteral
src/gql/changeRequests.ts:82:24
 const INSTRUMENT_SITE: Partial<Record<Instrument, { label: string; site: Site }>> = {
   GMOS_NORTH: { label: 'GMOS-N', site: 'NORTH' },
   GMOS_SOUTH: { label: 'GMOS-S', site: 'SOUTH' },
-  FLAMINGOS2: { label: 'Flamingos-2', site: 'SOUTH' },
+  FLAMINGOS2: { label: "", site: 'SOUTH' },
   GNIRS: { label: 'GNIRS', site: 'NORTH' },
   IGRINS2: { label: 'IGRINS-2', site: 'NORTH' },

[Survived] StringLiteral
src/gql/changeRequests.ts:83:19
   GMOS_NORTH: { label: 'GMOS-N', site: 'NORTH' },
   GMOS_SOUTH: { label: 'GMOS-S', site: 'SOUTH' },
   FLAMINGOS2: { label: 'Flamingos-2', site: 'SOUTH' },
-  GNIRS: { label: 'GNIRS', site: 'NORTH' },
+  GNIRS: { label: "", site: 'NORTH' },
   IGRINS2: { label: 'IGRINS-2', site: 'NORTH' },
 };

[Killed] MethodExpression
src/gql/changeRequests.ts:103:11
       // internal id — fall back to the id for programs never given a reference.
       programReference: c.program.reference?.label ?? c.program.id,
       programTitle: c.program.name ?? '(untitled)',
-      pi: [prof?.givenName, prof?.familyName].filter(Boolean).join(' ') || '(unknown PI)',
+      pi: [prof?.givenName, prof?.familyName].join(' ') || '(unknown PI)',
       status: c.status,
       justification: c.justification ?? '',
killedBy: mapChangeRequests PI fallback renders a partial profile with just the available name parts
statusReason: expected 'Ada ' to be 'Ada' // Object.is equality

[Killed] LogicalOperator
src/gql/changeRequests.ts:103:11
       // internal id — fall back to the id for programs never given a reference.
       programReference: c.program.reference?.label ?? c.program.id,
       programTitle: c.program.name ?? '(untitled)',
-      pi: [prof?.givenName, prof?.familyName].filter(Boolean).join(' ') || '(unknown PI)',
+      pi: [prof?.givenName, prof?.familyName].filter(Boolean).join(' ') && '(unknown PI)',
       status: c.status,
       justification: c.justification ?? '',
killedBy: mapChangeRequests projects coordinates, instrument/site, and a percentile-based conditions string
statusReason: expected '(unknown PI)' to be 'Andrew Stephens' // Object.is equality

[NoCoverage] StringLiteral
src/gql/changeRequests.ts:107:29
       status: c.status,
       justification: c.justification ?? '',
       site: site.site,
-      ra: coords?.ra.hms ?? '—',
+      ra: coords?.ra.hms ?? "",
       dec: coords?.dec.dms ?? '—',
       raDeg: coords ? Number(coords.ra.degrees) : null,

[NoCoverage] StringLiteral
src/gql/changeRequests.ts:108:31
       justification: c.justification ?? '',
       site: site.site,
       ra: coords?.ra.hms ?? '—',
-      dec: coords?.dec.dms ?? '—',
+      dec: coords?.dec.dms ?? "",
       raDeg: coords ? Number(coords.ra.degrees) : null,
       decDeg: coords ? Number(coords.dec.degrees) : null,

[NoCoverage] ObjectLiteral
src/gql/changeRequests.ts:128:42
 /** The change-requests list — cached rows render immediately, refreshed in
  *  background. */
 export function useChangeRequests() {
-  return useQuery(CHANGE_REQUESTS_QUERY, { fetchPolicy: 'cache-and-network' });
+  return useQuery(CHANGE_REQUESTS_QUERY, {});
 }
 

[NoCoverage] EqualityOperator
src/gql/changeRequests.ts:151:45
  *  ConfigurationRequest carries only applicableObservations ids). Skipped
  *  while there's nothing to resolve. */
 export function useObservationsByIds(ids: readonly string[]) {
-  return useQuery(OBSERVATIONS_BY_ID_QUERY, ids.length === 0 ? skipToken : { variables: { ids: [...ids] } });
+  return useQuery(OBSERVATIONS_BY_ID_QUERY, ids.length !== 0 ? skipToken : { variables: { ids: [...ids] } });
 }
 

[NoCoverage] ConditionalExpression
src/gql/changeRequests.ts:151:45
  *  ConfigurationRequest carries only applicableObservations ids). Skipped
  *  while there's nothing to resolve. */
 export function useObservationsByIds(ids: readonly string[]) {
-  return useQuery(OBSERVATIONS_BY_ID_QUERY, ids.length === 0 ? skipToken : { variables: { ids: [...ids] } });
+  return useQuery(OBSERVATIONS_BY_ID_QUERY, true ? skipToken : { variables: { ids: [...ids] } });
 }
 

[Killed] BlockStatement
src/gql/changeRequests.ts:171:29
  *  with none left open. */
 export function groupChangeRequestsByProgram(requests: readonly ChangeRequest[]): ProgramWithChangeRequests[] {
   const byProgram = new Map<string, ChangeRequest[]>();
-  for (const r of requests) {
-    const group = byProgram.get(r.programId);
-    if (group) group.push(r);
-    else byProgram.set(r.programId, [r]);
-  }
+  for (const r of requests) {}
   return Array.from(byProgram.values()).map((reqs) => {
     const first = reqs[0]!;
killedBy: groupChangeRequestsByProgram synthesizes the per-program status per the sc-9094 mockup
statusReason: expected undefined to be 'Approved' // Object.is equality

[Killed] EqualityOperator
src/gql/changeRequests.ts:179:21
   return Array.from(byProgram.values()).map((reqs) => {
     const first = reqs[0]!;
     const statuses = new Set<ConfigurationRequestStatus>(reqs.map((r) => r.status));
-    const uniform = statuses.size === 1 ? [...statuses][0] : undefined;
+    const uniform = statuses.size !== 1 ? [...statuses][0] : undefined;
     const status: ProgramCrStatus = statuses.has('REQUESTED')
       ? 'Open'
killedBy: groupChangeRequestsByProgram synthesizes the per-program status per the sc-9094 mockup
statusReason: expected 'Mixed' to be 'Approved' // Object.is equality

[Killed] ConditionalExpression
src/gql/changeRequests.ts:179:21
   return Array.from(byProgram.values()).map((reqs) => {
     const first = reqs[0]!;
     const statuses = new Set<ConfigurationRequestStatus>(reqs.map((r) => r.status));
-    const uniform = statuses.size === 1 ? [...statuses][0] : undefined;
+    const uniform = false ? [...statuses][0] : undefined;
     const status: ProgramCrStatus = statuses.has('REQUESTED')
       ? 'Open'
killedBy: groupChangeRequestsByProgram synthesizes the per-program status per the sc-9094 mockup
statusReason: expected 'Mixed' to be 'Approved' // Object.is equality

[Killed] ConditionalExpression
src/gql/changeRequests.ts:182:9
     const uniform = statuses.size === 1 ? [...statuses][0] : undefined;
     const status: ProgramCrStatus = statuses.has('REQUESTED')
       ? 'Open'
-      : uniform === 'APPROVED'
+      : false
         ? 'Approved'
         : uniform === 'DENIED'
killedBy: groupChangeRequestsByProgram synthesizes the per-program status per the sc-9094 mockup
statusReason: expected 'Mixed' to be 'Approved' // Object.is equality

[Killed] ConditionalExpression
src/gql/changeRequests.ts:182:9
     const uniform = statuses.size === 1 ? [...statuses][0] : undefined;
     const status: ProgramCrStatus = statuses.has('REQUESTED')
       ? 'Open'
-      : uniform === 'APPROVED'
+      : true
         ? 'Approved'
         : uniform === 'DENIED'
killedBy: groupChangeRequestsByProgram synthesizes the per-program status per the sc-9094 mockup
statusReason: expected 'Approved' to be 'Mixed' // Object.is equality

[Killed] ConditionalExpression
src/gql/changeRequests.ts:184:11
       ? 'Open'
       : uniform === 'APPROVED'
         ? 'Approved'
-        : uniform === 'DENIED'
+        : true
           ? 'Denied'
           : 'Mixed';
killedBy: groupChangeRequestsByProgram synthesizes the per-program status per the sc-9094 mockup
statusReason: expected 'Denied' to be 'Mixed' // Object.is equality

[Killed] EqualityOperator
src/gql/changeRequests.ts:184:11
       ? 'Open'
       : uniform === 'APPROVED'
         ? 'Approved'
-        : uniform === 'DENIED'
+        : uniform !== 'DENIED'
           ? 'Denied'
           : 'Mixed';
killedBy: groupChangeRequestsByProgram synthesizes the per-program status per the sc-9094 mockup
statusReason: expected 'Denied' to be 'Mixed' // Object.is equality

[NoCoverage] BooleanLiteral
src/gql/changeRequests.ts:202:26
 export function useUpdateConfigurationRequests() {
   return useMutation(UPDATE_CONFIGURATION_REQUESTS_MUTATION, {
     refetchQueries: [CHANGE_REQUESTS_QUERY],
-    awaitRefetchQueries: true,
+    awaitRefetchQueries: false,
   });
 }
