[Survived] ArrayDeclaration
src/gql/conflicts.ts:34:23
  *  gap; a mode with no similar partner maps to just itself. */
 const SIMILAR_MODE_TYPES: Record<ObservingModeType, readonly ObservingModeType[]> = {
   ALOPEKE_SPECKLE: ['ALOPEKE_SPECKLE', 'ZORRO_SPECKLE'],
-  ALOPEKE_WIDE_FIELD: ['ALOPEKE_WIDE_FIELD', 'ZORRO_WIDE_FIELD'],
+  ALOPEKE_WIDE_FIELD: [],
   EXCHANGE_KECK: ['EXCHANGE_KECK'],
   EXCHANGE_SUBARU: ['EXCHANGE_SUBARU'],

[Survived] ArrayDeclaration
src/gql/conflicts.ts:38:26
   EXCHANGE_KECK: ['EXCHANGE_KECK'],
   EXCHANGE_SUBARU: ['EXCHANGE_SUBARU'],
   FLAMINGOS_2_IMAGING: ['FLAMINGOS_2_IMAGING'],
-  FLAMINGOS_2_LONG_SLIT: ['FLAMINGOS_2_LONG_SLIT', 'GNIRS_LONG_SLIT'],
+  FLAMINGOS_2_LONG_SLIT: [],
   GHOST_IFU: ['GHOST_IFU', 'MAROON_X'],
   GMOS_NORTH_IMAGING: ['GMOS_NORTH_IMAGING', 'GMOS_SOUTH_IMAGING'],

[Survived] ArrayDeclaration
src/gql/conflicts.ts:42:23
   GHOST_IFU: ['GHOST_IFU', 'MAROON_X'],
   GMOS_NORTH_IMAGING: ['GMOS_NORTH_IMAGING', 'GMOS_SOUTH_IMAGING'],
   GMOS_NORTH_LONG_SLIT: ['GMOS_NORTH_LONG_SLIT', 'GMOS_SOUTH_LONG_SLIT'],
-  GMOS_SOUTH_IMAGING: ['GMOS_SOUTH_IMAGING', 'GMOS_NORTH_IMAGING'],
+  GMOS_SOUTH_IMAGING: [],
   GMOS_SOUTH_LONG_SLIT: ['GMOS_SOUTH_LONG_SLIT', 'GMOS_NORTH_LONG_SLIT'],
   GNIRS_IFU: ['GNIRS_IFU'],

[Timeout] ArrayDeclaration
src/gql/conflicts.ts:43:25
   GMOS_NORTH_IMAGING: ['GMOS_NORTH_IMAGING', 'GMOS_SOUTH_IMAGING'],
   GMOS_NORTH_LONG_SLIT: ['GMOS_NORTH_LONG_SLIT', 'GMOS_SOUTH_LONG_SLIT'],
   GMOS_SOUTH_IMAGING: ['GMOS_SOUTH_IMAGING', 'GMOS_NORTH_IMAGING'],
-  GMOS_SOUTH_LONG_SLIT: ['GMOS_SOUTH_LONG_SLIT', 'GMOS_NORTH_LONG_SLIT'],
+  GMOS_SOUTH_LONG_SLIT: [],
   GNIRS_IFU: ['GNIRS_IFU'],
   GNIRS_IMAGING: ['GNIRS_IMAGING'],

[Survived] ArrayDeclaration
src/gql/conflicts.ts:45:18
   GMOS_SOUTH_IMAGING: ['GMOS_SOUTH_IMAGING', 'GMOS_NORTH_IMAGING'],
   GMOS_SOUTH_LONG_SLIT: ['GMOS_SOUTH_LONG_SLIT', 'GMOS_NORTH_LONG_SLIT'],
   GNIRS_IFU: ['GNIRS_IFU'],
-  GNIRS_IMAGING: ['GNIRS_IMAGING'],
+  GNIRS_IMAGING: [],
   GNIRS_LONG_SLIT: ['GNIRS_LONG_SLIT', 'FLAMINGOS_2_LONG_SLIT'],
   IGRINS_2_LONG_SLIT: ['IGRINS_2_LONG_SLIT'],

[Survived] ArrayDeclaration
src/gql/conflicts.ts:47:23
   GNIRS_IFU: ['GNIRS_IFU'],
   GNIRS_IMAGING: ['GNIRS_IMAGING'],
   GNIRS_LONG_SLIT: ['GNIRS_LONG_SLIT', 'FLAMINGOS_2_LONG_SLIT'],
-  IGRINS_2_LONG_SLIT: ['IGRINS_2_LONG_SLIT'],
+  IGRINS_2_LONG_SLIT: [],
   MAROON_X: ['MAROON_X', 'GHOST_IFU'],
   VISITOR_NORTH: ['VISITOR_NORTH'],

[Killed] ArrayDeclaration
src/gql/conflicts.ts:48:13
   GNIRS_IMAGING: ['GNIRS_IMAGING'],
   GNIRS_LONG_SLIT: ['GNIRS_LONG_SLIT', 'FLAMINGOS_2_LONG_SLIT'],
   IGRINS_2_LONG_SLIT: ['IGRINS_2_LONG_SLIT'],
-  MAROON_X: ['MAROON_X', 'GHOST_IFU'],
+  MAROON_X: [],
   VISITOR_NORTH: ['VISITOR_NORTH'],
   VISITOR_SOUTH: ['VISITOR_SOUTH'],
killedBy: similarModeTypes pairs the sc-9243 similar instruments, same configuration style
statusReason: expected [] to deeply equal [ 'MAROON_X', 'GHOST_IFU' ]

[Survived] ArrayDeclaration
src/gql/conflicts.ts:49:18
   GNIRS_LONG_SLIT: ['GNIRS_LONG_SLIT', 'FLAMINGOS_2_LONG_SLIT'],
   IGRINS_2_LONG_SLIT: ['IGRINS_2_LONG_SLIT'],
   MAROON_X: ['MAROON_X', 'GHOST_IFU'],
-  VISITOR_NORTH: ['VISITOR_NORTH'],
+  VISITOR_NORTH: [],
   VISITOR_SOUTH: ['VISITOR_SOUTH'],
   ZORRO_SPECKLE: ['ZORRO_SPECKLE', 'ALOPEKE_SPECKLE'],

[Survived] ArrayDeclaration
src/gql/conflicts.ts:52:21
   VISITOR_NORTH: ['VISITOR_NORTH'],
   VISITOR_SOUTH: ['VISITOR_SOUTH'],
   ZORRO_SPECKLE: ['ZORRO_SPECKLE', 'ALOPEKE_SPECKLE'],
-  ZORRO_WIDE_FIELD: ['ZORRO_WIDE_FIELD', 'ALOPEKE_WIDE_FIELD'],
+  ZORRO_WIDE_FIELD: [],
 };
 

[Survived] MethodExpression
src/gql/conflicts.ts:160:11
  */
 export function useConflictCandidates(sources: readonly { readonly modeType: string | null }[]) {
   const modeTypes = useMemo(
-    () => Array.from(new Set(sources.flatMap((s) => similarModeTypes(s.modeType)))).sort(),
+    () => Array.from(new Set(sources.flatMap(s => similarModeTypes(s.modeType)))),
     [sources],
   );

[Survived] EqualityOperator
src/gql/conflicts.ts:165:5
   );
   const { data, loading, error } = useQuery(
     CONFLICTS_QUERY,
-    modeTypes.length === 0
+    modeTypes.length !== 0
       ? skipToken
       : {

[Survived] ConditionalExpression
src/gql/conflicts.ts:165:5
   );
   const { data, loading, error } = useQuery(
     CONFLICTS_QUERY,
-    modeTypes.length === 0
+    false
       ? skipToken
       : {

[Survived] ArrayDeclaration
src/gql/conflicts.ts:172:79
           fetchPolicy: 'network-only',
         },
   );
-  const candidates = useMemo(() => (data ? mapConflictCandidates(data) : []), [data]);
+  const candidates = useMemo(() => (data ? mapConflictCandidates(data) : []), []);
   return { candidates, loading, error };
 }

[Timeout] ObjectLiteral
src/gql/conflicts.ts:193:78
 }
 
 // WITHDRAWN requests are dead plans — not conflicts — so they never label.
-const CR_STATUS_LABEL: Partial<Record<ConfigurationRequestStatus, string>> = {
-  REQUESTED: 'Requested',
-  APPROVED: 'Approved',
-  DENIED: 'Denied',
-};
+const CR_STATUS_LABEL: Partial<Record<ConfigurationRequestStatus, string>> = {};
 
 /** Every candidate from both pools. The ToO restriction of pool 2 is applied

[Killed] LogicalOperator
src/gql/conflicts.ts:206:17
   const fromRequests = raw.configurationRequests.matches.map((c): ConflictCandidate => {
     const coords = c.configuration.target?.coordinates;
     return {
-      label: `${c.program.reference?.label ?? c.program.id} ${c.id}`,
+      label: `${c.program.reference?.label && c.program.id} ${c.id}`,
       programId: c.program.id,
       requestId: c.id,
killedBy: mapConflictCandidates merges both pools, keeping only ToO-program observations from the second
statusReason: expected { label: 'p-2 x-42', …(7) } to match object { label: 'G-2027B-0421-P x-42', …(2) }
(5 matching properties omitted from actual)

[Killed] MethodExpression
src/gql/conflicts.ts:216:19
       modeType: c.configuration.observingMode?.mode ?? null,
     };
   });
-  const fromToO = raw.observations.matches
-    .filter((o) => {
-      const gemini = o.program.proposal?.gemini;
-      const activation = gemini && 'toOActivation' in gemini ? gemini.toOActivation : undefined;
-      return activation === 'STANDARD' || activation === 'RAPID';
-    })
+  const fromToO = raw.observations.matches
     .map((o): ConflictCandidate => {
       const target = o.targetEnvironment.firstScienceTarget;
killedBy: mapConflictCandidates merges both pools, keeping only ToO-program observations from the second
statusReason: expected [ { …(8) }, { …(8) }, …(1) ] to have a length of 2 but got 3

[Killed] BlockStatement
src/gql/conflicts.ts:217:20
     };
   });
   const fromToO = raw.observations.matches
-    .filter((o) => {
-      const gemini = o.program.proposal?.gemini;
-      const activation = gemini && 'toOActivation' in gemini ? gemini.toOActivation : undefined;
-      return activation === 'STANDARD' || activation === 'RAPID';
-    })
+    .filter((o) => {})
     .map((o): ConflictCandidate => {
       const target = o.targetEnvironment.firstScienceTarget;
killedBy: mapConflictCandidates merges both pools, keeping only ToO-program observations from the second
statusReason: expected [ { …(8) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/gql/conflicts.ts:220:43
     .filter((o) => {
       const gemini = o.program.proposal?.gemini;
       const activation = gemini && 'toOActivation' in gemini ? gemini.toOActivation : undefined;
-      return activation === 'STANDARD' || activation === 'RAPID';
+      return activation === 'STANDARD' || false;
     })
     .map((o): ConflictCandidate => {
killedBy: mapConflictCandidates merges both pools, keeping only ToO-program observations from the second
statusReason: expected [ { …(8) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/gql/conflicts.ts:220:14
     .filter((o) => {
       const gemini = o.program.proposal?.gemini;
       const activation = gemini && 'toOActivation' in gemini ? gemini.toOActivation : undefined;
-      return activation === 'STANDARD' || activation === 'RAPID';
+      return false;
     })
     .map((o): ConflictCandidate => {
killedBy: mapConflictCandidates merges both pools, keeping only ToO-program observations from the second
statusReason: expected [ { …(8) } ] to have a length of 2 but got 1

[Survived] OptionalChaining
src/gql/conflicts.ts:224:21
     })
     .map((o): ConflictCandidate => {
       const target = o.targetEnvironment.firstScienceTarget;
-      const state = o.workflow?.value?.state ?? 'UNDEFINED';
+      const state = o.workflow?.value.state ?? 'UNDEFINED';
       return {
         label: o.reference?.label ?? o.id,

[NoCoverage] StringLiteral
src/gql/conflicts.ts:224:49
     })
     .map((o): ConflictCandidate => {
       const target = o.targetEnvironment.firstScienceTarget;
-      const state = o.workflow?.value?.state ?? 'UNDEFINED';
+      const state = o.workflow?.value?.state ?? "";
       return {
         label: o.reference?.label ?? o.id,

[Killed] MethodExpression
src/gql/conflicts.ts:229:35
         label: o.reference?.label ?? o.id,
         programId: o.program.id,
         requestId: null,
-        status: state.charAt(0) + state.slice(1).toLowerCase(),
+        status: state.charAt(0) + state.toLowerCase(),
         target: target?.name ?? '—',
         raDeg: target?.sidereal ? Number(target.sidereal.ra.degrees) : null,
killedBy: mapConflictCandidates merges both pools, keeping only ToO-program observations from the second
statusReason: expected { label: 'G-2027B-0057-Q-0311', …(7) } to match object { label: 'G-2027B-0057-Q-0311', …(2) }
(5 matching properties omitted from actual)

[Killed] MethodExpression
src/gql/conflicts.ts:229:35
         label: o.reference?.label ?? o.id,
         programId: o.program.id,
         requestId: null,
-        status: state.charAt(0) + state.slice(1).toLowerCase(),
+        status: state.charAt(0) + state.slice(1).toUpperCase(),
         target: target?.name ?? '—',
         raDeg: target?.sidereal ? Number(target.sidereal.ra.degrees) : null,
killedBy: mapConflictCandidates merges both pools, keeping only ToO-program observations from the second
statusReason: expected { label: 'G-2027B-0057-Q-0311', …(7) } to match object { label: 'G-2027B-0057-Q-0311', …(2) }
(5 matching properties omitted from actual)

[Killed] ArrayDeclaration
src/gql/conflicts.ts:236:10
         modeType: o.observingMode?.mode ?? null,
       };
     });
-  return [...fromRequests, ...fromToO];
+  return [];
 }
 
killedBy: mapConflictCandidates merges both pools, keeping only ToO-program observations from the second
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/gql/conflicts.ts:266:28
   candidates: readonly ConflictCandidate[],
 ): ConflictRow[] {
   const rows: ConflictRow[] = [];
-  for (const s of sources) {
-    if (s.raDeg === null || s.decDeg === null) continue;
-    const similar = new Set<string>(similarModeTypes(s.modeType));
-    const radius = searchRadiusArcsec(s.modeType);
-    for (const c of candidates) {
-      if (c.programId === s.programId || c.requestId === s.id) continue;
-      if (c.raDeg === null || c.decDeg === null || c.modeType === null || !similar.has(c.modeType)) continue;
-      const sep = separationArcsec(s.raDeg, s.decDeg, c.raDeg, c.decDeg);
-      if (sep <= radius) rows.push({ ...c, key: `${s.id}:${c.label}`, sourceId: s.id, sepArcsec: sep });
-    }
-  }
+  for (const s of sources) {}
   return rows.sort((a, b) => a.sourceId.localeCompare(b.sourceId) || a.sepArcsec - b.sepArcsec);
 }
killedBy: matchConflicts matches a similar mode within the field-of-view distance
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/gql/conflicts.ts:270:33
     if (s.raDeg === null || s.decDeg === null) continue;
     const similar = new Set<string>(similarModeTypes(s.modeType));
     const radius = searchRadiusArcsec(s.modeType);
-    for (const c of candidates) {
-      if (c.programId === s.programId || c.requestId === s.id) continue;
-      if (c.raDeg === null || c.decDeg === null || c.modeType === null || !similar.has(c.modeType)) continue;
-      const sep = separationArcsec(s.raDeg, s.decDeg, c.raDeg, c.decDeg);
-      if (sep <= radius) rows.push({ ...c, key: `${s.id}:${c.label}`, sourceId: s.id, sepArcsec: sep });
-    }
+    for (const c of candidates) {}
   }
   return rows.sort((a, b) => a.sourceId.localeCompare(b.sourceId) || a.sepArcsec - b.sepArcsec);
killedBy: matchConflicts matches a similar mode within the field-of-view distance
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/gql/conflicts.ts:271:11
     const similar = new Set<string>(similarModeTypes(s.modeType));
     const radius = searchRadiusArcsec(s.modeType);
     for (const c of candidates) {
-      if (c.programId === s.programId || c.requestId === s.id) continue;
+      if (c.programId === s.programId && c.requestId === s.id) continue;
       if (c.raDeg === null || c.decDeg === null || c.modeType === null || !similar.has(c.modeType)) continue;
       const sep = separationArcsec(s.raDeg, s.decDeg, c.raDeg, c.decDeg);
killedBy: matchConflicts excludes matches beyond the distance, in the same program, or of a dissimilar mode
statusReason: expected [ { …(11) } ] to deeply equal []

[Killed] EqualityOperator
src/gql/conflicts.ts:271:11
     const similar = new Set<string>(similarModeTypes(s.modeType));
     const radius = searchRadiusArcsec(s.modeType);
     for (const c of candidates) {
-      if (c.programId === s.programId || c.requestId === s.id) continue;
+      if (c.programId !== s.programId || c.requestId === s.id) continue;
       if (c.raDeg === null || c.decDeg === null || c.modeType === null || !similar.has(c.modeType)) continue;
       const sep = separationArcsec(s.raDeg, s.decDeg, c.raDeg, c.decDeg);
killedBy: matchConflicts matches a similar mode within the field-of-view distance
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/gql/conflicts.ts:272:75
     const radius = searchRadiusArcsec(s.modeType);
     for (const c of candidates) {
       if (c.programId === s.programId || c.requestId === s.id) continue;
-      if (c.raDeg === null || c.decDeg === null || c.modeType === null || !similar.has(c.modeType)) continue;
+      if (c.raDeg === null || c.decDeg === null || c.modeType === null || similar.has(c.modeType)) continue;
       const sep = separationArcsec(s.raDeg, s.decDeg, c.raDeg, c.decDeg);
       if (sep <= radius) rows.push({ ...c, key: `${s.id}:${c.label}`, sourceId: s.id, sepArcsec: sep });
killedBy: matchConflicts matches a similar mode within the field-of-view distance
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/gql/conflicts.ts:274:11
       if (c.programId === s.programId || c.requestId === s.id) continue;
       if (c.raDeg === null || c.decDeg === null || c.modeType === null || !similar.has(c.modeType)) continue;
       const sep = separationArcsec(s.raDeg, s.decDeg, c.raDeg, c.decDeg);
-      if (sep <= radius) rows.push({ ...c, key: `${s.id}:${c.label}`, sourceId: s.id, sepArcsec: sep });
+      if (true) rows.push({ ...c, key: `${s.id}:${c.label}`, sourceId: s.id, sepArcsec: sep });
     }
   }
killedBy: matchConflicts excludes matches beyond the distance, in the same program, or of a dissimilar mode
statusReason: expected [ { …(11) } ] to deeply equal []

[Killed] EqualityOperator
src/gql/conflicts.ts:274:11
       if (c.programId === s.programId || c.requestId === s.id) continue;
       if (c.raDeg === null || c.decDeg === null || c.modeType === null || !similar.has(c.modeType)) continue;
       const sep = separationArcsec(s.raDeg, s.decDeg, c.raDeg, c.decDeg);
-      if (sep <= radius) rows.push({ ...c, key: `${s.id}:${c.label}`, sourceId: s.id, sepArcsec: sep });
+      if (sep > radius) rows.push({ ...c, key: `${s.id}:${c.label}`, sourceId: s.id, sepArcsec: sep });
     }
   }
killedBy: matchConflicts matches a similar mode within the field-of-view distance
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/gql/conflicts.ts:277:30
       if (sep <= radius) rows.push({ ...c, key: `${s.id}:${c.label}`, sourceId: s.id, sepArcsec: sep });
     }
   }
-  return rows.sort((a, b) => a.sourceId.localeCompare(b.sourceId) || a.sepArcsec - b.sepArcsec);
+  return rows.sort((a, b) => a.sourceId.localeCompare(b.sourceId) && a.sepArcsec - b.sepArcsec);
 }
 
killedBy: matchConflicts ordering sorts rows by source id, then by separation
statusReason: expected [ 'x-2:far', 'x-2:near', …(2) ] to deeply equal [ 'x-1:near', 'x-1:far', …(2) ]

[Killed] MethodExpression
src/gql/conflicts.ts:277:10
       if (sep <= radius) rows.push({ ...c, key: `${s.id}:${c.label}`, sourceId: s.id, sepArcsec: sep });
     }
   }
-  return rows.sort((a, b) => a.sourceId.localeCompare(b.sourceId) || a.sepArcsec - b.sepArcsec);
+  return rows;
 }
 
killedBy: matchConflicts ordering sorts rows by source id, then by separation
statusReason: expected [ 'x-2:far', 'x-2:near', …(2) ] to deeply equal [ 'x-1:near', 'x-1:far', …(2) ]
