[Killed] ConditionalExpression
src/gql/errors.ts:6:7
  *  for reviewers. */
 export function friendlyError(err: unknown): string {
   const msg = err instanceof Error ? err.message : String(err);
-  if (/access denied/i.test(msg)) return 'Access denied for this token’s role.';
+  if (false) return 'Access denied for this token’s role.';
   if (/jwt|expired|signature|401|unauthor/i.test(msg)) return 'Token expired or invalid — sign in again.';
   if (/failed to fetch|networkerror|econnrefused/i.test(msg)) return 'The ODB is unreachable.';
killedBy: friendlyError translates auth failures into actionable messages
statusReason: expected 'Access denied for user u-123' to be 'Access denied for this token’s role.' // Object.is equality

[Killed] ConditionalExpression
src/gql/errors.ts:6:7
  *  for reviewers. */
 export function friendlyError(err: unknown): string {
   const msg = err instanceof Error ? err.message : String(err);
-  if (/access denied/i.test(msg)) return 'Access denied for this token’s role.';
+  if (true) return 'Access denied for this token’s role.';
   if (/jwt|expired|signature|401|unauthor/i.test(msg)) return 'Token expired or invalid — sign in again.';
   if (/failed to fetch|networkerror|econnrefused/i.test(msg)) return 'The ODB is unreachable.';
killedBy: friendlyError translates auth failures into actionable messages
statusReason: expected 'Access denied for this token’s role.' to be 'Token expired or invalid — sign in ag…' // Object.is equality

[Killed] ConditionalExpression
src/gql/errors.ts:7:7
 export function friendlyError(err: unknown): string {
   const msg = err instanceof Error ? err.message : String(err);
   if (/access denied/i.test(msg)) return 'Access denied for this token’s role.';
-  if (/jwt|expired|signature|401|unauthor/i.test(msg)) return 'Token expired or invalid — sign in again.';
+  if (true) return 'Token expired or invalid — sign in again.';
   if (/failed to fetch|networkerror|econnrefused/i.test(msg)) return 'The ODB is unreachable.';
   return msg.slice(0, 120);
killedBy: friendlyError translates network failures
statusReason: expected 'Token expired or invalid — sign in ag…' to be 'The ODB is unreachable.' // Object.is equality

[Killed] ConditionalExpression
src/gql/errors.ts:7:7
 export function friendlyError(err: unknown): string {
   const msg = err instanceof Error ? err.message : String(err);
   if (/access denied/i.test(msg)) return 'Access denied for this token’s role.';
-  if (/jwt|expired|signature|401|unauthor/i.test(msg)) return 'Token expired or invalid — sign in again.';
+  if (false) return 'Token expired or invalid — sign in again.';
   if (/failed to fetch|networkerror|econnrefused/i.test(msg)) return 'The ODB is unreachable.';
   return msg.slice(0, 120);
killedBy: friendlyError translates auth failures into actionable messages
statusReason: expected 'The JWT signature is invalid' to be 'Token expired or invalid — sign in ag…' // Object.is equality

[Killed] ConditionalExpression
src/gql/errors.ts:8:7
   const msg = err instanceof Error ? err.message : String(err);
   if (/access denied/i.test(msg)) return 'Access denied for this token’s role.';
   if (/jwt|expired|signature|401|unauthor/i.test(msg)) return 'Token expired or invalid — sign in again.';
-  if (/failed to fetch|networkerror|econnrefused/i.test(msg)) return 'The ODB is unreachable.';
+  if (false) return 'The ODB is unreachable.';
   return msg.slice(0, 120);
 }
killedBy: friendlyError translates network failures
statusReason: expected 'Failed to fetch' to be 'The ODB is unreachable.' // Object.is equality

[Killed] ConditionalExpression
src/gql/errors.ts:8:7
   const msg = err instanceof Error ? err.message : String(err);
   if (/access denied/i.test(msg)) return 'Access denied for this token’s role.';
   if (/jwt|expired|signature|401|unauthor/i.test(msg)) return 'Token expired or invalid — sign in again.';
-  if (/failed to fetch|networkerror|econnrefused/i.test(msg)) return 'The ODB is unreachable.';
+  if (true) return 'The ODB is unreachable.';
   return msg.slice(0, 120);
 }
killedBy: friendlyError passes other messages through, truncated, and stringifies non-Errors
statusReason: expected 'The ODB is unreachable.' to be 'Field "x" of type Y must have a selec…' // Object.is equality

[Killed] MethodExpression
src/gql/errors.ts:9:10
   if (/access denied/i.test(msg)) return 'Access denied for this token’s role.';
   if (/jwt|expired|signature|401|unauthor/i.test(msg)) return 'Token expired or invalid — sign in again.';
   if (/failed to fetch|networkerror|econnrefused/i.test(msg)) return 'The ODB is unreachable.';
-  return msg.slice(0, 120);
+  return msg;
 }
 
killedBy: friendlyError passes other messages through, truncated, and stringifies non-Errors
statusReason: expected 'eeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee…' to have a length of 120 but got 200
