[Killed] StringLiteral
src/gql/programs.ts:101:42
   return useQuery(PROGRAMS_QUERY, { fetchPolicy: 'cache-and-network' });
 }
 
-const CONTACT_SCIENTIST_ROLES = new Set(['SUPPORT_PRIMARY', 'SUPPORT_SECONDARY']);
+const CONTACT_SCIENTIST_ROLES = new Set(["", 'SUPPORT_SECONDARY']);
 
 /** The updatePrograms SET for a draft's directly-editable program properties. */
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [] to deeply equal [ { name: 'Bob Contact', …(2) } ]

[Survived] StringLiteral
src/gql/programs.ts:101:61
   return useQuery(PROGRAMS_QUERY, { fetchPolicy: 'cache-and-network' });
 }
 
-const CONTACT_SCIENTIST_ROLES = new Set(['SUPPORT_PRIMARY', 'SUPPORT_SECONDARY']);
+const CONTACT_SCIENTIST_ROLES = new Set(['SUPPORT_PRIMARY', ""]);
 
 /** The updatePrograms SET for a draft's directly-editable program properties. */

[Killed] ObjectLiteral
src/gql/programs.ts:107:29
 export function programPropertiesInput(draft: Program): ProgramPropertiesInput {
   return {
     goa: { proprietaryMonths: draft.proprietaryMonths, privateHeader: draft.privateHeader },
-    ...(draft.activeStart ? { activeStart: draft.activeStart } : {}),
+    ...(draft.activeStart ? {} : {}),
     ...(draft.activeEnd ? { activeEnd: draft.activeEnd } : {}),
   };
killedBy: programPropertiesInput carries the GOA properties and active period
statusReason: expected { goa: { …(2) }, …(1) } to deeply equal { goa: { …(2) }, …(2) }

[Killed] ObjectLiteral
src/gql/programs.ts:108:27
   return {
     goa: { proprietaryMonths: draft.proprietaryMonths, privateHeader: draft.privateHeader },
     ...(draft.activeStart ? { activeStart: draft.activeStart } : {}),
-    ...(draft.activeEnd ? { activeEnd: draft.activeEnd } : {}),
+    ...(draft.activeEnd ? {} : {}),
   };
 }
killedBy: programPropertiesInput carries the GOA properties and active period
statusReason: expected { goa: { …(2) }, …(1) } to deeply equal { goa: { …(2) }, …(2) }

[Killed] MethodExpression
src/gql/programs.ts:144:10
  *  Zero-hour cells are editing state (they keep a partner's grid row alive),
  *  not awards — only positive allocations are sent. */
 export function allocationsInput(allocations: readonly Allocation[]): AllocationInput[] {
-  return allocations
-    .filter((a) => a.hours > 0)
+  return allocations
     .map((a) => ({
       category: a.category,
killedBy: allocationsInput sends only positive awards, keeping zero cells as grid-only editing state
statusReason: expected [ { category: 'US', …(2) }, …(1) ] to deeply equal [ { category: 'US', …(2) } ]

[Killed] ConditionalExpression
src/gql/programs.ts:145:20
  *  not awards — only positive allocations are sent. */
 export function allocationsInput(allocations: readonly Allocation[]): AllocationInput[] {
   return allocations
-    .filter((a) => a.hours > 0)
+    .filter((a) => false)
     .map((a) => ({
       category: a.category,
killedBy: allocationsInput sends only positive awards, keeping zero cells as grid-only editing state
statusReason: expected [] to deeply equal [ { category: 'US', …(2) } ]

[Killed] ConditionalExpression
src/gql/programs.ts:145:20
  *  not awards — only positive allocations are sent. */
 export function allocationsInput(allocations: readonly Allocation[]): AllocationInput[] {
   return allocations
-    .filter((a) => a.hours > 0)
+    .filter((a) => true)
     .map((a) => ({
       category: a.category,
killedBy: allocationsInput sends only positive awards, keeping zero cells as grid-only editing state
statusReason: expected [ { category: 'US', …(2) }, …(1) ] to deeply equal [ { category: 'US', …(2) } ]

[Killed] ConditionalExpression
src/gql/programs.ts:170:10
 /** ToO / minPercentTime / band-3 edits → `GeminiProposalTypeInput` (a oneOf),
  *  keyed by the program's class. Only Queue proposals carry ToO and band-3. */
 export function proposalTypeInput(p: Program): GeminiProposalTypeInput {
-  return p.programClass === 'QUEUE'
+  return true
     ? {
         queue: {
killedBy: proposalTypeInput builds the classical arm for Classical programs
statusReason: expected { queue: { …(3) } } to deeply equal { classical: { minPercentTime: 75 } }

[Killed] EqualityOperator
src/gql/programs.ts:170:10
 /** ToO / minPercentTime / band-3 edits → `GeminiProposalTypeInput` (a oneOf),
  *  keyed by the program's class. Only Queue proposals carry ToO and band-3. */
 export function proposalTypeInput(p: Program): GeminiProposalTypeInput {
-  return p.programClass === 'QUEUE'
+  return p.programClass !== 'QUEUE'
     ? {
         queue: {
killedBy: proposalTypeInput builds the queue arm of the oneOf for Queue programs
statusReason: expected { classical: { minPercentTime: 75 } } to deeply equal { queue: { …(3) } }

[Killed] ObjectLiteral
src/gql/programs.ts:178:20
           considerForBand3: p.considerForBand3 ? 'CONSIDER' : 'DO_NOT_CONSIDER',
         },
       }
-    : { classical: { minPercentTime: p.minPercentTime } };
+    : { classical: {} };
 }
 
killedBy: proposalTypeInput builds the classical arm for Classical programs
statusReason: expected { classical: {} } to deeply equal { classical: { minPercentTime: 75 } }

[Killed] LogicalOperator
src/gql/programs.ts:255:66
 export function mapPrograms(raw: AdminProgramsResult): Program[] {
   return raw.programs.matches.map((p: ProgramItemFragment): Program => {
     // Hide the ODB's sentinel bounds (1901/2099) — they mean "not set yet".
-    const activeStart = p.active?.start === '1901-01-01' ? '' : (p.active?.start ?? '');
+    const activeStart = p.active?.start === '1901-01-01' ? '' : (p.active?.start && '');
     const activeEnd = p.active?.end === '2099-12-31' ? '' : (p.active?.end ?? '');
 
killedBy: mapPrograms shows the 1901–2099 sentinel bounds as blank dates, keeps a real range
statusReason: expected '' to be '2027-08-01' // Object.is equality

[Killed] ConditionalExpression
src/gql/programs.ts:255:25
 export function mapPrograms(raw: AdminProgramsResult): Program[] {
   return raw.programs.matches.map((p: ProgramItemFragment): Program => {
     // Hide the ODB's sentinel bounds (1901/2099) — they mean "not set yet".
-    const activeStart = p.active?.start === '1901-01-01' ? '' : (p.active?.start ?? '');
+    const activeStart = true ? '' : (p.active?.start ?? '');
     const activeEnd = p.active?.end === '2099-12-31' ? '' : (p.active?.end ?? '');
 
killedBy: mapPrograms shows the 1901–2099 sentinel bounds as blank dates, keeps a real range
statusReason: expected '' to be '2027-08-01' // Object.is equality

[Killed] ConditionalExpression
src/gql/programs.ts:256:23
   return raw.programs.matches.map((p: ProgramItemFragment): Program => {
     // Hide the ODB's sentinel bounds (1901/2099) — they mean "not set yet".
     const activeStart = p.active?.start === '1901-01-01' ? '' : (p.active?.start ?? '');
-    const activeEnd = p.active?.end === '2099-12-31' ? '' : (p.active?.end ?? '');
+    const activeEnd = false ? '' : (p.active?.end ?? '');
 
     const proposalType = p.proposal?.gemini;
killedBy: mapPrograms shows the 1901–2099 sentinel bounds as blank dates, keeps a real range
statusReason: expected '2099-12-31' to be '' // Object.is equality

[Killed] LogicalOperator
src/gql/programs.ts:256:62
   return raw.programs.matches.map((p: ProgramItemFragment): Program => {
     // Hide the ODB's sentinel bounds (1901/2099) — they mean "not set yet".
     const activeStart = p.active?.start === '1901-01-01' ? '' : (p.active?.start ?? '');
-    const activeEnd = p.active?.end === '2099-12-31' ? '' : (p.active?.end ?? '');
+    const activeEnd = p.active?.end === '2099-12-31' ? '' : (p.active?.end && '');
 
     const proposalType = p.proposal?.gemini;
killedBy: mapPrograms shows the 1901–2099 sentinel bounds as blank dates, keeps a real range
statusReason: expected '' to be '2028-02-28' // Object.is equality

[Killed] MethodExpression
src/gql/programs.ts:262:31
     const queue = proposalType?.__typename === 'Queue' ? proposalType : null;
     const classical = proposalType?.__typename === 'Classical' ? proposalType : null;
 
-    const contactScientists = p.users
-      .filter((u) => CONTACT_SCIENTIST_ROLES.has(u.role))
+    const contactScientists = p.users
       .map((u) => ({
         name: [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '),
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [ Array(3) ] to deeply equal [ { name: 'Bob Contact', …(2) } ]

[Survived] MethodExpression
src/gql/programs.ts:262:31
     const queue = proposalType?.__typename === 'Queue' ? proposalType : null;
     const classical = proposalType?.__typename === 'Classical' ? proposalType : null;
 
-    const contactScientists = p.users
-      .filter((u) => CONTACT_SCIENTIST_ROLES.has(u.role))
-      .map((u) => ({
-        name: [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '),
-        userId: u.user?.id,
-        programUserId: u.id,
-      }))
-      .filter((c) => c.name.length > 0);
+    const contactScientists = p.users.filter(u => CONTACT_SCIENTIST_ROLES.has(u.role)).map(u => ({
+  name: [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '),
+  userId: u.user?.id,
+  programUserId: u.id
+}));
 
     const thesisInvestigators = p.users

[Killed] ArrowFunction
src/gql/programs.ts:263:15
     const classical = proposalType?.__typename === 'Classical' ? proposalType : null;
 
     const contactScientists = p.users
-      .filter((u) => CONTACT_SCIENTIST_ROLES.has(u.role))
+      .filter(() => undefined)
       .map((u) => ({
         name: [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '),
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [] to deeply equal [ { name: 'Bob Contact', …(2) } ]

[Survived] OptionalChaining
src/gql/programs.ts:265:16
     const contactScientists = p.users
       .filter((u) => CONTACT_SCIENTIST_ROLES.has(u.role))
       .map((u) => ({
-        name: [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '),
+        name: [u.user?.profile.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '),
         userId: u.user?.id,
         programUserId: u.id,

[Survived] OptionalChaining
src/gql/programs.ts:265:44
     const contactScientists = p.users
       .filter((u) => CONTACT_SCIENTIST_ROLES.has(u.role))
       .map((u) => ({
-        name: [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '),
+        name: [u.user?.profile?.givenName, u.user?.profile.familyName].filter(Boolean).join(' '),
         userId: u.user?.id,
         programUserId: u.id,

[Killed] ConditionalExpression
src/gql/programs.ts:269:22
         userId: u.user?.id,
         programUserId: u.id,
       }))
-      .filter((c) => c.name.length > 0);
+      .filter((c) => false);
 
     const thesisInvestigators = p.users
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [] to deeply equal [ { name: 'Bob Contact', …(2) } ]

[Killed] EqualityOperator
src/gql/programs.ts:269:22
         userId: u.user?.id,
         programUserId: u.id,
       }))
-      .filter((c) => c.name.length > 0);
+      .filter((c) => c.name.length <= 0);
 
     const thesisInvestigators = p.users
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [] to deeply equal [ { name: 'Bob Contact', …(2) } ]

[Killed] MethodExpression
src/gql/programs.ts:271:33
       }))
       .filter((c) => c.name.length > 0);
 
-    const thesisInvestigators = p.users
-      .filter((u) => u.thesis === true)
+    const thesisInvestigators = p.users
       .map((u) => [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '))
       .filter((name) => name.length > 0);
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [ 'Ada Lovelace', 'Bob Contact', …(1) ] to deeply equal [ 'Cleo Student' ]

[Survived] MethodExpression
src/gql/programs.ts:271:33
       }))
       .filter((c) => c.name.length > 0);
 
-    const thesisInvestigators = p.users
-      .filter((u) => u.thesis === true)
-      .map((u) => [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '))
-      .filter((name) => name.length > 0);
+    const thesisInvestigators = p.users.filter(u => u.thesis === true).map(u => [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '));
 
     const privateNote = p.notes.find((n) => n.isPrivate);

[Killed] ConditionalExpression
src/gql/programs.ts:272:22
       .filter((c) => c.name.length > 0);
 
     const thesisInvestigators = p.users
-      .filter((u) => u.thesis === true)
+      .filter((u) => true)
       .map((u) => [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '))
       .filter((name) => name.length > 0);
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [ 'Ada Lovelace', 'Bob Contact', …(1) ] to deeply equal [ 'Cleo Student' ]

[Killed] EqualityOperator
src/gql/programs.ts:272:22
       .filter((c) => c.name.length > 0);
 
     const thesisInvestigators = p.users
-      .filter((u) => u.thesis === true)
+      .filter((u) => u.thesis !== true)
       .map((u) => [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '))
       .filter((name) => name.length > 0);
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [ 'Ada Lovelace', 'Bob Contact' ] to deeply equal [ 'Cleo Student' ]

[Survived] MethodExpression
src/gql/programs.ts:273:19
 
     const thesisInvestigators = p.users
       .filter((u) => u.thesis === true)
-      .map((u) => [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '))
+      .map((u) => [u.user?.profile?.givenName, u.user?.profile?.familyName].join(' '))
       .filter((name) => name.length > 0);
 

[Survived] OptionalChaining
src/gql/programs.ts:273:48
 
     const thesisInvestigators = p.users
       .filter((u) => u.thesis === true)
-      .map((u) => [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '))
+      .map((u) => [u.user?.profile?.givenName, u.user?.profile.familyName].filter(Boolean).join(' '))
       .filter((name) => name.length > 0);
 

[Killed] ConditionalExpression
src/gql/programs.ts:274:25
     const thesisInvestigators = p.users
       .filter((u) => u.thesis === true)
       .map((u) => [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '))
-      .filter((name) => name.length > 0);
+      .filter((name) => false);
 
     const privateNote = p.notes.find((n) => n.isPrivate);
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [] to deeply equal [ 'Cleo Student' ]

[Killed] ArrowFunction
src/gql/programs.ts:274:15
     const thesisInvestigators = p.users
       .filter((u) => u.thesis === true)
       .map((u) => [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '))
-      .filter((name) => name.length > 0);
+      .filter(() => undefined);
 
     const privateNote = p.notes.find((n) => n.isPrivate);
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [] to deeply equal [ 'Cleo Student' ]

[Killed] ArrowFunction
src/gql/programs.ts:276:38
       .map((u) => [u.user?.profile?.givenName, u.user?.profile?.familyName].filter(Boolean).join(' '))
       .filter((name) => name.length > 0);
 
-    const privateNote = p.notes.find((n) => n.isPrivate);
+    const privateNote = p.notes.find(() => undefined);
     const piProfile = p.pi?.user?.profile;
     const pi = [piProfile?.givenName, piProfile?.familyName].filter(Boolean).join(' ') || '(unknown PI)';
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected '' to be 'internal note' // Object.is equality

[Killed] LogicalOperator
src/gql/programs.ts:278:16
 
     const privateNote = p.notes.find((n) => n.isPrivate);
     const piProfile = p.pi?.user?.profile;
-    const pi = [piProfile?.givenName, piProfile?.familyName].filter(Boolean).join(' ') || '(unknown PI)';
+    const pi = [piProfile?.givenName, piProfile?.familyName].filter(Boolean).join(' ') && '(unknown PI)';
 
     return {
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected '(unknown PI)' to be 'Grace Hopper' // Object.is equality

[Killed] MethodExpression
src/gql/programs.ts:278:16
 
     const privateNote = p.notes.find((n) => n.isPrivate);
     const piProfile = p.pi?.user?.profile;
-    const pi = [piProfile?.givenName, piProfile?.familyName].filter(Boolean).join(' ') || '(unknown PI)';
+    const pi = [piProfile?.givenName, piProfile?.familyName].join(' ') || '(unknown PI)';
 
     return {
killedBy: mapPrograms treats Classical proposals as CLASSICAL with no ToO/Band-3 (those are Queue-only)
statusReason: expected ' ' to be '(unknown PI)' // Object.is equality

[Killed] LogicalOperator
src/gql/programs.ts:293:26
       contactScientists,
       activeStart,
       activeEnd,
-      proprietaryMonths: p.goa?.proprietaryMonths ?? 0,
+      proprietaryMonths: p.goa?.proprietaryMonths && 0,
       considerForBand3: queue?.considerForBand3 === 'CONSIDER',
       minPercentTime: queue?.minPercentTime ?? classical?.minPercentTime ?? 100,
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected +0 to be 6 // Object.is equality

[Survived] OptionalChaining
src/gql/programs.ts:293:26
       contactScientists,
       activeStart,
       activeEnd,
-      proprietaryMonths: p.goa?.proprietaryMonths ?? 0,
+      proprietaryMonths: p.goa.proprietaryMonths ?? 0,
       considerForBand3: queue?.considerForBand3 === 'CONSIDER',
       minPercentTime: queue?.minPercentTime ?? classical?.minPercentTime ?? 100,

[Killed] ConditionalExpression
src/gql/programs.ts:294:25
       activeStart,
       activeEnd,
       proprietaryMonths: p.goa?.proprietaryMonths ?? 0,
-      considerForBand3: queue?.considerForBand3 === 'CONSIDER',
+      considerForBand3: true,
       minPercentTime: queue?.minPercentTime ?? classical?.minPercentTime ?? 100,
       privateHeader: p.goa?.privateHeader ?? false,
killedBy: mapPrograms treats Classical proposals as CLASSICAL with no ToO/Band-3 (those are Queue-only)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/gql/programs.ts:294:25
       activeStart,
       activeEnd,
       proprietaryMonths: p.goa?.proprietaryMonths ?? 0,
-      considerForBand3: queue?.considerForBand3 === 'CONSIDER',
+      considerForBand3: false,
       minPercentTime: queue?.minPercentTime ?? classical?.minPercentTime ?? 100,
       privateHeader: p.goa?.privateHeader ?? false,
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/gql/programs.ts:296:22
       proprietaryMonths: p.goa?.proprietaryMonths ?? 0,
       considerForBand3: queue?.considerForBand3 === 'CONSIDER',
       minPercentTime: queue?.minPercentTime ?? classical?.minPercentTime ?? 100,
-      privateHeader: p.goa?.privateHeader ?? false,
+      privateHeader: p.goa?.privateHeader && false,
       thesisInvestigators,
       privateNote: privateNote?.text ?? '',
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/gql/programs.ts:296:46
       proprietaryMonths: p.goa?.proprietaryMonths ?? 0,
       considerForBand3: queue?.considerForBand3 === 'CONSIDER',
       minPercentTime: queue?.minPercentTime ?? classical?.minPercentTime ?? 100,
-      privateHeader: p.goa?.privateHeader ?? false,
+      privateHeader: p.goa?.privateHeader ?? true,
       thesisInvestigators,
       privateNote: privateNote?.text ?? '',

[Killed] ConditionalExpression
src/gql/programs.ts:301:24
       privateNote: privateNote?.text ?? '',
       privateNoteId: privateNote?.id ?? null,
       allocations: (p.allocations ?? [])
-        .filter((a) => a.scienceBand !== null)
+        .filter((a) => false)
         .map((a) => ({
           category: a.category as Program['allocations'][number]['category'],
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [] to deeply equal [ { category: 'US', …(2) } ]

[Killed] EqualityOperator
src/gql/programs.ts:301:24
       privateNote: privateNote?.text ?? '',
       privateNoteId: privateNote?.id ?? null,
       allocations: (p.allocations ?? [])
-        .filter((a) => a.scienceBand !== null)
+        .filter((a) => a.scienceBand === null)
         .map((a) => ({
           category: a.category as Program['allocations'][number]['category'],
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [] to deeply equal [ { category: 'US', …(2) } ]

[Killed] ArithmeticOperator
src/gql/programs.ts:305:18
         .map((a) => ({
           category: a.category as Program['allocations'][number]['category'],
           scienceBand: a.scienceBand,
-          hours: Math.round(Number(a.duration?.hours ?? 0) * 10) / 10,
+          hours: Math.round(Number(a.duration?.hours ?? 0) * 10) * 10,
         })),
     };
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [ { category: 'US', …(2) } ] to deeply equal [ { category: 'US', …(2) } ]

[Killed] LogicalOperator
src/gql/programs.ts:305:36
         .map((a) => ({
           category: a.category as Program['allocations'][number]['category'],
           scienceBand: a.scienceBand,
-          hours: Math.round(Number(a.duration?.hours ?? 0) * 10) / 10,
+          hours: Math.round(Number(a.duration?.hours && 0) * 10) / 10,
         })),
     };
killedBy: mapPrograms projects a Queue program, reading contact scientists from SUPPORT roles and thesis from ProgramUser
statusReason: expected [ { category: 'US', …(2) } ] to deeply equal [ { category: 'US', …(2) } ]
