[Timeout] BlockStatement
src/gql/proposals.ts:62:41
  *  Change Requests "received" timestamp) — omitted rather than faked. */
 export function mapProposals(raw: AdminProposalsResult): Proposal[] {
   const out: Proposal[] = [];
-  for (const p of raw.programs.matches) {
-    const subtype = p.proposal?.gemini?.scienceSubtype;
-    const type = subtype ? SPECIAL_SUBTYPES[subtype] : undefined;
-    if (!p.proposal || !type) continue; // special proposals only
-    const prof = p.pi?.user?.profile;
-    const reference = p.proposal.reference?.label ?? p.id;
-    out.push({
-      id: p.id,
-      reference,
-      semester: semesterOfReference(reference),
-      pi: [prof?.givenName, prof?.familyName].filter(Boolean).join(' ') || '(unknown PI)',
-      title: p.name ?? '(untitled)',
-      type,
-      status: p.proposalStatus,
-      abstract: p.description ?? '',
-      observations: p.observations.matches.map(mapObservationRow),
-    });
-  }
+  for (const p of raw.programs.matches) {}
   return out;
 }

[Timeout] LogicalOperator
src/gql/proposals.ts:72:11
       id: p.id,
       reference,
       semester: semesterOfReference(reference),
-      pi: [prof?.givenName, prof?.familyName].filter(Boolean).join(' ') || '(unknown PI)',
+      pi: [prof?.givenName, prof?.familyName].filter(Boolean).join(' ') && '(unknown PI)',
       title: p.name ?? '(untitled)',
       type,

[Timeout] MethodExpression
src/gql/proposals.ts:72:11
       id: p.id,
       reference,
       semester: semesterOfReference(reference),
-      pi: [prof?.givenName, prof?.familyName].filter(Boolean).join(' ') || '(unknown PI)',
+      pi: [prof?.givenName, prof?.familyName].join(' ') || '(unknown PI)',
       title: p.name ?? '(untitled)',
       type,

[NoCoverage] StringLiteral
src/gql/proposals.ts:73:24
       reference,
       semester: semesterOfReference(reference),
       pi: [prof?.givenName, prof?.familyName].filter(Boolean).join(' ') || '(unknown PI)',
-      title: p.name ?? '(untitled)',
+      title: p.name ?? "",
       type,
       status: p.proposalStatus,

[NoCoverage] StringLiteral
src/gql/proposals.ts:76:34
       title: p.name ?? '(untitled)',
       type,
       status: p.proposalStatus,
-      abstract: p.description ?? '',
+      abstract: p.description ?? "Stryker was here!",
       observations: p.observations.matches.map(mapObservationRow),
     });

[Killed] Regex
src/gql/proposals.ts:103:13
 /** Semester token of a proposal reference ("G-2027B-0123" → "2027B"); "—"
  *  for internal-id fallbacks that carry no semester. */
 export function semesterOfReference(reference: string): string {
-  const m = /-(\d{4}[AB])/.exec(reference);
+  const m = /-(\d[AB])/.exec(reference);
   return m ? m[1]! : '—';
 }
killedBy: mapProposals projects only special-subtype proposals, with abstract + observation rows
statusReason: expected '—' to be '2027B' // Object.is equality

[Killed] Regex
src/gql/proposals.ts:103:13
 /** Semester token of a proposal reference ("G-2027B-0123" → "2027B"); "—"
  *  for internal-id fallbacks that carry no semester. */
 export function semesterOfReference(reference: string): string {
-  const m = /-(\d{4}[AB])/.exec(reference);
+  const m = /-(\D{4}[AB])/.exec(reference);
   return m ? m[1]! : '—';
 }
killedBy: mapProposals projects only special-subtype proposals, with abstract + observation rows
statusReason: expected '—' to be '2027B' // Object.is equality

[Killed] StringLiteral
src/gql/proposals.ts:104:22
  *  for internal-id fallbacks that carry no semester. */
 export function semesterOfReference(reference: string): string {
   const m = /-(\d{4}[AB])/.exec(reference);
-  return m ? m[1]! : '—';
+  return m ? m[1]! : "";
 }
 
killedBy: semesterOfReference parses the semester token, degrading to an em-dash
statusReason: expected '' to be '—' // Object.is equality
