[Killed] LogicalOperator
src/gql/shared.ts:17:10
  *  Programs/CfP/Proposals/Change Requests. Unknown values (a future enum
  *  addition) pass through unchanged rather than rendering blank. */
 export function normalizeInstrument(name: string): string {
-  return INSTRUMENT_LABEL[name as Instrument] ?? name;
+  return INSTRUMENT_LABEL[name as Instrument] && name;
 }
 
killedBy: mapObservationsById keys observation rows by id, with coordinates, config, and conditions; mapProposals projects only special-subtype proposals, with abstract + observation rows; mapObservationRow states the instrument once, with the observing mode as a short suffix
statusReason: expected { id: 'o-9c5', …(10) } to deeply equal { id: 'o-9c5', …(10) }

[Survived] StringLiteral
src/gql/shared.ts:25:14
  *  bound instead of fabricating one. Source: lucuma-core ImageQuality.scala. */
 const IMAGE_QUALITY_ARCSEC: Record<ImageQualityPreset, string> = {
   POINT_ONE: '0.1',
-  POINT_TWO: '0.2',
+  POINT_TWO: "",
   POINT_THREE: '0.3',
   POINT_FOUR: '0.4',

[Survived] StringLiteral
src/gql/shared.ts:28:14
   POINT_TWO: '0.2',
   POINT_THREE: '0.3',
   POINT_FOUR: '0.4',
-  POINT_SIX: '0.6',
+  POINT_SIX: "",
   POINT_EIGHT: '0.8',
   ONE_POINT_ZERO: '1.0',

[Survived] StringLiteral
src/gql/shared.ts:32:19
   POINT_EIGHT: '0.8',
   ONE_POINT_ZERO: '1.0',
   ONE_POINT_TWO: '1.2',
-  ONE_POINT_FIVE: '1.5',
+  ONE_POINT_FIVE: "",
   TWO_POINT_ZERO: '2.0',
 };

[Survived] StringLiteral
src/gql/shared.ts:38:9
 
 /** CloudExtinction.Preset's fixed percentile (lucuma-core CloudExtinction.scala). */
 const CLOUD_EXTINCTION_PERCENT: Record<CloudExtinctionPreset, string> = {
-  ZERO: '50',
+  ZERO: "",
   POINT_ONE: '55',
   POINT_THREE: '70',

[Survived] StringLiteral
src/gql/shared.ts:39:14
 /** CloudExtinction.Preset's fixed percentile (lucuma-core CloudExtinction.scala). */
 const CLOUD_EXTINCTION_PERCENT: Record<CloudExtinctionPreset, string> = {
   ZERO: '50',
-  POINT_ONE: '55',
+  POINT_ONE: "",
   POINT_THREE: '70',
   POINT_FIVE: '75',

[Killed] StringLiteral
src/gql/shared.ts:40:16
 const CLOUD_EXTINCTION_PERCENT: Record<CloudExtinctionPreset, string> = {
   ZERO: '50',
   POINT_ONE: '55',
-  POINT_THREE: '70',
+  POINT_THREE: "",
   POINT_FIVE: '75',
   ONE_POINT_ZERO: '80',
killedBy: mapObservationsById keys observation rows by id, with coordinates, config, and conditions
statusReason: expected { id: 'o-9c5', …(10) } to deeply equal { id: 'o-9c5', …(10) }

[Survived] StringLiteral
src/gql/shared.ts:42:19
   POINT_ONE: '55',
   POINT_THREE: '70',
   POINT_FIVE: '75',
-  ONE_POINT_ZERO: '80',
+  ONE_POINT_ZERO: "",
   TWO_POINT_ZERO: '95',
   THREE_POINT_ZERO: '100',

[Timeout] StringLiteral
src/gql/shared.ts:44:21
   POINT_FIVE: '75',
   ONE_POINT_ZERO: '80',
   TWO_POINT_ZERO: '95',
-  THREE_POINT_ZERO: '100',
+  THREE_POINT_ZERO: "",
 };
 

[Survived] StringLiteral
src/gql/shared.ts:49:12
 
 /** SkyBackground's fixed percentile (lucuma-core SkyBackground.scala). */
 const SKY_BACKGROUND_PERCENT: Record<SkyBackground, string> = {
-  DARKEST: '20',
+  DARKEST: "",
   DARK: '50',
   GRAY: '80',

[Survived] StringLiteral
src/gql/shared.ts:50:9
 /** SkyBackground's fixed percentile (lucuma-core SkyBackground.scala). */
 const SKY_BACKGROUND_PERCENT: Record<SkyBackground, string> = {
   DARKEST: '20',
-  DARK: '50',
+  DARK: "",
   GRAY: '80',
   BRIGHT: '100',

[Timeout] StringLiteral
src/gql/shared.ts:52:11
   DARKEST: '20',
   DARK: '50',
   GRAY: '80',
-  BRIGHT: '100',
+  BRIGHT: "",
 };
 

[Survived] StringLiteral
src/gql/shared.ts:85:51
  *  mode suffix ("LongSlit"). The complete enum (enforced by the Record) so a
  *  new mode is a compile error here, not a silently wrong Config cell. */
 export const MODE_TYPE_FORMAT: Record<ObservingModeType, { readonly instrument: string; readonly mode: string }> = {
-  ALOPEKE_SPECKLE: { instrument: 'Alopeke', mode: 'Speckle' },
+  ALOPEKE_SPECKLE: { instrument: 'Alopeke', mode: "" },
   ALOPEKE_WIDE_FIELD: { instrument: 'Alopeke', mode: 'WideField' },
   EXCHANGE_KECK: { instrument: 'Keck', mode: '' },

[Survived] StringLiteral
src/gql/shared.ts:87:46
 export const MODE_TYPE_FORMAT: Record<ObservingModeType, { readonly instrument: string; readonly mode: string }> = {
   ALOPEKE_SPECKLE: { instrument: 'Alopeke', mode: 'Speckle' },
   ALOPEKE_WIDE_FIELD: { instrument: 'Alopeke', mode: 'WideField' },
-  EXCHANGE_KECK: { instrument: 'Keck', mode: '' },
+  EXCHANGE_KECK: { instrument: 'Keck', mode: "Stryker was here!" },
   EXCHANGE_SUBARU: { instrument: 'Subaru', mode: '' },
   FLAMINGOS_2_IMAGING: { instrument: 'Flamingos-2', mode: 'Imaging' },

[Timeout] StringLiteral
src/gql/shared.ts:89:38
   ALOPEKE_WIDE_FIELD: { instrument: 'Alopeke', mode: 'WideField' },
   EXCHANGE_KECK: { instrument: 'Keck', mode: '' },
   EXCHANGE_SUBARU: { instrument: 'Subaru', mode: '' },
-  FLAMINGOS_2_IMAGING: { instrument: 'Flamingos-2', mode: 'Imaging' },
+  FLAMINGOS_2_IMAGING: { instrument: "", mode: 'Imaging' },
   FLAMINGOS_2_LONG_SLIT: { instrument: 'Flamingos-2', mode: 'LongSlit' },
   GHOST_IFU: { instrument: 'GHOST', mode: 'Ifu' },

[Timeout] StringLiteral
src/gql/shared.ts:90:61
   EXCHANGE_KECK: { instrument: 'Keck', mode: '' },
   EXCHANGE_SUBARU: { instrument: 'Subaru', mode: '' },
   FLAMINGOS_2_IMAGING: { instrument: 'Flamingos-2', mode: 'Imaging' },
-  FLAMINGOS_2_LONG_SLIT: { instrument: 'Flamingos-2', mode: 'LongSlit' },
+  FLAMINGOS_2_LONG_SLIT: { instrument: 'Flamingos-2', mode: "" },
   GHOST_IFU: { instrument: 'GHOST', mode: 'Ifu' },
   GMOS_NORTH_IMAGING: { instrument: 'GMOS-N', mode: 'Imaging' },

[Timeout] StringLiteral
src/gql/shared.ts:91:43
   EXCHANGE_SUBARU: { instrument: 'Subaru', mode: '' },
   FLAMINGOS_2_IMAGING: { instrument: 'Flamingos-2', mode: 'Imaging' },
   FLAMINGOS_2_LONG_SLIT: { instrument: 'Flamingos-2', mode: 'LongSlit' },
-  GHOST_IFU: { instrument: 'GHOST', mode: 'Ifu' },
+  GHOST_IFU: { instrument: 'GHOST', mode: "" },
   GMOS_NORTH_IMAGING: { instrument: 'GMOS-N', mode: 'Imaging' },
   GMOS_NORTH_LONG_SLIT: { instrument: 'GMOS-N', mode: 'LongSlit' },

[Timeout] StringLiteral
src/gql/shared.ts:91:28
   EXCHANGE_SUBARU: { instrument: 'Subaru', mode: '' },
   FLAMINGOS_2_IMAGING: { instrument: 'Flamingos-2', mode: 'Imaging' },
   FLAMINGOS_2_LONG_SLIT: { instrument: 'Flamingos-2', mode: 'LongSlit' },
-  GHOST_IFU: { instrument: 'GHOST', mode: 'Ifu' },
+  GHOST_IFU: { instrument: "", mode: 'Ifu' },
   GMOS_NORTH_IMAGING: { instrument: 'GMOS-N', mode: 'Imaging' },
   GMOS_NORTH_LONG_SLIT: { instrument: 'GMOS-N', mode: 'LongSlit' },

[Killed] StringLiteral
src/gql/shared.ts:93:55
   FLAMINGOS_2_LONG_SLIT: { instrument: 'Flamingos-2', mode: 'LongSlit' },
   GHOST_IFU: { instrument: 'GHOST', mode: 'Ifu' },
   GMOS_NORTH_IMAGING: { instrument: 'GMOS-N', mode: 'Imaging' },
-  GMOS_NORTH_LONG_SLIT: { instrument: 'GMOS-N', mode: 'LongSlit' },
+  GMOS_NORTH_LONG_SLIT: { instrument: 'GMOS-N', mode: "" },
   GMOS_SOUTH_IMAGING: { instrument: 'GMOS-S', mode: 'Imaging' },
   GMOS_SOUTH_LONG_SLIT: { instrument: 'GMOS-S', mode: 'LongSlit' },
killedBy: mapObservationsById keys observation rows by id, with coordinates, config, and conditions
statusReason: expected { id: 'o-9c5', …(10) } to deeply equal { id: 'o-9c5', …(10) }

[Timeout] StringLiteral
src/gql/shared.ts:93:39
   FLAMINGOS_2_LONG_SLIT: { instrument: 'Flamingos-2', mode: 'LongSlit' },
   GHOST_IFU: { instrument: 'GHOST', mode: 'Ifu' },
   GMOS_NORTH_IMAGING: { instrument: 'GMOS-N', mode: 'Imaging' },
-  GMOS_NORTH_LONG_SLIT: { instrument: 'GMOS-N', mode: 'LongSlit' },
+  GMOS_NORTH_LONG_SLIT: { instrument: "", mode: 'LongSlit' },
   GMOS_SOUTH_IMAGING: { instrument: 'GMOS-S', mode: 'Imaging' },
   GMOS_SOUTH_LONG_SLIT: { instrument: 'GMOS-S', mode: 'LongSlit' },

[Survived] StringLiteral
src/gql/shared.ts:98:34
   GMOS_SOUTH_LONG_SLIT: { instrument: 'GMOS-S', mode: 'LongSlit' },
   GNIRS_IFU: { instrument: 'GNIRS', mode: 'Ifu' },
   GNIRS_IMAGING: { instrument: 'GNIRS', mode: 'Imaging' },
-  GNIRS_LONG_SLIT: { instrument: 'GNIRS', mode: 'LongSlit' },
+  GNIRS_LONG_SLIT: { instrument: "", mode: 'LongSlit' },
   IGRINS_2_LONG_SLIT: { instrument: 'IGRINS-2', mode: 'LongSlit' },
   MAROON_X: { instrument: 'MAROON-X', mode: '' },

[Survived] StringLiteral
src/gql/shared.ts:98:49
   GMOS_SOUTH_LONG_SLIT: { instrument: 'GMOS-S', mode: 'LongSlit' },
   GNIRS_IFU: { instrument: 'GNIRS', mode: 'Ifu' },
   GNIRS_IMAGING: { instrument: 'GNIRS', mode: 'Imaging' },
-  GNIRS_LONG_SLIT: { instrument: 'GNIRS', mode: 'LongSlit' },
+  GNIRS_LONG_SLIT: { instrument: 'GNIRS', mode: "" },
   IGRINS_2_LONG_SLIT: { instrument: 'IGRINS-2', mode: 'LongSlit' },
   MAROON_X: { instrument: 'MAROON-X', mode: '' },

[Survived] StringLiteral
src/gql/shared.ts:99:37
   GNIRS_IFU: { instrument: 'GNIRS', mode: 'Ifu' },
   GNIRS_IMAGING: { instrument: 'GNIRS', mode: 'Imaging' },
   GNIRS_LONG_SLIT: { instrument: 'GNIRS', mode: 'LongSlit' },
-  IGRINS_2_LONG_SLIT: { instrument: 'IGRINS-2', mode: 'LongSlit' },
+  IGRINS_2_LONG_SLIT: { instrument: "", mode: 'LongSlit' },
   MAROON_X: { instrument: 'MAROON-X', mode: '' },
   VISITOR_NORTH: { instrument: 'Visitor North', mode: '' },

[Killed] StringLiteral
src/gql/shared.ts:100:45
   GNIRS_IMAGING: { instrument: 'GNIRS', mode: 'Imaging' },
   GNIRS_LONG_SLIT: { instrument: 'GNIRS', mode: 'LongSlit' },
   IGRINS_2_LONG_SLIT: { instrument: 'IGRINS-2', mode: 'LongSlit' },
-  MAROON_X: { instrument: 'MAROON-X', mode: '' },
+  MAROON_X: { instrument: 'MAROON-X', mode: "Stryker was here!" },
   VISITOR_NORTH: { instrument: 'Visitor North', mode: '' },
   VISITOR_SOUTH: { instrument: 'Visitor South', mode: '' },
killedBy: formatModeType renders instrument + configuration style
statusReason: expected 'MAROON-X Stryker was here!' to be 'MAROON-X' // Object.is equality

[Survived] StringLiteral
src/gql/shared.ts:101:55
   GNIRS_LONG_SLIT: { instrument: 'GNIRS', mode: 'LongSlit' },
   IGRINS_2_LONG_SLIT: { instrument: 'IGRINS-2', mode: 'LongSlit' },
   MAROON_X: { instrument: 'MAROON-X', mode: '' },
-  VISITOR_NORTH: { instrument: 'Visitor North', mode: '' },
+  VISITOR_NORTH: { instrument: 'Visitor North', mode: "Stryker was here!" },
   VISITOR_SOUTH: { instrument: 'Visitor South', mode: '' },
   ZORRO_SPECKLE: { instrument: 'Zorro', mode: 'Speckle' },

[Survived] StringLiteral
src/gql/shared.ts:102:55
   IGRINS_2_LONG_SLIT: { instrument: 'IGRINS-2', mode: 'LongSlit' },
   MAROON_X: { instrument: 'MAROON-X', mode: '' },
   VISITOR_NORTH: { instrument: 'Visitor North', mode: '' },
-  VISITOR_SOUTH: { instrument: 'Visitor South', mode: '' },
+  VISITOR_SOUTH: { instrument: 'Visitor South', mode: "Stryker was here!" },
   ZORRO_SPECKLE: { instrument: 'Zorro', mode: 'Speckle' },
   ZORRO_WIDE_FIELD: { instrument: 'Zorro', mode: 'WideField' },

[Survived] StringLiteral
src/gql/shared.ts:104:50
   VISITOR_NORTH: { instrument: 'Visitor North', mode: '' },
   VISITOR_SOUTH: { instrument: 'Visitor South', mode: '' },
   ZORRO_SPECKLE: { instrument: 'Zorro', mode: 'Speckle' },
-  ZORRO_WIDE_FIELD: { instrument: 'Zorro', mode: 'WideField' },
+  ZORRO_WIDE_FIELD: { instrument: 'Zorro', mode: "" },
 };
 

[Killed] ConditionalExpression
src/gql/shared.ts:110:10
 /** Narrow a wire value (the fragment types carry `string` for
  *  observingMode.mode) into the enum, or null when it isn't one. */
 export function asObservingModeType(mode: string | null): ObservingModeType | null {
-  return mode !== null && Object.hasOwn(MODE_TYPE_FORMAT, mode) ? (mode as ObservingModeType) : null;
+  return false ? (mode as ObservingModeType) : null;
 }
 
killedBy: mapObservationsById keys observation rows by id, with coordinates, config, and conditions; mapObservationRow states the instrument once, with the observing mode as a short suffix
statusReason: expected { id: 'o-9c5', …(10) } to deeply equal { id: 'o-9c5', …(10) }

[Survived] ConditionalExpression
src/gql/shared.ts:110:10
 /** Narrow a wire value (the fragment types carry `string` for
  *  observingMode.mode) into the enum, or null when it isn't one. */
 export function asObservingModeType(mode: string | null): ObservingModeType | null {
-  return mode !== null && Object.hasOwn(MODE_TYPE_FORMAT, mode) ? (mode as ObservingModeType) : null;
+  return true ? (mode as ObservingModeType) : null;
 }
 

[Survived] OptionalChaining
src/gql/shared.ts:169:18
 /** Map one observation (selected via ObservationItem) to the shared
  *  table row. Non-sidereal targets have no fixed RA/Dec — shown as "—". */
 export function mapObservationRow(o: ObservationItemFragment): ObservationRow {
-  const target = o.targetEnvironment?.firstScienceTarget;
+  const target = o.targetEnvironment.firstScienceTarget;
   const instrument = o.instrument ? normalizeInstrument(o.instrument) : '—';
   const modeSuffix = observingModeSuffix(o.observingMode?.mode ?? null);

[Killed] ArithmeticOperator
src/gql/shared.ts:183:23
     instrument,
     config: modeSuffix ? `${instrument}, ${modeSuffix}` : instrument,
     conditions: formatConditions(o.constraintSet),
-    hours: Math.round(Number(o.observationDuration?.hours ?? 0) * 10) / 10,
+    hours: Math.round(Number(o.observationDuration?.hours ?? 0) / 10) / 10,
   };
 }
killedBy: mapProposals projects only special-subtype proposals, with abstract + observation rows
statusReason: expected { id: 'o-1db', …(10) } to match object { id: 'o-1db', …(8) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/gql/shared.ts:183:30
     instrument,
     config: modeSuffix ? `${instrument}, ${modeSuffix}` : instrument,
     conditions: formatConditions(o.constraintSet),
-    hours: Math.round(Number(o.observationDuration?.hours ?? 0) * 10) / 10,
+    hours: Math.round(Number(o.observationDuration?.hours && 0) * 10) / 10,
   };
 }
killedBy: mapProposals projects only special-subtype proposals, with abstract + observation rows; mapObservationsById keys observation rows by id, with coordinates, config, and conditions
statusReason: expected { id: 'o-1db', …(10) } to match object { id: 'o-1db', …(8) }
(2 matching properties omitted from actual)
