[Survived] ArrayDeclaration
src/gql/sso/roster.ts:22:45
 // The schema enums the roster models with, re-exported for the views.
 export type { Partner, RoleType };
 
-export const PARTNERS: readonly Partner[] = ['AR', 'BR', 'CA', 'CL', 'KR', 'UH', 'US'];
+export const PARTNERS: readonly Partner[] = [];
 
 /** Full partner names, for labels and tooltips. */

[Survived] StringLiteral
src/gql/sso/roster.ts:27:7
 /** Full partner names, for labels and tooltips. */
 export const PARTNER_NAME: Record<Partner, string> = {
   AR: 'Argentina',
-  BR: 'Brazil',
+  BR: "",
   CA: 'Canada',
   CL: 'Chile',

[Survived] StringLiteral
src/gql/sso/roster.ts:28:7
 export const PARTNER_NAME: Record<Partner, string> = {
   AR: 'Argentina',
   BR: 'Brazil',
-  CA: 'Canada',
+  CA: "",
   CL: 'Chile',
   KR: 'Korea',

[Survived] StringLiteral
src/gql/sso/roster.ts:31:7
   CA: 'Canada',
   CL: 'Chile',
   KR: 'Korea',
-  UH: 'University of Hawaii',
+  UH: "",
   US: 'United States',
 };

[Killed] StringLiteral
src/gql/sso/roster.ts:32:7
   CL: 'Chile',
   KR: 'Korea',
   UH: 'University of Hawaii',
-  US: 'United States',
+  US: "",
 };
 
killedBy: TimeAwardsGrid keeps a partner row visible when its only allocation is zeroed
statusReason: Cannot find element with locator: page.getByText('United States')

<body>
  
  


  <div>

[Timeout] ObjectLiteral
src/gql/sso/roster.ts:80:32
 /** Every user + their current roles, for the Users view and the
  *  contact-scientist type-ahead. */
 export function useUsers() {
-  return useQuery(USERS_QUERY, { ...SSO_CONTEXT, fetchPolicy: 'cache-and-network' });
+  return useQuery(USERS_QUERY, {});
 }
 

[NoCoverage] StringLiteral
src/gql/sso/roster.ts:86:39
 export function mapRosterUsers(raw: AdminUserRosterResult): RosterUser[] {
   return raw.users.map((u) => ({
     id: u.id,
-    givenName: u.profile.givenName ?? '',
+    givenName: u.profile.givenName ?? "Stryker was here!",
     familyName: u.profile.familyName ?? '',
     email: u.profile.email ?? '',

[NoCoverage] StringLiteral
src/gql/sso/roster.ts:88:31
     id: u.id,
     givenName: u.profile.givenName ?? '',
     familyName: u.profile.familyName ?? '',
-    email: u.profile.email ?? '',
+    email: u.profile.email ?? "Stryker was here!",
     orcidId: u.orcidId,
     roles: u.roles.map((r) => ({ id: r.id, type: r.type, ...(r.partner ? { partner: r.partner } : {}) })),

[NoCoverage] ObjectLiteral
src/gql/sso/roster.ts:90:74
     familyName: u.profile.familyName ?? '',
     email: u.profile.email ?? '',
     orcidId: u.orcidId,
-    roles: u.roles.map((r) => ({ id: r.id, type: r.type, ...(r.partner ? { partner: r.partner } : {}) })),
+    roles: u.roles.map((r) => ({ id: r.id, type: r.type, ...(r.partner ? {} : {}) })),
   }));
 }

[Survived] BooleanLiteral
src/gql/sso/roster.ts:103:111
 /** Grant a role. Refetches the roster so the new role (and its revocable
  *  RoleId) is on screen before the call resolves. */
 export function useAddRole() {
-  return useMutation(ADD_ROLE_MUTATION, { ...SSO_CONTEXT, refetchQueries: [USERS_QUERY], awaitRefetchQueries: true });
+  return useMutation(ADD_ROLE_MUTATION, { ...SSO_CONTEXT, refetchQueries: [USERS_QUERY], awaitRefetchQueries: false });
 }
 

[Survived] ArrayDeclaration
src/gql/sso/roster.ts:103:75
 /** Grant a role. Refetches the roster so the new role (and its revocable
  *  RoleId) is on screen before the call resolves. */
 export function useAddRole() {
-  return useMutation(ADD_ROLE_MUTATION, { ...SSO_CONTEXT, refetchQueries: [USERS_QUERY], awaitRefetchQueries: true });
+  return useMutation(ADD_ROLE_MUTATION, { ...SSO_CONTEXT, refetchQueries: [], awaitRefetchQueries: true });
 }
 

[Survived] ObjectLiteral
src/gql/sso/roster.ts:116:44
  *  a signed-in holder loses it on their next token renewal. PI roles can't
  *  be deleted. */
 export function useDeleteRole() {
-  return useMutation(DELETE_ROLE_MUTATION, {
-    ...SSO_CONTEXT,
-    refetchQueries: [USERS_QUERY],
-    awaitRefetchQueries: true,
-  });
+  return useMutation(DELETE_ROLE_MUTATION, {});
 }
 

[Survived] ArrayDeclaration
src/gql/sso/roster.ts:118:21
 export function useDeleteRole() {
   return useMutation(DELETE_ROLE_MUTATION, {
     ...SSO_CONTEXT,
-    refetchQueries: [USERS_QUERY],
+    refetchQueries: [],
     awaitRefetchQueries: true,
   });

[Survived] BooleanLiteral
src/gql/sso/roster.ts:119:26
   return useMutation(DELETE_ROLE_MUTATION, {
     ...SSO_CONTEXT,
     refetchQueries: [USERS_QUERY],
-    awaitRefetchQueries: true,
+    awaitRefetchQueries: false,
   });
 }
