[Survived] MethodExpression
src/gql/types.ts:100:28
 } as const satisfies Record<Instrument, string>;
 
 /** Instruments offerable on a call, in checklist (label) order. */
-export const INSTRUMENTS = (Object.keys(INSTRUMENT_LABEL) as readonly Instrument[])
-  .slice()
-  .sort((a, b) => INSTRUMENT_LABEL[a].localeCompare(INSTRUMENT_LABEL[b]));
+export const INSTRUMENTS = (Object.keys(INSTRUMENT_LABEL) as readonly Instrument[]).slice();
 
 // --- Programs view (ODB Program) ------------------------------------------

[Timeout] ArrayDeclaration
src/gql/types.ts:111:46
 export const PROGRAM_CLASSES: readonly ProgramClass[] = ['QUEUE', 'CLASSICAL'];
 export const PROGRAM_CLASS_LABEL: Record<ProgramClass, string> = { QUEUE: 'Queue', CLASSICAL: 'Classical' };
 
-export const BANDS: readonly ScienceBand[] = ['BAND1', 'BAND2', 'BAND3', 'BAND4'];
+export const BANDS: readonly ScienceBand[] = [];
 export const BAND_LABEL: Record<ScienceBand, string> = {
   BAND1: 'Band-1',

[Survived] StringLiteral
src/gql/types.ts:113:10
 
 export const BANDS: readonly ScienceBand[] = ['BAND1', 'BAND2', 'BAND3', 'BAND4'];
 export const BAND_LABEL: Record<ScienceBand, string> = {
-  BAND1: 'Band-1',
+  BAND1: "",
   BAND2: 'Band-2',
   BAND3: 'Band-3',

[Survived] StringLiteral
src/gql/types.ts:116:10
   BAND1: 'Band-1',
   BAND2: 'Band-2',
   BAND3: 'Band-3',
-  BAND4: 'Band-4',
+  BAND4: "",
 };
 

[Survived] ArrayDeclaration
src/gql/types.ts:126:55
   readonly hours: number;
 }
 
-export const TOO_STATUSES: readonly ToOActivation[] = ['NONE', 'STANDARD', 'RAPID'];
+export const TOO_STATUSES: readonly ToOActivation[] = [];
 export const TOO_LABEL: Record<ToOActivation, string> = { NONE: 'None', STANDARD: 'Standard', RAPID: 'Rapid' };
 

[Survived] StringLiteral
src/gql/types.ts:127:65
 }
 
 export const TOO_STATUSES: readonly ToOActivation[] = ['NONE', 'STANDARD', 'RAPID'];
-export const TOO_LABEL: Record<ToOActivation, string> = { NONE: 'None', STANDARD: 'Standard', RAPID: 'Rapid' };
+export const TOO_LABEL: Record<ToOActivation, string> = { NONE: "", STANDARD: 'Standard', RAPID: 'Rapid' };
 
 /** A contact scientist: an SSO/ODB user holding a SUPPORT_* ProgramUser role.

[Survived] StringLiteral
src/gql/types.ts:127:102
 }
 
 export const TOO_STATUSES: readonly ToOActivation[] = ['NONE', 'STANDARD', 'RAPID'];
-export const TOO_LABEL: Record<ToOActivation, string> = { NONE: 'None', STANDARD: 'Standard', RAPID: 'Rapid' };
+export const TOO_LABEL: Record<ToOActivation, string> = { NONE: 'None', STANDARD: 'Standard', RAPID: "" };
 
 /** A contact scientist: an SSO/ODB user holding a SUPPORT_* ProgramUser role.
