[Killed] MethodExpression
src/lib/geminiArchive.ts:33:45
 const MIN_RADIUS_ARCSEC = 60;
 
 function spec(instruments: readonly string[], mode: ArchiveMode, largestFovArcsec: number): ArchiveSearchSpec {
-  return { instruments, mode, radiusArcsec: Math.max(largestFovArcsec / 2, MIN_RADIUS_ARCSEC) };
+  return { instruments, mode, radiusArcsec: Math.min(largestFovArcsec / 2, MIN_RADIUS_ARCSEC) };
 }
 
killedBy: matchConflicts matches a similar mode within the field-of-view distance; archiveSearchSpec searches both GMOS sites with a single GMOS query
statusReason: expected [] to have a length of 1 but got +0

[Timeout] ArrayDeclaration
src/lib/geminiArchive.ts:45:30
   GMOS_NORTH_IMAGING: spec(['GMOS'], 'IMAGING', 330),
   GMOS_SOUTH_IMAGING: spec(['GMOS'], 'IMAGING', 330),
   GMOS_NORTH_LONG_SLIT: spec(['GMOS'], 'LS', 330),
-  GMOS_SOUTH_LONG_SLIT: spec(['GMOS'], 'LS', 330),
+  GMOS_SOUTH_LONG_SLIT: spec([], 'LS', 330),
   FLAMINGOS_2_IMAGING: spec(['F2', 'GNIRS'], 'IMAGING', 366),
   FLAMINGOS_2_LONG_SLIT: spec(['F2', 'GNIRS'], 'LS', 366),

[Timeout] StringLiteral
src/lib/geminiArchive.ts:45:31
   GMOS_NORTH_IMAGING: spec(['GMOS'], 'IMAGING', 330),
   GMOS_SOUTH_IMAGING: spec(['GMOS'], 'IMAGING', 330),
   GMOS_NORTH_LONG_SLIT: spec(['GMOS'], 'LS', 330),
-  GMOS_SOUTH_LONG_SLIT: spec(['GMOS'], 'LS', 330),
+  GMOS_SOUTH_LONG_SLIT: spec([""], 'LS', 330),
   FLAMINGOS_2_IMAGING: spec(['F2', 'GNIRS'], 'IMAGING', 366),
   FLAMINGOS_2_LONG_SLIT: spec(['F2', 'GNIRS'], 'LS', 366),

[Survived] StringLiteral
src/lib/geminiArchive.ts:51:29
   GNIRS_LONG_SLIT: spec(['GNIRS', 'F2'], 'LS', 99),
   IGRINS_2_LONG_SLIT: spec(['IGRINS-2'], 'LS', 60),
   ALOPEKE_SPECKLE: spec(['Alopeke', 'Zorro'], 'IMAGING', 7),
-  ALOPEKE_WIDE_FIELD: spec(['Alopeke', 'Zorro'], 'IMAGING', 60),
+  ALOPEKE_WIDE_FIELD: spec(["", 'Zorro'], 'IMAGING', 60),
   ZORRO_SPECKLE: spec(['Zorro', 'Alopeke'], 'IMAGING', 7),
   ZORRO_WIDE_FIELD: spec(['Zorro', 'Alopeke'], 'IMAGING', 60),

[Survived] StringLiteral
src/lib/geminiArchive.ts:52:24
   IGRINS_2_LONG_SLIT: spec(['IGRINS-2'], 'LS', 60),
   ALOPEKE_SPECKLE: spec(['Alopeke', 'Zorro'], 'IMAGING', 7),
   ALOPEKE_WIDE_FIELD: spec(['Alopeke', 'Zorro'], 'IMAGING', 60),
-  ZORRO_SPECKLE: spec(['Zorro', 'Alopeke'], 'IMAGING', 7),
+  ZORRO_SPECKLE: spec(["", 'Alopeke'], 'IMAGING', 7),
   ZORRO_WIDE_FIELD: spec(['Zorro', 'Alopeke'], 'IMAGING', 60),
   GHOST_IFU: spec(['GHOST', 'MAROON-X'], 'IFS', 2),

[Survived] StringLiteral
src/lib/geminiArchive.ts:53:27
   ALOPEKE_SPECKLE: spec(['Alopeke', 'Zorro'], 'IMAGING', 7),
   ALOPEKE_WIDE_FIELD: spec(['Alopeke', 'Zorro'], 'IMAGING', 60),
   ZORRO_SPECKLE: spec(['Zorro', 'Alopeke'], 'IMAGING', 7),
-  ZORRO_WIDE_FIELD: spec(['Zorro', 'Alopeke'], 'IMAGING', 60),
+  ZORRO_WIDE_FIELD: spec(["", 'Alopeke'], 'IMAGING', 60),
   GHOST_IFU: spec(['GHOST', 'MAROON-X'], 'IFS', 2),
   MAROON_X: spec(['MAROON-X', 'GHOST'], 'IFS', 1),

[Timeout] StringLiteral
src/lib/geminiArchive.ts:54:29
   ALOPEKE_WIDE_FIELD: spec(['Alopeke', 'Zorro'], 'IMAGING', 60),
   ZORRO_SPECKLE: spec(['Zorro', 'Alopeke'], 'IMAGING', 7),
   ZORRO_WIDE_FIELD: spec(['Zorro', 'Alopeke'], 'IMAGING', 60),
-  GHOST_IFU: spec(['GHOST', 'MAROON-X'], 'IFS', 2),
+  GHOST_IFU: spec(['GHOST', ""], 'IFS', 2),
   MAROON_X: spec(['MAROON-X', 'GHOST'], 'IFS', 1),
 };

[Survived] StringLiteral
src/lib/geminiArchive.ts:55:19
   ZORRO_SPECKLE: spec(['Zorro', 'Alopeke'], 'IMAGING', 7),
   ZORRO_WIDE_FIELD: spec(['Zorro', 'Alopeke'], 'IMAGING', 60),
   GHOST_IFU: spec(['GHOST', 'MAROON-X'], 'IFS', 2),
-  MAROON_X: spec(['MAROON-X', 'GHOST'], 'IFS', 1),
+  MAROON_X: spec(["", 'GHOST'], 'IFS', 1),
 };
 

[Killed] ConditionalExpression
src/lib/geminiArchive.ts:61:7
 /** The wire types carry `string` for observing modes; only keys of
  *  SEARCH_SPEC (a subset of ObservingModeType) are searchable. */
 export function archiveSearchSpec(modeType: string | null): ArchiveSearchSpec | null {
-  if (modeType === null || !Object.hasOwn(SEARCH_SPEC, modeType)) return null;
+  if (true) return null;
   return SEARCH_SPEC[modeType as ObservingModeType] ?? null;
 }
killedBy: archiveSearchSpec searches both GMOS sites with a single GMOS query
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/lib/geminiArchive.ts:61:28
 /** The wire types carry `string` for observing modes; only keys of
  *  SEARCH_SPEC (a subset of ObservingModeType) are searchable. */
 export function archiveSearchSpec(modeType: string | null): ArchiveSearchSpec | null {
-  if (modeType === null || !Object.hasOwn(SEARCH_SPEC, modeType)) return null;
+  if (modeType === null || Object.hasOwn(SEARCH_SPEC, modeType)) return null;
   return SEARCH_SPEC[modeType as ObservingModeType] ?? null;
 }
killedBy: archiveSearchSpec searches both GMOS sites with a single GMOS query
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/lib/geminiArchive.ts:128:15
 /** Angular separation between two sky positions, arcsec (haversine — exact at
  *  the arcsecond scales these cone searches produce). */
 export function separationArcsec(ra1Deg: number, dec1Deg: number, ra2Deg: number, dec2Deg: number): number {
-  const rad = Math.PI / 180;
+  const rad = Math.PI * 180;
   const dRa = (ra2Deg - ra1Deg) * rad;
   const dDec = (dec2Deg - dec1Deg) * rad;
killedBy: separationArcsec scales RA offsets by cos(dec)
statusReason: expected 8.00000000000154 to be close to 72, received difference is 63.99999999999846, but expected 0.5

[Killed] ArithmeticOperator
src/lib/geminiArchive.ts:129:15
  *  the arcsecond scales these cone searches produce). */
 export function separationArcsec(ra1Deg: number, dec1Deg: number, ra2Deg: number, dec2Deg: number): number {
   const rad = Math.PI / 180;
-  const dRa = (ra2Deg - ra1Deg) * rad;
+  const dRa = (ra2Deg - ra1Deg) / rad;
   const dDec = (dec2Deg - dec1Deg) * rad;
   const a = Math.sin(dDec / 2) ** 2 + Math.cos(dec1Deg * rad) * Math.cos(dec2Deg * rad) * Math.sin(dRa / 2) ** 2;
killedBy: separationArcsec scales RA offsets by cos(dec)
statusReason: expected 1641.3901820761623 to be close to 0.5, received difference is 1640.8901820761623, but expected 0.0005

[Killed] ArithmeticOperator
src/lib/geminiArchive.ts:129:16
  *  the arcsecond scales these cone searches produce). */
 export function separationArcsec(ra1Deg: number, dec1Deg: number, ra2Deg: number, dec2Deg: number): number {
   const rad = Math.PI / 180;
-  const dRa = (ra2Deg - ra1Deg) * rad;
+  const dRa = (ra2Deg + ra1Deg) * rad;
   const dDec = (dec2Deg - dec1Deg) * rad;
   const a = Math.sin(dDec / 2) ** 2 + Math.cos(dec1Deg * rad) * Math.cos(dec2Deg * rad) * Math.sin(dRa / 2) ** 2;
killedBy: separationArcsec is zero for identical coordinates
statusReason: expected 184744.125167438 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/lib/geminiArchive.ts:130:16
 export function separationArcsec(ra1Deg: number, dec1Deg: number, ra2Deg: number, dec2Deg: number): number {
   const rad = Math.PI / 180;
   const dRa = (ra2Deg - ra1Deg) * rad;
-  const dDec = (dec2Deg - dec1Deg) * rad;
+  const dDec = (dec2Deg - dec1Deg) / rad;
   const a = Math.sin(dDec / 2) ** 2 + Math.cos(dec1Deg * rad) * Math.cos(dec2Deg * rad) * Math.sin(dRa / 2) ** 2;
   return 2 * Math.asin(Math.min(1, Math.sqrt(a))) * (1 / rad) * 3600;
killedBy: separationArcsec measures pure declination offsets exactly
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/lib/geminiArchive.ts:130:17
 export function separationArcsec(ra1Deg: number, dec1Deg: number, ra2Deg: number, dec2Deg: number): number {
   const rad = Math.PI / 180;
   const dRa = (ra2Deg - ra1Deg) * rad;
-  const dDec = (dec2Deg - dec1Deg) * rad;
+  const dDec = (dec2Deg + dec1Deg) * rad;
   const a = Math.sin(dDec / 2) ** 2 + Math.cos(dec1Deg * rad) * Math.cos(dec2Deg * rad) * Math.sin(dRa / 2) ** 2;
   return 2 * Math.asin(Math.min(1, Math.sqrt(a))) * (1 / rad) * 3600;
killedBy: separationArcsec is zero for identical coordinates
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/lib/geminiArchive.ts:131:39
   const rad = Math.PI / 180;
   const dRa = (ra2Deg - ra1Deg) * rad;
   const dDec = (dec2Deg - dec1Deg) * rad;
-  const a = Math.sin(dDec / 2) ** 2 + Math.cos(dec1Deg * rad) * Math.cos(dec2Deg * rad) * Math.sin(dRa / 2) ** 2;
+  const a = Math.sin(dDec / 2) ** 2 + Math.cos(dec1Deg * rad) * Math.cos(dec2Deg * rad) / Math.sin(dRa / 2) ** 2;
   return 2 * Math.asin(Math.min(1, Math.sqrt(a))) * (1 / rad) * 3600;
 }
killedBy: separationArcsec is zero for identical coordinates
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/lib/geminiArchive.ts:131:22
   const rad = Math.PI / 180;
   const dRa = (ra2Deg - ra1Deg) * rad;
   const dDec = (dec2Deg - dec1Deg) * rad;
-  const a = Math.sin(dDec / 2) ** 2 + Math.cos(dec1Deg * rad) * Math.cos(dec2Deg * rad) * Math.sin(dRa / 2) ** 2;
+  const a = Math.sin(dDec * 2) ** 2 + Math.cos(dec1Deg * rad) * Math.cos(dec2Deg * rad) * Math.sin(dRa / 2) ** 2;
   return 2 * Math.asin(Math.min(1, Math.sqrt(a))) * (1 / rad) * 3600;
 }
killedBy: separationArcsec measures pure declination offsets exactly
statusReason: expected 39.99999999998067 to be close to 10, received difference is 29.999999999980673, but expected 5e-7

[Killed] ArithmeticOperator
src/lib/geminiArchive.ts:132:10
   const dRa = (ra2Deg - ra1Deg) * rad;
   const dDec = (dec2Deg - dec1Deg) * rad;
   const a = Math.sin(dDec / 2) ** 2 + Math.cos(dec1Deg * rad) * Math.cos(dec2Deg * rad) * Math.sin(dRa / 2) ** 2;
-  return 2 * Math.asin(Math.min(1, Math.sqrt(a))) * (1 / rad) * 3600;
+  return 2 / Math.asin(Math.min(1, Math.sqrt(a))) * (1 / rad) * 3600;
 }
 
killedBy: separationArcsec is zero for identical coordinates
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/lib/geminiArchive.ts:132:10
   const dRa = (ra2Deg - ra1Deg) * rad;
   const dDec = (dec2Deg - dec1Deg) * rad;
   const a = Math.sin(dDec / 2) ** 2 + Math.cos(dec1Deg * rad) * Math.cos(dec2Deg * rad) * Math.sin(dRa / 2) ** 2;
-  return 2 * Math.asin(Math.min(1, Math.sqrt(a))) * (1 / rad) * 3600;
+  return 2 * Math.asin(Math.min(1, Math.sqrt(a))) * (1 / rad) / 3600;
 }
 
killedBy: separationArcsec scales RA offsets by cos(dec)
statusReason: expected 0.000005555555555555437 to be close to 72, received difference is 71.99999444444444, but expected 0.5

[Killed] BlockStatement
src/lib/geminiArchive.ts:144:26
   files: readonly ArchiveFile[],
 ): DuplicateRow[] {
   const byObservation = new Map<string, ArchiveFile[]>();
-  for (const f of files) {
-    if (!f.observation_id) continue;
-    const group = byObservation.get(f.observation_id);
-    if (group) group.push(f);
-    else byObservation.set(f.observation_id, [f]);
-  }
+  for (const f of files) {}
   return Array.from(byObservation.entries()).map(([observationId, group]) => {
     const first = group[0]!;
killedBy: aggregateDuplicates produces one row per observation_id with file and QA-Pass counts
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/lib/geminiArchive.ts:156:38
       key: `${sourceId}:${observationId}`,
       sourceId,
       observationId,
-      passCount: group.filter((f) => f.qa_state === 'Pass').length,
+      passCount: group.filter((f) => false).length,
       fileCount: group.length,
       target: first.object ?? '—',
killedBy: aggregateDuplicates produces one row per observation_id with file and QA-Pass counts
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/lib/geminiArchive.ts:156:31
       key: `${sourceId}:${observationId}`,
       sourceId,
       observationId,
-      passCount: group.filter((f) => f.qa_state === 'Pass').length,
+      passCount: group.filter(() => undefined).length,
       fileCount: group.length,
       target: first.object ?? '—',
killedBy: aggregateDuplicates produces one row per observation_id with file and QA-Pass counts
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/geminiArchive.ts:188:15
 
 async function fetchArchive(url: string, signal: AbortSignal): Promise<readonly ArchiveFile[]> {
   const cached = responseCache.get(url);
-  if (cached) {
-    // Refresh recency: Map iterates in insertion order, so re-inserting
-    // moves this entry to the back (most recently used).
-    responseCache.delete(url);
-    responseCache.set(url, cached);
-    return cached;
-  }
+  if (cached) {}
   const res = await fetch(url, { signal });
   if (!res.ok) throw new Error(`Archive query failed: HTTP ${res.status}`);
killedBy: findDuplicates serves a repeated query from the response cache
statusReason: Failed to execute 'json' on 'Response': body stream already read

[Survived] ObjectLiteral
src/lib/geminiArchive.ts:195:32
     responseCache.set(url, cached);
     return cached;
   }
-  const res = await fetch(url, { signal });
+  const res = await fetch(url, {});
   if (!res.ok) throw new Error(`Archive query failed: HTTP ${res.status}`);
   const files = (await res.json()) as ArchiveFile[];

[Killed] ConditionalExpression
src/lib/geminiArchive.ts:196:7
     return cached;
   }
   const res = await fetch(url, { signal });
-  if (!res.ok) throw new Error(`Archive query failed: HTTP ${res.status}`);
+  if (false) throw new Error(`Archive query failed: HTTP ${res.status}`);
   const files = (await res.json()) as ArchiveFile[];
   responseCache.set(url, files);
killedBy: findDuplicates rejects on an archive error status
statusReason: expected [Function] to throw error matching /HTTP 503/ but got 'Failed to execute \'json\' on \'Respo…'

[Killed] BooleanLiteral
src/lib/geminiArchive.ts:196:7
     return cached;
   }
   const res = await fetch(url, { signal });
-  if (!res.ok) throw new Error(`Archive query failed: HTTP ${res.status}`);
+  if (res.ok) throw new Error(`Archive query failed: HTTP ${res.status}`);
   const files = (await res.json()) as ArchiveFile[];
   responseCache.set(url, files);
killedBy: findDuplicates queries the archive once per instrument and aggregates rows
statusReason: Archive query failed: HTTP 200

[Survived] EqualityOperator
src/lib/geminiArchive.ts:199:7
   if (!res.ok) throw new Error(`Archive query failed: HTTP ${res.status}`);
   const files = (await res.json()) as ArchiveFile[];
   responseCache.set(url, files);
-  if (responseCache.size > RESPONSE_CACHE_LIMIT) {
+  if (responseCache.size >= RESPONSE_CACHE_LIMIT) {
     // Evict the least recently used entry (the front of the Map).
     const oldest = responseCache.keys().next().value;

[Survived] EqualityOperator
src/lib/geminiArchive.ts:199:7
   if (!res.ok) throw new Error(`Archive query failed: HTTP ${res.status}`);
   const files = (await res.json()) as ArchiveFile[];
   responseCache.set(url, files);
-  if (responseCache.size > RESPONSE_CACHE_LIMIT) {
+  if (responseCache.size <= RESPONSE_CACHE_LIMIT) {
     // Evict the least recently used entry (the front of the Map).
     const oldest = responseCache.keys().next().value;

[Survived] MethodExpression
src/lib/geminiArchive.ts:224:10
     });
   });
   const rows = (await Promise.all(searches)).flat();
-  return rows.sort(
-    (a, b) => a.sourceId.localeCompare(b.sourceId) || (a.sepArcsec ?? Infinity) - (b.sepArcsec ?? Infinity),
-  );
+  return rows;
 }
 

[NoCoverage] ArithmeticOperator
src/lib/geminiArchive.ts:225:55
   });
   const rows = (await Promise.all(searches)).flat();
   return rows.sort(
-    (a, b) => a.sourceId.localeCompare(b.sourceId) || (a.sepArcsec ?? Infinity) - (b.sepArcsec ?? Infinity),
+    (a, b) => a.sourceId.localeCompare(b.sourceId) || (a.sepArcsec ?? Infinity) + (b.sepArcsec ?? Infinity),
   );
 }

[NoCoverage] LogicalOperator
src/lib/geminiArchive.ts:225:15
   });
   const rows = (await Promise.all(searches)).flat();
   return rows.sort(
-    (a, b) => a.sourceId.localeCompare(b.sourceId) || (a.sepArcsec ?? Infinity) - (b.sepArcsec ?? Infinity),
+    (a, b) => a.sourceId.localeCompare(b.sourceId) && (a.sepArcsec ?? Infinity) - (b.sepArcsec ?? Infinity),
   );
 }
